{

  "page_12": "An irregular older brother with a certain flaw.\nAn honor roll younger sister who is perfectly flawless.\nWhen the two siblings enrolled in Magic High School, a\ndramatic life unfolded—",
  "page_15": "The club committee headquarters, just before closing time.\n“—And that concludes my report on the incident in which the kenjutsu club\ninterrupted the kendo club’s recruitment demonstration.”\nTatsuya had just finished relating the full story of the incident he had\nwitnessed and experienced: the argument between Sayaka Mibu and Takeaki\nKirihara, their personal struggle, and the sequence of events culminating in an\nattempted brawl where Tatsuya had taken on the kenjutsu club by himself.\nThree students were in front of him.\n“I just can’t believe you fought over ten people and came away unscathed…”\nFacing him on the right was the student council president, Mayumi Saegusa.\n“Fourteen, to be exact. I guess I should expect nothing less from one of\nKokonoe’s disciples.”\nIn the middle was the disciplinary committee chairwoman—and in a sense,\nTatsuya’s boss—Mari Watanabe. Her comment was accompanied by a jovial\nlaugh. It was amused rather than derisive, and not sarcastic in any way. She\nwasn’t entirely honest with how she expressed her emotions, but her praise\nsounded sincere.\nMayumi and Mari were impressed (?) with how, after he’d subdued Kirihara,\nhe’d dealt with the frenzied group of kenjutsu club members without actually\nattacking them at all, purely by defending himself. Tatsuya, however, didn’t\ntruly feel he had shown any praiseworthy skills.\nHe was out of touch with the expected skill level of average high school\nstudents. What he’d done wouldn’t have even been up to the Yakumo temple’s\ngatekeepers’ standards. He didn’t get it—what was so good about dispatching\nfourteen people at once and being unharmed?\nInstead, he was paying more attention to the male senior on the left facing",
  "page_16": "him. That was probably Katsuto Juumonji, head of the club committee—the\neldest child of an elite Numbers family, with the juu in his name written with\nthe character for “ten.”\nHe’s like a giant boulder…\nHe stood around six feet one, so Tatsuya didn’t need to bend his neck to look\nat his face. But he had a bulky chest, wide shoulders, and muscles that bulged\ndistinctly through his uniform. And his striking physical characteristics weren’t\nthe only thing on his side. The very density of his existence had to be measured\non an entirely different scale. It was like he contained every factor humans\npossessed, compressed into the smallest space possible.\nHe was one of the three giants of First High, along with Mayumi and Mari, and\nhis appearance and impression were more than enough to convince Tatsuya of\nthat.\n“You didn’t see how it started, right?” asked Mari, having calmed herself.\nSnapping back to reality, he summoned up his memories of the incident he’d\njust finished reporting on yet again. “Yes,” he confirmed. “However, I don’t\nknow who started it. The kendo club says Kirihara provoked it, and the kenjutsu\nclub claims the kendo club made the first move.”\nTatsuya had only come in during the start of Sayaka and Kirihara’s argument.\nHe and Erika had left their spots on the viewing deck and were just about to\nleave the gymnasium when they heard noises that sounded like people fighting\nover something. From that far away, though, he couldn’t hear what they were\nsaying. By the time he’d cut through the crowd there and seen for himself, it\nwas already a touchy situation, with Sayaka and Kirihara staring each other\ndown.\n“Perhaps that’s why you didn’t intervene right at the start?” That was\nMayumi. Katsuto had been just listening the entire time.\n“I did intend to disrupt them if I decided things were dangerous,” assured\nTatsuya, though conditionally. “My thoughts were that they could deal with it\nthemselves if all that resulted were a few scrapes and bruises.”\nThe reason Tatsuya had taken an observer’s viewpoint at the beginning, like",
  "page_17": "Mayumi noted, was because he didn’t know which of them needed to be\nstopped. There was always the option of stopping both, but one of two\nconditions would need to be fulfilled for him to do so: Either there still needed\nto be enough room to talk them down, or there needed to be a justification for\noverpowering them despite how famous—or notorious—they were. Neither of\nthose had applied in this case.\nThat wasn’t his only reason, however. A disciplinary committee member’s job,\nat least as far as Tatsuya understood, was to take control of situations involving\nacts of magic-based violence. Though the contest between Sayaka and Kirihara\nwas a personal one, it started as a battle of sword skills. There had been no\nmagic involved. If Kirihara hadn’t used any—like his High-Frequency Blade—\nthen Tatsuya probably would have stuck to his guns and watched it play out.\n“…Well, that’s fine. We obviously can’t be there every time someone gets into\na fight. We don’t have enough people for that,” said Mari. Her remark was\nrooted in the rule that the club committee—not the disciplinary committee—\nwas the one that dealt with recruitment-related trouble. Neither Mayumi nor\nKatsuto had any objection to that. “What did you do with Kirihara after\nsubduing him?”\n“His collarbone was broken, so I gave him to the health-care committee. It\nwas a light enough wound that magic could heal it quickly, though. He admitted\nhis fault in the nurse’s office, so I decided no further action was necessary.”\nIn reality, getting hit with a shinai wouldn’t do any more than put cracks in a\nbone—his collarbone had been broken when Tatsuya slammed him into the\nfloor. That, however, didn’t need to be said, so he didn’t.\nMari hadn’t been present when Kirihara was hurt, nor did she see his wounds\nfirsthand. She wouldn’t have known better. “Hmm… All right. We’re leaving the\nchoice to take legal action to the other party anyway.” Tatsuya nodded briefly,\nand Mari looked at Katsuto. “That’s that, Juumonji. The disciplinary committee\nwon’t be bringing this incident to the punishment committee.”\n“I appreciate your generosity. The High-Frequency Blade is a highly lethal\nspell, and he used it in the open for a petty reason. Normally he’d face\nexpulsion for this, but I think he knows that. I will give him a good talking-to and",
  "page_18": "make sure he learns his lesson.”\n“Thanks,” said Mari. Katsuto bowed lightly, and she nodded back.\n“Will the kendo club be satisfied with that?” asked Mayumi, worried.\n“They’re equally guilty. They took the bait and got into the fight,” answered\nMari, cutting down her concern with a single stroke. “They have no right to\ncomplain.”\nThe disciplinary committee chairwoman had delivered her judgment, the club\ncommittee leader had accepted it, and the student council president had no\nobjections. That marked the end of the incident.\nTatsuya listened to their exchange with a detached attitude. It wasn’t his job\nto smother any smoldering flames of discontent. He conveyed his position by\nasking for permission to withdraw. “Chairwoman, may I leave?”\n“Oh, wait, one more thing I want to know first.” Mari’s tone of voice was\ncasual; she didn’t seem to want Tatsuya to do anything else. For today, anyway.\n“Was Kirihara the only one who used magic?”\n“That’s right,” nodded Tatsuya simply.\nMore precisely, Kirihara was the only one who had successfully executed\nmagic—but Tatsuya wasn’t possessed of the hardworking spirit he would have\nneeded to explain the particulars.\n“I see. Good job, then. You can leave.”\nWith permission to go, Tatsuya put the club committee headquarters behind\nhim.\nAfter leaving the club committee HQ, Tatsuya planned to head straight for the\nstudent council room.\nThere was only a little sunlight left. Regardless of how talented with magic\nthey might have been, it was inappropriate for girls of Miyuki’s age to walk\naround on their own at this hour. Miyuki would never have ventured to leave\nTatsuya at school and go home anyway.",
  "page_19": "Halfway there, however, he was forced to revise those plans.\nThe club committee was in a separate building from the main school building,\nwhere the student council room was. To get to the former from the latter, you\nneeded to go out to the courtyard (no need to change into your shoes—the\ncustom of wearing slippers had all but disappeared) then go around the\nentrance. But as he turned the corner he found familiar faces there to greet\nhim.\n“Oh, hey there! Good work!”\n“Tatsuya!”\nThe first one to say something was Erika, but the first one to run over to him\nwas Miyuki. The others looked surprised at her unexpected agility.\n“How was work? I heard you did a lot today.”\n“It was nothing much. Miyuki, you probably had a harder time.”\nSeparated from Miyuki only by the bag he was holding in front of his waist,\nshe looked up into his eyes; he stroked her hair a few times as her look asked\nhim to. She narrowed her eyes comfortably, but didn’t turn them away from\nher brother.\n“You know, I get that you’re brother and sister, but…” muttered Leo, walking\nover to the two of them and glancing subtly away with an embarrassed look.\n“You two look kind of picturesque…” Next to him, Mizuki blushed, but looked\nat them with a penetrating gaze.\nErika narrowed her eyes at Leo and Mizuki. “Hey… Just what are you two\nexpecting from them, anyway?” She lifted her hands to the left and right in an\nexaggerated shrug, looked down, and slowly shook her head from side to side.\nThat kind of action was obviously feigned, but it looked good when Erika did it.\n“Didn’t you just say they’re brother and sister?”\nThe implication in her repeating what Leo said as Erika stared at him seemed\nto be understood by both Leo and Mizuki. Their flustered reaction spoke to\nthat.\n“D-d-d-d-don’t be stupid! I-I’m not expecting anything!”",
  "page_20": "“Th-th-th-th-th-th-that’s right, Erika! D-don’t say strange things!”\n“…Okay, okay. I’ll be nice this time and drop the subject.”\nNevertheless, if Erika hadn’t made her wisecrack, Leo’s and Mizuki’s\nmisbegotten notions probably would have run away with them.\nIgnorant of Erika’s solitary struggle, Tatsuya finally removed his hand from his\nsister’s hair and looked at the three of them. Miyuki followed suit with a\nreluctant expression.\n—The fact that she made that kind of expression all the time was exactly why\nthey were getting those strange ideas.\nBut Tatsuya, without any expression or action that could have been linked to\nsuch flights of fancy, addressed his friends apologetically with an honest look\nand said, “Sorry—did I keep you waiting?”\nWith the odd atmosphere swept away, Leo suddenly broke into a smile and\nshook his head. “Don’t be so formal, Tatsuya. This isn’t the time for apologies.”\n“My club orientation just ended a few minutes ago. I wasn’t waiting at all!”\nMizuki, too, gave an affable smile and rejected Tatsuya’s apology as\nunnecessary.\n“He just got out of club, too. Don’t worry about it,” Erika replied arrogantly\nwith her usual mischievous smirk.\nLeo, Mizuki, and Erika all welcomed him with a smile.\nTatsuya quickly realized the truth was the opposite of what they said, but\nthey were only doing it out of consideration. He wouldn’t bring their efforts to\nnaught. “It’s late, so why don’t we grab a snack somewhere? I’ll treat you, as\nlong as it’s less than a thousand yen.”\nThe denominations of monetary units had been changed twice now, so the\nvalue of currency had been about the same for a century. One thousand yen for\na high school student was a bit on the high side, but still an appropriate line to\ndraw.\nIt was an invitation offered in lieu of any further apologies. All present\nunderstood as much, and refrained from acting needlessly reserved.",
  "page_21": "In a café different from the one they’d used on the day of the entrance\nceremony, the five students enthusiastically spoke of the various experiences\nthey’d had today—like the clubs they’d entered, having to mind their club\nrooms in the absence of others and being bored, and people hitting on them\nunder the guise of recruitment. But of the most interest was the grand tale of\nTatsuya’s arrest.\n“—This Kirihara sophomore—he used magic with rank B lethality, didn’t he?\nAnd you didn’t get hurt by it?”\n“It may be deadly, but the High-Frequency Blade has a fairly narrow effective\nrange,” answered Tatsuya to the blindly impressed Leo, shrinking back a bit. “If\nyou leave aside the fact that you can’t touch any part of the blade, it’s no\ndifferent from a well-sharpened katana. It’s fairly easy to deal with spells like\nthat.”\n“But that means you stopped someone with a sword using only your bare\nhands! Isn’t that really dangerous?”\n“It’s all right, Mizuki. You don’t need to worry about my brother.”\n“You seem pretty relaxed, Miyuki,” remarked Erika. Miyuki’s expression did\nindeed have an unnatural ease to it as she soothed Mizuki, whose own face had\nclouded over.\n“Yeah, considering you handled over ten guys, your skills can only be called\nexcellent—but Kirihara’s were certainly nothing to shake a stick at. In fact, he\nwas a cut above everybody else there. Miyuki, you really weren’t worried?”\n“No,” answered Miyuki instantly and without hesitation. “There can’t possibly\nbe anyone who can best my brother.”\n“—Umm…” Even Erika didn’t know what to say to that. She had seen\nTatsuya’s skills firsthand when it happened. Even from her point of view,\nKirihara’s swordsmanship had been merciless and keen. Tatsuya would have\nknown that his blade’s sharpness rivaled that of an actual sword. And still, he\ndidn’t use any more energy than he absolutely needed to, which had betrayed\nthe complete absence of any nervousness or fear in his mind. He had closed in",
  "page_22": "on Kirihara faster than Kirihara could bring down his shinai, grabbed its hilt,\ntwisted its wielder’s wrist, and thrown him to the floor like it was an aikido\ntechnique. In fact, Erika mused that it might have been an actual technique—\none meant to disarm an opponent.\nCalling his skills master class wasn’t an exaggeration. Tatsuya had already\nlearned enough that he’d earned the title of master. Or, at the very least,\nsomething close to it. Still, though, Erika would have been lying a little if she\nsaid she wasn’t worried.\n“…I’m not doubting your ability, Tatsuya,” began Mizuki, “but the High-\nFrequency Blade isn’t just a normal sword. Doesn’t it create ultrasonic waves?”\n“Oh yeah, I’ve heard of it, too,” remarked Leo. “Don’t some people use\nearplugs when they cast it so they don’t get sick on the waves? Well, I guess you\nwould have already considered that.”\n“That’s not it. It isn’t just because of my brother’s superb physical abilities,”\nanswered Miyuki to their worried questions. She, however, seemed to be\nholding back a smile. “Nullifying magic programs is my brother’s forte.”\nErika lost no time in getting a word in. “Nullifying magic programs? Not, like,\nInformation Boost or Area Interference?”\n“That’s right,” nodded Miyuki meaningfully. Tatsuya gave a resigned smile.\nErika looked at them in turn and muttered, half in admiration and half in\nastonishment, “That, uh, sounds like a pretty rare skill to have.”\n“Yes. At least, I don’t think they teach it in high school. Not everyone who\nlearns it can actually use it. Erika, right after my brother ran out there, did you\nfeel like the floor was wobbling?”\n“Hmm… It didn’t do much to me, but I think there were kids who came down\nwith a bad case of motion sickness. Come to think of it, it wasn’t just at the\nstart. Smaller ones kept happening during the fight, too, I think…”\n“That was my brother’s doing. Tatsuya, you used Cast Jamming, didn’t you?”\n“You always see right through me, Miyuki.”\n“Well, of course. I know everything about you.”",
  "page_23": "“Wait, wait, wait!” interrupted Leo, grimacing as the two exchanged smiles—\none dry, and one happy. “That’s not how siblings talk to each other. You’re even\npast the level of a married couple!”\n“You think so?” “Is that so?” answered Tatsuya and Miyuki in perfect\nharmony. For a full second, Leo froze, then collapsed onto the table entirely\ndrained of energy.\n“…It would be absurd to try and get a word in when they’re in newlywed\nmode like that,” said Erika quietly to him. “I told you, you never stood a\nchance.”\n“Yeah, I was wrong…” Leo answered, also quietly, sitting back up.\n“This is not something I would willingly have people say about us…”\n“Oh, but it’s true,” said Miyuki soothingly and fluidly. “My brother and I are\nbound together by strong fraternal love.”\nThis time, both Erika and Leo fell onto the table at the same time. “Ghah!”\nLeo even made his own sound effect as though blood were spurting from his\nnose, expressing his sentiments.\nAnd still Miyuki didn’t stop. “I do adore my brother more than anyone else in\nthe world.” She moved her chair and brought her body near Tatsuya’s, then\npassionately looked up into his eyes, all as if putting on a show for their friends.\n“Ah, okay, I think I’m going home now,” said Erika, utterly sulking, her cheek\nstill plastered to the table.\n“Miyuki, don’t get carried away, all right? There’s, let’s see…approximately\none person who doesn’t understand it’s a joke.”\n“…” “…” “…”\nAfter Tatsuya grinned drily and chided Miyuki, she, Erika, and Leo all looked\ntoward the last person present.\n“…Huh? What? A joke?” Mizuki’s gaze was downcast, and her face flushed red\n—her eyes were even darting from left to right. Someone sighed.\n“…Well, that’s what makes Mizuki who she is, I guess.”",
  "page_24": "At Erika’s heartwarming murmur, Mizuki groaned, her face turning red for a\ndifferent reason.\nThen, despite having been strung along himself, Leo couldn’t seem to take the\ncreepy atmosphere any longer, and forcibly brought the conversation back to\nits original topic. “…By the way, you mentioned Cast Jamming, didn’t you?”\n“Well, it’s a secret, but yes.” This wasn’t a topic Tatsuya much wanted to\ndiscuss, but he probably cared more about dispelling the air that had formed\naround them. He went along with Leo’s suggestion without any other choice.\n“Cast Jamming… That’s jamming magic waves, right?”\n“They’re not waves,” retorted Leo, though it was better left unsaid.\n“It’s a figure of speech!” Erika shot with a straight face, turning her gaze back\nto Tatsuya.\nCast Jamming was a type of magic that prevented magic programs from going\nto work on the information bodies called eidos that were incidental to\nphenomena. It could be broadly classified as having the same properties as\ntypeless magic.\nThere was another spell called Area Interference that also nullified an\nopponent’s magic. This spell used a magic program that specified only\ninterference strength in a fixed area around the caster and prevented all\nalterations to information in that area. Using it would shut down the other\nperson’s magic program interference. Cast Jamming, however, worked by\nscattering large amounts of psionic waves, or psi-waves—a technique to\nprevent the process by which magic programs interacted with eidos.\nIn a way, Area Interference “reserved” magic in an area and prevented other\ncasters from interrupting with their magic. Fundamentally, you needed more\nmagical influence than the opponent.\nOn the other hand, Cast Jamming affected the metaphorical radio tower that\nother users tried to upload data to. By requesting a huge amount of access, it\nwould reduce their upload speed to almost nothing. One’s magical influence\nwasn’t that much of a problem. In exchange, the psionic noise could obstruct all\nfour families and eight types of magic—following with the radio base example,",
  "page_25": "by rapidly and irregularly changing the frequency of the waves. It would require\none to create enough waves to completely block off an entire region with just\none transmission antenna.\n“But don’t you need a special rock for that? Anti…anti-something.”\nErika broke off at an odd point, unable to remember the proper noun. Mizuki,\nwho had managed to revive herself, threw her a lifeboat. “It’s antinite, Erika.\nTatsuya, do you own any antinite? I thought it was really expensive.”\nAntinite was known to be a substance that could generate enough psionic\nnoise to fulfill this condition. While it was theorized that a magician could\ncreate the noise needed for Cast Jamming with their own calculations, it was\nnevertheless difficult to implement.\nUnlike Area Interference, Cast Jamming would obstruct the caster’s own\nmagic as well. Even if a magician tried to construct the noise for Cast Jamming\nconsciously, his or her unconscious would instinctively reject it. (The magic\ncalculation region formed within a person’s unconscious, so it prioritized\nunconscious control over conscious control.) Because of this, antinite—which\ncould generate the required noise just by emitting psions—was thought to be\nindispensable for using Cast Jamming.\nTatsuya’s answer, however, overruled common sense. “No, I don’t have any.\nIt’s a military-grade product in the first place, after all. The problem isn’t the\nprice—civilians can’t get it.”\n“Huh? But you just said you used Cast Jamming…” Erika was the one who\nactually spoke, but both she and Leo looked at him incredulously.\nHe paused for a moment, his face troubled. Then he leaned over the table\nand said lowly, “Uh, this is all off the record, okay?” The other three, now\ndrawn in, leaned forward as well, nodding in seriousness. “It’s not technically\nCast Jamming. What I used is Specified Magic Jamming. It operates under the\nsame theory.”\nUpon hearing Tatsuya’s whispers, Mizuki looked startled and blinked a few\ntimes over. “Umm… I didn’t know magic like that existed.”\nErika was the one to directly answer that question. “I don’t think it does,” she",
  "page_26": "said. “Doesn’t that mean you worked out the theory for a new spell?” Once\nagain, her voice sounded more appalled than impressed or shocked.\nThere were plenty of magicians who used their own, original magic—and\nplenty of up-and-coming ones who specialized in original magic from a young\nage. However, that was a case of them instinctively—or intuitively—coming up\nwith magic in a natural way. There weren’t many magicians who could\nconstruct new magic from a theoretical standpoint.",
  "page_28": "Magic depended heavily on the use of one’s unconscious.\nWhile it may have been easy to retroactively attach a theory to magic one\ncould use unconsciously, creating a new spell on a theoretical level—even if it\nwas a simple variation on an existing one—demanded a complete and total\nunderstanding of the spell’s construction and the principles it operated under.\nSomeone the age of a high school student formulating a theory for a new\nspell wasn’t just abnormal—it made no sense.\n“It was less me working it out and more a chance discovery,” answered\nTatsuya, smiling at Erika’s straightforward reaction. “You know that in most\ncases, when you try to use two CADs at once, the psi-waves interfere with each\nother and the magic doesn’t go off, right?”\n“Yeah, I learned that the hard way,” nodded Leo.\n“Whoa, that’s way out of your league,” muttered Erika, appalled at Leo’s\nwords.\n“What was that?!”\n“You were trying to use two brooms to cast magic in parallel! If you thought\nyou could pull off a high-level technique like that, then you were way out of\nyour league.”\n“Oh, shut up. I thought I could! Since I can activate multiple spells as long as\nthey’re my type, you know.”\n“No way. Seriously. Amazing.”\n“…You’ve made your point already, so quit talking in monotone. It’s making\nme even angrier.”\n“H-hey, come on, let’s listen to what Tatsuya has to say!”\n“…”\n“…Hmph.”\nErika and Leo looked away from each other.\nTatsuya shrugged at Mizuki, whose gaze was wandering to and fro. “I’m fine\nwith stopping here…but you want me to keep going? I don’t mind, I guess…",
  "page_29": "“The psionic interference waves emitted when using two CADs at the same\ntime, just like with Cast Jamming, get sent to the Idea, which contains the eidos\nof events near the magician. With one CAD you expand an activation program\nfor the spell that will do the obstructing, then with the other CAD you expand\nan activation program in the opposite direction. Then you make multiple copies\nof the activation programs without actually converting them into magic\nprograms. If you release the resultant psionic signal waves as typeless magic,\nthen—to a certain extent—you can block the activation of spells that are the\nsame type as the two magic programs you would have created from the\nactivation programs with each CAD.\n“Even for persistent spells like High-Frequency Blade, you can’t maintain the\nmagic program’s effects indefinitely. At some point, you’ll have to expand\nanother activation program and redo it. I just happened to figure out the exact\ntiming to do that in this case.”\n“Seriously…” whispered Leo. His monotonous tone revealed that it wasn’t\nonly his expression that was dumbfounded.\nAll of a sudden, Mizuki coughed. She had nearly choked on her straw—she’d\nbeen slurping from it even after her glass had been emptied. Her emotions\nseemed to finally snap out of her trance because of the painful coughing, and\nher face gave way to shock.\nErika furrowed her brow, silently thinking about something. It didn’t look like\nanything particularly pleasant given the grim look on her face, but it didn’t seem\nlike she was particularly unhappy with anything.\n“…I have basically no idea what you would actually do, but I think I\nunderstand the logic behind it. But why is this all off the record? If you patented\nit you could probably make money off it,” said Leo, managing to restart his\nthought processes and evidently not satisfied.\nIn response to his confusion, Tatsuya grinned bitterly—more bitterly than\nhappily. “First, because this technique is incomplete. It just blocks the spell the\nenemy is in the middle of activating; it isn’t like they can’t use magic at all, it\njust gets harder. The user, however, can’t use magic at all after using this. That\nin itself is a fatal flaw, but the more important issue is that it can obstruct",
  "page_30": "casting without using antinite.”\n“…Why is that a problem?” asked Leo, more unsatisfied than suspicious.\nErika, who had been lost in thought, scolded him in a fairly serious manner.\n“You’re an idiot. Of course it’s a problem. Magic is currently something that\nnational defense and peacekeeping forces need at all costs. If some easy,\nmagic-nullifying technique that didn’t need expensive antinite or a lot of magic\npower started to spread, it could shake the foundations of society.”\n“Those are my thoughts as well. There are even radical groups advocating for\nthe abolition of magic on the grounds that it’s somehow a source of\ndiscrimination. Not much antinite gets produced, so it doesn’t realistically\npresent a threat. Until they can find a way to deal with it, I don’t want to go\npublic with this Cast Jamming imitation.”\nLeo nodded a few times, his curiosity appearing sated at last. For some\nreason, Mizuki was nodding with the same expression. “That’s amazing,” she\nsighed in admiration. “You thought so far ahead.”\n“Yeah, I would’ve probably gone straight for the fame and popularity!” sighed\nLeo in turn.\nMiyuki gave a soft, reserved smile at him. “I believe my brother is thinking a\nlittle too hard about it, to be honest. It isn’t as though just anyone can read an\nactivation program as an opponent is expanding it, or project CAD interference\nwaves. But I suppose that is just how he is.”\n“…How I am? Are you calling me lazy and indecisive?”\n“Well, I don’t know. What do you think, Erika?” said Miyuki with feigned\nignorance, throwing the ball to Erika.\n“I don’t know. I, for one, want to hear Mizuki’s opinion on it,” said Erika in an\naffected tone, tossing the ball back into Mizuki’s court.\n“Huh? Um, I, well…”\n“No one’s going to disagree for me…?” With Tatsuya’s rueful stare turned on\nthem, Miyuki constructed a cheerful smile and averted her eyes, Erika hid her\nface behind her menu, and Mizuki’s eyes darted back and forth, unsure—but",
  "page_31": "from none of them came any help.\nTatsuya was on the run again today.\nThe new club member recruitment week (which was the fancy term for all\nthis horseplay) was already on its fourth day. Though perhaps the word still\nwould have been more apt than already…but regardless, it was busy. It seemed\nbackward to him that it was far more exhausting after school than during\nclasses, but unfortunately, nobody would listen to his objections.\nIt made him wonder what resort in which time period these barkers belonged\nto—or rather, these solicitors—or sorry, the recruitment officers. Instead of\ncutting through the jam-packed schoolyard, he avoided it (he’d learned on the\nsecond day there was no point in volunteering himself for labor like that) and\nran toward the location from which he’d received the report of trouble.\nOn the way there, from the other side of the tent-forested area in the shade\nof some trees, he detected signs that someone was about to fire magic at him.\nIt wouldn’t interfere with him directly—it seemed to be a spell to upturn the\nground at his feet (more accurately, to shift the ground under his feet on top of\nthe ground to the front and back).\nNot again, he thought, sick of it. He must have stood out too much on the\nfirst day. Now people were bullying him like this all the time.\nThanks (?) to that, though, he’d gotten used to it. In an unhurried, matter-of-\nfact way, he activated his Cast Jamming imitation and matched it with the\nspell’s type. He actually possessed a way of nullifying the spell more easily, but\nthe kind of aftereffects it would cause made it highly probable he’d have a pain\ndealing with it later. One of the valuable teachings he’d acquired during his\nshort life thus far was that cutting corners never led to anything good.\nHis psionic wave spread and dispersed, and the magic program dissipated\nwithout going off.\nWithout stopping even a moment, he took a sudden turn.\nCutting corners really wasn’t ever a good thing. Maybe it was because he’d let\nthings be since they didn’t actually harm him, but the number of times he’d",
  "page_32": "experienced magic harassment like this had been escalating rapidly. He’d been\nignoring it out of his responsibilities as a disciplinary officer, but at this point, he\nthought it was okay to start taking his self-defense more seriously.\nHis opponent, however, was shrewd as well. Right as Tatsuya turned toward\nhim, he leaped out of the shade with speed impossible by pure physical talent.\nWhoever it was had probably prepared a high-speed running spell beforehand\nby combining movement magic and anti-inertial magic. The issue with such\nspells was that your legs wouldn’t normally be able to keep up with the speed\nand you’d fall, but the culprit seemed to be quite physically fit.\nTatsuya judged it would be hard to apprehend the person in a short time and\ncanceled his pursuit.\nThe only clues he’d gotten were the tall, thin stature of the culprit and the\nwhite wristband, lined with red on blue on either edge, he wore on his right\nhand.\nA week passed.\nThe new club member recruitment week had been a torrent of events for\nTatsuya.\nHe was probably the busiest out of all the members of the disciplinary\ncommittee.\n—For slightly different reasons than you might think.\nTakeaki Kirihara, whom Tatsuya had subdued on the first day, was apparently\none of the school’s most hopeful competitive magic athletes. Some held the\nopinion that Tatsuya could dispatch him so easily because Kirihara had been\nhurt during his duel with Sayaka Mibu before Tatsuya had gotten involved.\nHowever, most of the students who weren’t aware of the finer details of the\ncompetitive magic athlete certainly weren’t too pleased with the incident\nwhere the regular athlete had been beaten by a freshman—and a Weed, at\nthat.\nAs a result…\n“Tatsuya, you got disciplinary committee stuff again today?” asked Leo,",
  "page_33": "picking up his bag and getting ready to go home.\n“I’m off today. Looks like I’ll finally get a break.”\n“You did a bang-up job, after all.”\n“I’m not at all happy about it, though,” sighed Tatsuya glumly.\nLeo was clearly holding back laughter. “You’re a celebrity now, Tatsuya! The\nmysterious freshman who went undefeated against all the regular magic\nathletes in the room—that’s what they’re saying.”\n“Mysterious? Why…?”\n“There’s one theory that you’re a hired killer sent by a magic opposition\ngroup!” That was Erika poking her face into the conversation, also just about\nready to go home.\n“Who on earth would spread such irresponsible rumors…?”\n“Me!”\n“Hey!”\n“I’m joking, of course.”\n“Give me a break… You’re really nasty, you know that?”\n“But it’s true that the rumors exist.”\nTatsuya ended up sighing once again at the substance of the rumors Erika had\nbrought to him. He didn’t think anyone would readily believe such groundless\nstories—at least he didn’t want to. It was fully within the realm of expectation\nthat someone or other would take advantage of the talk and make a move on\nhim, though.\n“That was quite a sigh!”\n“No empathy at all, I see… Try putting yourself in my shoes. I almost died\nthree times this week!”\n“No thank you!” Leo wasn’t trying to hide the amusement from his face.\nTatsuya felt an urge to punch him in the nose, but instead he just breathed a\nthird sigh.",
  "page_34": "Takeaki Kirihara, viewed as the top of the sophomore class in terms of\npractical ability, was the next ace of the kenjutsu club. And a freshman Weed\nhad beaten him. As stated before, the news surprised and infuriated those\nsteeped in a superficial stance of them being some “chosen ones.” They\ndirected their completely unfair anger and resentment at Tatsuya. Currently,\npeople bent on misdirected acts of retaliation were coming out of the\nwoodwork.\nNevertheless, instigating any direct fights would mark them as targets to be\npurged. He was backed by the disciplinary committee chairwoman. Everyone,\neven those without intimate details of the situation, could easily imagine the\nstudent council and the club committee coming to his aid.\nThen what should they do? The standard move would be to pretend like it\nwas an accident. And that’s what they did. They would wait for Tatsuya to\napproach on his patrol, then create an intentional quarrel. When he stepped in\nto mediate, he would be hit with magical attacks made to look like misfires.\nThat seemed to be the pattern.\nFrom Tatsuya’s point of view, incidents were suddenly breaking out wherever\nhe went, one after another. It was unbearable. But as long as he was a\ndisciplinary committee member, he couldn’t ignore them and pass by—he\nneeded to make an effort to bring the situations under control.\nOn top of that, people were just flinging magic at him at random, too. He was\nable to nullify most of them before their effects manifested and escape danger,\nbut there were some he couldn’t completely quell, too.\nHe’d known on the first day that people seemed to be after him, but he\ncouldn’t do anything until he discovered proof that it was all secretly connected\n—and by the time he did, recruitment week would be over.\nIn other words, he couldn’t help running right into every trap.\nHe had only discovered a culprit during that one incident on the fourth day,\nbut he had fled as well. The person was, after all, a student studying at the elite\nFirst High. In general, everyone here was extremely skilled in their methods.\nTatsuya got the feeling, though, that the time, place, and objective for their\nsuperb abilities couldn’t have been more thoroughly mistaken.",
  "page_35": "“…When I think about it, it’s amazing I didn’t get hurt…”\n“They’re putting the restriction back on carrying devices around today, so you\ndon’t have any more to worry about, right?” said Mizuki, trying to console him.\n“I sure hope so,” said Tatsuya, taking the opportunity to nod.\nThe student council may have had off-seasons, but it had no days off. It didn’t\nwork on a shift system, after all. Miyuki had to work at the student council again\ntoday. And for the siblings, leaving one at school and going home alone wasn’t\nan option. From an objective spectator’s point of view, it was their own fault\nthey were teased as having a brother/sister complex.\nNevertheless—“I’m sorry, Tatsuya. I will need to make you wait for me…”—as\nlong as they still had the good sense to feel guilty over making the other wait,\nthey could still be saved.\n“Don’t worry about it… Well, you probably can’t do that, can you…” Tatsuya\nsaid, smiling, patting his sister’s head a couple times.\nIt would be more apt to call it a pet than a pat. His hands were gentle, and\nMiyuki bashfully—but comfortably—narrowed her eyes.—While walking\nthrough a hallway with students going home.\nTheir display of intimacy was prone to being misunderstood (?). The glances\ncast toward the two heading for the student council room were a mix of\ngoodwill and malice. However, there was a marked difference in them from the\nall-too-common stares given to couples that were too friendly with each other,\nand Tatsuya pulled his hand away when he felt the malicious ones.\nWhen he walked with Miyuki like this…\nUntil last week, the greater portion of those mean looks would have been\nridiculing. Now, there was a hateful antipathy…and, peeking out from behind it,\nfear. Not the awe given to the strong…but the fear given to the unknown. The\nCourse 2 students who should have been relieved at his actions were doing the\nsame.\nAll that said, this was the first time this week he was spoken to by someone\nhe didn’t know.",
  "page_36": "“Shiba?”\nTatsuya and Miyuki turned around in sync. His physical abilities were clearly\nsuperior. The reason they reacted at the same time regardless was because\nMiyuki’s act was done out of reflex, whereas Tatsuya hadn’t been completely\nsure the person had been talking to him.\n“Hello. And pleased to meet you, I suppose?”\nIt was a fairly pretty girl with medium-length hair pulled back in a ponytail. A\nstrange hairstyle, but Tatsuya remembered seeing her face. “You’re right, nice\nto meet you. Your name is Mibu, right?”\nShe was the sophomore in the kendo club who was essentially the beginning\nof his week of violence—and one of the parties involved in the kendo club\nintrusion incident.\nTatsuya stopped, and she approached with unhesitating movements. Either\nshe was fearless by nature, or free of worry because he was younger. Or maybe\nshe held him in disdain for the same reason. Whichever the case was, it was\ncertainly better than awkward reservation.\nMiyuki aligned her movements with the upperclassman as she stopped before\nher brother and took a half-step back. She was in a spot just out of Tatsuya’s\nfocus, but naturally inside it if he turned the slightest bit away.\n“I’m Sayaka Mibu. I’m in Class E, same as you.” Tatsuya’s eyes were naturally\ndrawn to Sayaka’s left breast. Sewn onto her green blazer was a plain green\npocket. He realized immediately that’s what she meant by same.\n“Thanks for before. You saved me, and I didn’t thank you—I’m sorry.” She\ngave him a friendly smile, steeped in the charm boys her age would be hard-\npressed to resist. Though it was a term not to be used easily around those who\ncould manipulate magic, in a literary sense, one could say her appeal had magic\nhidden in it that would steal your heart away. —Well, in popular literary terms,\nanyway.\n“In addition to thanking you, there’s something I’d like to talk to you about…\nDo you have time to come with me for a little bit?”\nWhether or not she was conscious of the effect her smile had on male high",
  "page_37": "school students was up for debate, but she probably understood it quite well.\nAlthough, for Tatsuya, with his too-beautiful sister at his side, it might have\nbeen somewhat uncomfortable.\n“I can’t right now.” Sayaka seemed more shocked than annoyed at his brief\nrejection, to which he followed up with, “Are you free in fifteen minutes?”\nAt Tatsuya’s words, spoken quite definitively, she looked at him with a\ndesolate, even blank expression, then hurriedly blinked a few times, and finally\nseemed to understand what she’d just been asked.\n“Oh, yes, that works. I’ll wait for you in the cafeteria.” Though quite flustered\nat the unexpected response, she succeeded in obtaining Tatsuya’s promise.\nTatsuya could only accompany his sister as far as the door of the student\ncouncil room. Were he to enter, he’d probably see Hattori. Neither of them\nwould be very comfortable if that happened, so Tatsuya, with nothing to do\nthere anyway, had been naturally avoiding the student council room after\nschool.\n“All right, I’ll be waiting for you in the library.”\nUntil yesterday, Miyuki had always been waiting for Tatsuya. This was the first\ninstance of him waiting for her, but it was the pattern he’d simulated in his\nhead before school had started. He knew that she would surely come into some\nsort of official position. Therefore, he would not mistake how to spend his time.\nAll the more because one of the reasons he’d come to this school in the first\nplace was for the private literature and records he couldn’t access except from\norganizations related to the National Magic University.\n“The library?”\nBut Miyuki, who would have known all that, tilted her head and repeated\nwhat he’d said. Even he couldn’t help but let doubt creep into his voice. “…\nThat’s my plan. Why?”\n“No, it’s just that you were going to go see Mibu in the cafeteria after this,\nso…” Miyuki’s eyes were directed toward his collar.\n“Miyuki?” Despite him saying her name, she didn’t bring her face back up.",
  "page_38": "She didn’t try to meet his gaze. In fact, she averted hers to the side.\nTatsuya didn’t understand why his sister was acting this way. In anyone else’s\ncase she would have been sulking, but that was the one thing his sister would\nnever do. Although he tried to get an answer out of her, the student council\nroom was before their eyes and both were making people wait. “I don’t think\nit’s going to take very long. She probably just wants to recruit me for her club.”\nHe knew as well as anyone that was mistaken…but it gave him a chance to\nresolve the situation.\n“…Is that really all it will be?”\n“What?”\n“Is it just a club recruitment offer? I think it might not be. I don’t have a\nreason, but…I feel rather anxious. I’m very happy that you have won a\nreputation…but if they knew even a fraction of your real power, there would be\nmany flocking to use you for their own ends. I think that those who wouldn’t\nare in the minority. Please, take extra care.”\nIt would have been easy to laugh it off as imaginary fears…if it hadn’t been\nMiyuki Shiba saying it. “…Don’t worry. I’ll be fine no matter what happens.”\n“That’s why I’m so worried!”",
  "page_40": "At last, Tatsuya got a dim idea of what his sister was afraid of. “…I’m all right. I\nwould never get that desperate.”\n“…That’s a promise, Tatsuya.”\n“All right… By the way, Miyuki, I don’t think some committee activities in high\nschool are enough to be called winning a reputation.”\n“…Geez! What does it matter, really? To me, your very name is famous,\nTatsuya!”\nMiyuki twirled herself around and headed for the card reader. Her cheek,\nhidden behind her black hair fluttering in an arc, was tinged with crimson.\nHe immediately found who he’d come here to meet—Sayaka was standing\nright near the entrance. “I wouldn’t have minded if you’d sat down to wait.”\n“But then you might not have noticed, Shiba. I’m the one who invited you, so I\ndidn’t want to make you need to look.”\nIt was a very feminine concern for him, or maybe it was just because she was\nolder. But Tatsuya got the impression she didn’t understand much about\nherself. She was sticking out like a sore thumb. He’d have to prepare himself for\nmore annoying rumors after this. He sighed as the thought of the faces of two\ncertain upperclassmen who would laugh mightily at his expense crossed his\nmind.\nOf course, he wasn’t careless enough to let his sigh show on the surface—on\nhis face. He was meeting this girl for the first time, so it would be rude to sigh at\nher as soon as he met her. “In any case, let’s sit down. Then we can talk.”\n“It’s not very crowded, so we should buy drinks first.” That was neither a\nquestion nor an invitation, but an assertion. He was a little surprised by it, but\nhe wasn’t about to suggest otherwise.\nHe bought coffee, and she juice; then they sat down at two empty seats,\nfacing each other. He took a sip of his coffee, then, with the cup still in his\nhands, looked toward the opposite seat.\nSayaka focused on slurping up the brilliant scarlet liquid through a straw. She",
  "page_41": "downed two-thirds of it in one go and finally looked back up.\nTheir eyes met.\nShe looked taken aback, and immediately reddened. It seemed very much like\nthe hue of the juice had made its way into her face.\n“…Do you like that kind of juice?” It was a plain question for Tatsuya, but…\n“Mmgh… Who cares? I like sweet things! I’m basically just a child, after all!” …\nShe suddenly grew angry—no, sulky, even.\nIf it’s so embarrassing, then why did you bother getting it? thought Tatsuya.\nHe also felt that her degree of shyness and her level of defenselessness weren’t\nin balance. But what he actually said was on a completely different vector. “I\nlike sweet foods, too. I’ve never had that before, but I drink juice often at\nhome.”\n“You do?”\n“Yes.”\n“Oh…”\nHe didn’t actually do anything of the sort, but Sayaka put a hand to her chest\nand sighed in relief. The action didn’t make her look older than him—she\nseemed quite different from last week.\n“Umm, well. Leaving all that aside… Again, thank you very much for last week.\nIt was thanks to you the situation didn’t get out of hand.” She touched her\nknees together and placed her hands on them, straightened her posture, and\ngave a bow.\nShe was certainly the kendo belle—she seemed much more like that now than\nthe “cute girl” she’d been until last week. He let his half-automatic observations\nflow toward the back of his mind and gave a noncommittal answer. “You don’t\nneed to thank me. I was doing my job.”\nSayaka didn’t seem satisfied with his formal reply, however. “I don’t mean for\njust stopping Kirihara. That was a stupid duel we were having. Kirihara and I\nwere one thing, but I wouldn’t have been surprised if both the kendo club and\nthe kenjutsu club were punished. It was resolved peacefully because you",
  "page_42": "insisted there was no harm done, didn’t you?”\n“It really wasn’t anything to make a big fuss about anyway. Aside from you\nand Kirihara, nobody was injured. After that it was just the kenjutsu club going\nnuts, so at the very least, the kendo club wouldn’t be blamed for anything.”\n“But that’s because you were fighting them—that’s sort of why it wasn’t a big\nproblem. If it was anyone else, people would have gotten hurt for sure. Maybe\nother people could have stopped them without hurting them, but you dealt\nwith so many of them without even letting yourself get hurt. I’m still in\ndisbelief! I think the kenjutsu club should thank you for going easy on them.\n“And about that, I did let Kirihara get hurt…so this might sound like an excuse\nor kind of unfeminine, but… If you do martial arts for a while, this kind of thing\nhappens. The time comes, no matter what, when you can’t hold back your\ndesire to display your own strength in the process of achieving mastery. Shiba,\nyou know what I mean?”\n“I see—yes, I know.”\n—That was a lie. At least half of it, anyway. He didn’t see his training as being\nmartial arts. They were nothing more than combat techniques he was studying.\nHe could understand the appeal of wanting to show off your ability to carry out\nyour duty, but simply put, he had never had anything to do with impulses to\nsimply flaunt his strength.\n“Right?” However, Sayaka wouldn’t have known much about what was deep\ninside him—obviously, since they’d only first talked to each other today. “No\none needs to make a huge deal out of everything. Well, if people had been\ninjured during that brawl, it would’ve probably been a big problem, but Kirihara\nwas actually the only one who really got hurt. He and I were both fighting well\naware we could get hurt, so it’s nobody’s business to make a fuss out of it.”\nThat’s wrong, thought Tatsuya. The problem was that Kirihara had broken the\nrules and used a highly dangerous spell. In principle, recruitment week troubles\nwere handled within the club committee. If things would have ended with just\nSayaka and Kirihara swinging their shinai around, Tatsuya would never have\nintervened, and Mari probably would have kept out of it, too.\nOf course, he said none of this aloud.",
  "page_43": "“But there’s still a lot of people who want to make such a small thing into a\nproblem. A lot of students have been exposed for the same kind of thing—just\nso the disciplinary members could get better grades.”\n“…I am a member of the disciplinary committee at the moment, so…sorry.”\n“I-I’m sorry! I didn’t mean it like that, really!” Feigning an ashamed\nexpression, she looked at Tatsuya, who was bowing his head. Sayaka, suddenly\nflustered, began to explain herself in a mad haste. “What I wanted to say was\nthat you’re different from them, and that’s why you helped me, and um, I didn’t\nwant to bad-mouth the disciplinary committee—well, I don’t like them, but,\numm…?”\nTatsuya expressionlessly observed Sayaka as her gestalt collapsed…though his\nown eyes were smiling. The random list of words she was saying had already\nlost all meaning, and they quickly faded out. Soon, he only saw her mouth\nopening and closing, with no sound coming out—and then she noticed the\nsmirk in his gaze and looked down, embarrassed.\n“…Hey, Shiba, you’re kind of a bully…”\nHe felt like he’d heard that before. “I am not possessed of such a unique\ninclination,” he said nonchalantly, pretending he didn’t know what she meant.\nThen, forestalling any argument to the contrary, he continued. “So what did you\nwant to talk about?”\n“…I’ll come right out and say it.” Her lips were saying otherwise, but maybe\nshe gave up or her sense of objective won out, because then she said, “Shiba,\nwill you join the kendo club?”\nFinally, she began to talk about the original reason he was here.\nIt was so predictable he couldn’t deny feeling slightly deflated, but he already\nhad an answer. If she’d said that from the start, this would have gone more\nquickly, he thought, a little irritated. He gave her his prepared reply. “I’m\ngrateful for the offer, but I have to decline.”\n“…May I ask your reason?” Sayaka couldn’t keep the shock out of her face at\nTatsuya’s immediate response, to which he didn’t seem to have given even the\nslightest bit of thought.",
  "page_44": "“Actually, I’d like to ask why you invited me. My skills are empty-handed ones\n—they’re completely different from kendo. With your level of skill, you know\nthat, right?”\nHis tone was a calm one, not particularly rough or provocative, but there was\nan unmistakable sharp edge to what he’d actually said.\nSayaka’s gaze wandered through empty space. She looked like she was\ndesperately seeking an escape route. In a way, she probably was. After\nbreathing a single sigh, she began to speak in an abstract way. “One’s grades in\nmagic are treated as the most important thing at Magic High School… I knew\nthat much from the start, and still enrolled here. But don’t you think it’s wrong\nto decide everything just based on that?”\n“Please, continue.”\n“There’s no helping the fact that classes are separate. We just don’t have any\npractical ability, that’s all. But that’s not all being at high school is supposed to\nbe. Even clubs are prioritized based on magical talent, and that’s wrong.”\nJust from what Tatsuya had seen this past week, there was no truth to the\nstatement that clubs unrelated to magical competition were being unfairly\noppressed by the school. It was true that the school provided various forms of\nsupport to competitive magic clubs. However, that was part of their advertising\nto make them look better as a magic high school, done from an administrative\nperspective.\nIn his view, this girl was making this fervent speech because she couldn’t tell\nthe difference between her not being given preferential treatment and her\nbeing given the cold shoulder.\nHowever, that proved to be too hasty a conclusion. “I can’t stand even my\nsword skills being scorned just because I can’t use magic very well. I can’t\nendure them being ignored. I won’t let them deny everything I am just because\nof magic.”\nHer tone was unexpectedly strong. The emotion in it was beyond conviction,\ncloser to deep-seated delusion—that’s what Tatsuya felt.\nPerhaps feeling uncomfortable at Tatsuya’s steady, serious stare, Sayaka",
  "page_45": "cleared her throat and repositioned herself. “The noncompetitive magic clubs\nhave all decided to be allies. We got a lot of people who agree even from\noutside the kendo club. We’re planning to create an organization separate from\nthe club committee and announce our thoughts to the school at some point this\nyear. I would like you to help as well, Shiba.”\n“I see…” He’d thought her more the idol type, but she was a true warrior\nwoman. He smiled at how mistaken his impression had been.\n“…Are you making fun of me?” It seemed she’d mistaken his smile.\nHe felt like leaving her misunderstanding alone would mean she wouldn’t\nbother him in the future, but he went and said something he didn’t need to\nanyway. “That’s not what I meant. It was just funny how I thought wrong about\nyou. I thought you were just a pretty girl who does kendo—I misjudged you…”\nThe second sentence was spoken half to himself. Ever since enrolling, there\nhad been attractive girls appearing one after the other, each with one or two\nquirks. He actually felt like laughing loudly about having unconsciously hoped\nthis one would be a normal, pretty girl.\n“Pretty…” Perhaps because his awareness was directed inward at that time,\nSayaka’s mutter, her face flushing with red, and her suspicious fidgeting all\npassed him by.\n“Mibu?”",
  "page_47": "“Wh-what is it?”\nStill unaware of it, and suppressing an urge to smile, Tatsuya set his face\nagain. Sayaka’s voice in reply had been somewhat flustered, but he didn’t show\nany signs of thinking about it. Then, he said something that was really\nunnecessary. “After you tell the school what you think, what are you going to\ndo?”\n“…Huh?”",
  "page_48": "The student council that day was quite different from how it used to be, and\nnot even two weeks had passed.\nFirst, the dining server had absolutely no part to play anymore. With Mari and\nMiyuki making their own lunches, Mayumi began to do so as well. With no past\nrecords, her skill made everyone a little anxious, though Mari was the only one\nactually worried. But she had gotten through the easier stages at a passable\nlevel, and now she was having fun changing up the kind of food she brought.\nAnd there were more members now. Azusa usually ate with her classmates\nunless someone said something to her, but lately, people had been saying\nsomething every day. They invited her for a selfish reason, an absurd one—in\nany case, an illogical one: The ratio of freshmen to seniors in the room was\nunbalanced. Her personality wouldn’t let her turn them down, though she’d\nprobably accepted reluctantly.\nOn the other hand, the ratio of boys to girls was one to four. If balance was an\nissue, then this was a bigger one. They didn’t seem to treat it as a problem.\n“Tatsuya?”\n“Yes, Chairwoman?”\nIn the middle of a lunch with those same members, Mari addressed him from\nacross the table. (The positions at the table had Tatsuya seated next to Miyuki,\nwith Mari across from him and Mayumi across from his sister, and Azusa next to\nMayumi.) Mari had tried to nonchalantly strike up a conversation, but there was\nno hiding the heckling in her smile. And even that expression looked good on\nher. “…Is it true you were topping Mibu, the sophomore, yesterday in the\ncafeteria? Conversationally, I mean.”\nTatsuya was grateful he’d already finished eating. If something had been in his\nmouth, it would be everywhere right now. “…You’re an adolescent lady, too, so\nI don’t think you should use immodest terms like topping.”",
  "page_49": "“Ha-ha-ha, thanks. You’re about the only one who treats me like a lady,\nTatsuya.”\n“Is that so? Your boyfriend must not be much of a gentleman if he doesn’t\ntreat his own girlfriend as a lady.”\n“That’s not it! Shuu is—” Mari broke off and held her tongue, her expression\nimplying she wished she hadn’t said that.\n“…” Tatsuya stared at his superior—well, the student who held a higher\nposition in a high school committee, anyway—with an expression that was\nliterally empty.\n“…”\n“…”\n“…Why aren’t you saying anything?”\n“…Should I be making some sort of comment?”\nMari glimpsed bouncing, thick, wavy black hair out of the corner of her eye.\nExtremely reluctantly, she slid her gaze to the side.\nAnd as expected…Mayumi had her back turned, and her shoulders were\nshaking. Mari gave her a pointed glare, then quickly looked away, returning her\ngaze to Tatsuya. “…So is it true you were topping Mibu from the kendo club?”\nIt looked like she wanted to treat all of that as though it hadn’t happened.\nTatsuya looked next to Mari; Mayumi stopped her stifled laughter and shrugged\nin an exaggerated manner.\n—That was that, then. He decided to follow their house rules. “Like I said, I\ndon’t think you should use terms like topping… I don’t want you teaching such\nvulgar terms to my sister…”\n“…Excuse me, Tatsuya? You do know how old I am, right…?” argued Miyuki\nreluctantly but modestly, her voice low. Tatsuya shot her a look of apology and\nimmediately dropped it.\nOnce again, silence was the name of the battle. If this were a shogi match, the\ncurrent player would be changing up their strategy.",
  "page_50": "But these house rules…meant that, unfortunately, it was Tatsuya who needed\nto change things up. “…That is not true.”\n“Oh, really? We have some witnesses who saw Mibu getting embarrassed,\nand her face getting bright red.”\nTatsuya suddenly felt a chill drift over from the seat next to him.\n“Tatsuya…? May I ask just what it was you were doing?”\nIt wasn’t just his imagination; the temperature in the room was dropping\nphysically and locally.\n“M-magic…?” Azusa’s mumble was tinged with fear.\nModern magic was the natural progression of supernatural ability research.\nBasically, modern magic, in an underlying sense, had succeeded the so-called\ncharacteristics of “supernatural abilities.” The biggest difference between old\nmagic and supernatural abilities was whether or not some non-thought process\nwas required to activate it. This was the fundamental reason modern magic\ndidn’t absolutely need CADs, too.\nAt the same time, modern magic wasn’t equivalent to supernatural abilities.\nNormally, espers could only use a certain type, or at most a few types, of\nstrange powers. Modern magic had systematized and organized these so-called\nsupernatural abilities. By introducing magic programs and activation programs,\nthe tools for constructing magic programs, into the activation process, modern\nmagic made it possible for people to use magic of dozens of types—even\nhundreds in some cases.\nHowever, modern magic had a tendency to subdivide itself too thinly, and\ndiffering supernatural abilities that would be broadly measured under the same\nscale would end up in at least twenty or thirty different types. Despite that,\nmodern magic was overwhelming in its versatility.\nModern users of magic, or magicians, used a plethora of magic through the\nmedium of magic programs. The execution of magic used by these magicians,\nthen, was adjusted to suit their own mental processes.\nMagicians who were close to being espers and specialized in specific magic\ncould activate magic through thought alone, without clear intent. Ones who",
  "page_51": "used dozens of different types of magic, however, normally couldn’t use magic\naccidentally.\nIt is true that magic programs are processed by the unconscious part of the\nmind, but that was only because the caster was making a deliberate choice.\nThere was absolutely no chance they could formulate and execute magic\nprograms wholly unintentionally.\nIf one of those magicians skilled in many types of magic could also activate\ntheir abilities unconsciously, that would be…\n“That’s quite impressive phenomenological influence…” murmured Mayumi.\nTatsuya smiled drily. Even the now-abandoned supernatural abilities worked\nthe same way to affect reality: by manipulating eidos, bodies of information\nthat accompanied events. While magic running loose was proof of inexperience,\nit was also proof of superior talent.\n“Calm down, Miyuki. I can explain. First restrain your magic.”\n“I’m so sorry…” Miyuki lowered her eyes out of embarrassment and slowly\ncaught her breath. The room temperature stopped decreasing.\n“Guess you don’t need an air conditioner in the summer.”\n“Midsummer frostbite is nonsensical, though.” Mayumi’s joke seemed more\nto buy herself time to regain her own calm than to lighten the mood, but\nTatsuya brushed it off. “It seems Mibu’s inciting opposition among the students\nto the disciplinary committee’s activities,” he said, wrapping things up. Both\nMari’s and Mayumi’s faces clouded. “But is it actually true that you get people\nin trouble on purpose for points? I know I didn’t see anything like that—at least,\nnot this week.”\n“I didn’t, either. I could only look at where things happened over a monitor\nscreen, but judging from how out of control it was, the actions taken by\ndisciplinary officers actually seemed fairly tolerant.”\nAt the siblings’ suggestions, Mayumi’s melancholic expression deepened.\nMari shook her head and spoke. “Mibu is mistaken. Or maybe she’s just biased.\nThe disciplinary committee is a completely honorary post; there’s no merit to\nbeing on it. Competition results might boost someone’s seminar grades, but",
  "page_52": "there’s absolutely nothing like that here. You might gain some reputation just\nfrom being a member, but that doesn’t even leave school walls. It’s not like the\nstudent council, where being a member means you’re seen highly even after\ngraduating.”\n“…But it’s also true that it has a lot of power at school,” added Mayumi. “The\ndisciplinary committee team actively maintains order here. If you were a\nstudent unhappy with how things are around here, they might look like a group\nof hound dogs abusing their power to you. Or, more accurately, someone is\nsetting things up to make it seem like that.”\nTatsuya couldn’t help but be surprised. Things seemed to go a lot deeper than\nhe realized. He asked the next natural question. “Do you know who it is?”\n“Huh? Um, no, it’s not really that easy to find the source of rumors, so…”\n“…We could stop it if you found out who the culprit was, though.”\nFor Mayumi and Mari, though, the question had been unexpected. Mayumi’s\nremark had been a slip of the tongue. Tatsuya looked her dead in the eye—she\nimmediately looked away. This was the first time he’d seen her so clearly\ndisturbed. “I wasn’t asking the identity of the underling at the end of things,\nspreading these false half-truths. I was asking about who’s controlling things\nbehind the scenes.”",
  "page_54": "He felt his arm get tugged twice. He looked over to see Miyuki pulling at his\nsleeve, behind the table so others wouldn’t see. She probably wanted to tell\nhim he was overstepping his bounds, but Tatsuya didn’t feel like backing down.\nHis mind reproduced the image of the male student who’d attacked him with\nmagic, then run away. He mentally zoomed in on the white wristband, its edges\nlined in red and blue, on the student’s right wrist.\n“An organization like Blanche, for example?”\nTheir unrest changed to shock. Mayumi and Mari both stiffened. Azusa\nwatched them, her eyes wide; it didn’t look like she’d been informed of the\ndetails.\n“How do you know that name?”\n“It’s not like it’s top secret information. There are apparently some press\nrestrictions on it, but you can’t suppress every little rumor that springs up.”\nFor Tatsuya, the fact that Mayumi was this surprised was what surprised him\nmore.\nBlanche was an international anti-magic political organization. Their ideals\nwere to oppose the current political system in which magicians were given\nspecial treatment by the government, as well as to eliminate societal\ndiscrimination based on magical ability.\nBut there was no truth to magic users being given special treatment by the\ngovernment in this country in the first place. In fact, in reality, there was a lot of\ncriticism of the government and the army for their inhumane treatment of\nmagicians and of the way they used them as disposable tools. The country,\nthough, couldn’t avoid the necessity to make up the difference in the quantity\nof troops it could mobilize with quality, considering a certain neighboring\ncountry had the highest population in the world.\nMilitary officers and administrative officials who were also magicians certainly\nreceived higher pay than those who were not, but that was no more than a\nreflection of how much work they needed to do. It was no more than the price\nthe nation paid for wearing down their souls with overwork.\nMost anti-magic organizations conducted antiestablishment activities based",
  "page_55": "on criticism of a reality they’d made up themselves. Among them, Blanche\nengaged in some of the most radical militant activities. This country supposedly\nprotected freedom of political activity, so they were neither reined in nor\noppressed. However, antiestablishment movements could gradually and easily\nslip into criminal acts—and in reality, there were multiple precedents of anti-\nmagic groups conducting terrorist acts.\nCurrently, Blanche was representative of the kind of organization the public\nsecurity bureau watched very closely.\nAnd the color of the wristband worn by the student who had failed to dig out\nthe ground beneath his feet was white, with one red edge and one blue edge—\nthe symbol of a branch organization of Blanche called Égalité. The two\norganizations hid the fact that they were directly connected, but Égalité did\nactually operate under Blanche. The fact was, to those who knew, that they\nwere no more then an outward-facing billboard for Blanche to attract youths\nfed up with the political situation.\nThey didn’t know exactly how many people had become part of it. That\nstudent from before could possibly have been the first one. But the fact they\nhad gotten not just a simple sympathizer, but one of their agents into the\nstudents likely meant they had secured a foothold at First High, otherwise it\nwouldn’t have been possible.\n“Trying to hide parts of it will only lead to bad outcomes, though… Oh, I’m not\ncriticizing you, President, I’m just saying our government has managed this\npoorly.”\nDespite Tatsuya’s consolation in the form of an excuse, Mayumi’s expression\ndidn’t clear up. “…No, you’re right, Tatsuya. It’s true—there’s a group that sees\nmagicians as enemies. It would be better to spread correct information,\nincluding how unreasonable they are, than to hide their existence altogether\nalong with the inconvenient agitation that seems so natural. We could be taking\neffective steps…but we’re avoiding—no, running away from facing the\nproblem.”\nShe actually seemed like she was blaming herself. “You don’t have much of a\nchoice.” His dismissive tone, therefore, came off as fairly cold. “This school is a",
  "page_56": "national institution. We’re just students, not government employees—at least,\nnot yet. The student council is involved with operating the school; of course it\nwould be held tight to the policies of the nation.”\n“Huh?” With a flat voice, unable to connect those words together in her head,\nMayumi faltered for a moment, and Tatsuya looked at her.\n“I mean that as the president, you had no choice but to keep it a secret,” said\nTatsuya, looking away from her uncomfortably.\nMari gave him a playful grin. “Wow, Tatsuya. You’re pretty nice once in a\nwhile.”\n“But he’s the one who put the president in that situation in the first place…”\nAzusa muttered blankly.\nMari immediately picked up for her. “Pressing someone like that and then\nsupporting them, huh? The tactic of a gigolo. He managed to coax Mayumi, too.\nHe’s got skill!”\n“W-wait, Mari, stop being weird!”\n“Your face is red, Mayumi.”\n“Mari!”\nThe student council president and disciplinary committee chairwoman began\nto tease each other.\nTatsuya was looking in the wrong direction, his face feigning innocence—\npretending not to notice his sister’s cold stare upon him.\n“All right… It’s getting late, so we’re going back to class. Let’s go, Miyuki,” said\nTatsuya to Mayumi and Mari, still jostling each other, and rose from his seat.\nMiyuki had been displeased, but he had brought her around with all sincerity,\nplacating her. Azusa, who had watched it, had turned bright red and fled to the\nconsole in the corner of the room, but that was no concern of Tatsuya’s.\n“Oh, wait just one moment, Tatsuya,” said Mari. “Okay, stop it, Mayumi, stop\nit already. We need to be serious now.”\n“…We will carefully deliberate upon this matter after school today.”",
  "page_57": "“All right, all right… You’re more tenacious than you look… Tatsuya, what is\nyour answer going to be?”\n“I’m the one waiting for an answer, so I’ll decide once I hear it.”\nSayaka had been unable to answer the question he’d posed to her yesterday\nin the cafeteria.\n—After you tell the school what you think, what are you going to do?—\nShe just started making confused, unintelligible noises after that. She couldn’t\nput together a response. So Tatsuya had given her some homework: He told her\nthat when she figured it out, he’d listen to what she had to say again. “Based on\nwhat I just heard, this isn’t something we can just let be.”\n“—I’ll leave things to you.”\n“At this point, I can’t even imagine what you’re leaving for me to do.”\n“Whatever you can—I don’t mind.”\n“How vague. Are you expecting something from me or not…? Well, if that’s\nyour condition, then I’ll accept the task.”\nThis wasn’t something they could just let be—that wasn’t just lip service. If\nthe anti-magic organization was going to stop at just targeting the system itself,\nhe didn’t need to take the initiative. However, their antiestablishment activities\nwere violent, steadily making targets out of individuals in symbolic positions. He\ncouldn’t discard the possibility that Miyuki would be targeted, since she had\nenrolled as the leading student and was now part of the student council. He\nwas sure she would never lose out to some terrorists who could do nothing but\nskitter around in the shadows all day, but there was the worst-case scenario to\nthink about.\n“I’ll do whatever I can,” he said in acceptance, voice cool. He and Miyuki, who\ngave a small bow from behind him, went to the door and left the room.\nMari muttered to herself, “That’s probably how we’ll get the best outcome,\nafter all.”\nGiven how the disciplinary committee duty worked, Tatsuya didn’t need to",
  "page_58": "show up to the headquarters every day. Even the chairwoman normally hung\naround the student council room upstairs. The members elected to it were all\nthe cream of the crop, each violent and uncompromising. Such people tended\nto neglect clerical work and tidiness, so because no one stayed there for very\nlong, the room had been left to utter dilapidation.\nBefore Tatsuya’s achievements during the club recruitment week, he had—\nreluctantly—established a firm position as the one person in the disciplinary\ncommittee with any clerical skills. So, despite not actually being on duty, he’d\ngotten a call for help from Mari regarding the activity reports of the club\nrecruitment week, that oh-so-bloody battlefield. They hadn’t been organized in\nthe slightest…though it wasn’t so much help as Tatsuya just doing it all himself.\nIt had not been his intention to fall into this situation. His plan, at the time of\nhis enrollment, had been to use his after-school time to browse the private,\nuniversity-owned research documents and materials that you could only view\nwith specific terminals in the National Magic University and the magic high\nschools affiliated with it. And yet here he was, doing this and that, going here\nand there, getting none of his research done.\nI suppose I’ll finish up these incident reports… he figured to himself with a\nsigh, knowing how unproductive it was. First he needed to meet up with Miyuki,\nso he went to log out of a terminal, having completed a different task—and just\nthen, something happened.\nA notification appeared on the display that he’d received an e-mail. The\ntiming was too perfect. The school’s crest was attached to it. That meant it\ncontained instructions that a student wouldn’t be able to refuse, or an official\nnotification e-mail. He couldn’t just ignore something like that. He hadn’t\ngotten far up out of his seat, but he sat back down and opened it up.\nDisplayed in the “sender” field was the name Haruka Ono.\n“Sorry for calling you out so suddenly!”\n“It’s all right, ma’am. I didn’t have anything urgent to do.”\nThey were in the counseling room. Haruka had given the standard apology,",
  "page_59": "her smile not showing any regret at all; Tatsuya had given the proper response\nto it, not really meaning it.\nIn truth, he found this summoning to be a pain. He wasn’t in a hurry, but he\nhad promised to help Mari. Sending an e-mail to notify her wouldn’t have been\nenough, so after apologizing to her profusely over voice communication, he\nended up getting even more work to do than he’d planned.\nHe’d had to cancel walking Miyuki home, too. She seemed unaffected on the\nsurface, but he’d already gotten a headache thinking of how he’d try to improve\nher mood when they got back to their house. Besides, he had nothing he\nwanted to talk to a counselor about anyway.\n“So have you gotten used to the high school life?” asked Haruka, popping a\nstandard question, whether or not she knew of his actual feelings on the matter\n(he was pretty sure she didn’t).\nTatsuya’s answer, though, was far from standard. “No, ma’am.”\n“…Is there something worrying you?”\n“I have a lot more to do than I thought I would, and it’s hard to focus on my\nstudies, ma’am.” On the supplementary sound channel he was telling her that\nshe was wasting time, and to quit the small talk and get to what she needed to\nsay.\nEven if she didn’t hear any of that nuance, she seemed to still understand that\nhe wasn’t in a very amicable mood. She gave a vague smile, somewhere\nbetween a dry grin and a friendly one, then made a display of recrossing her\nlegs.\nHe got a glimpse of her sensual thighs covered in thin stockings from under\nher short, tight skirt. There was nothing to obstruct their gaze between the\nchairs they sat facing each other in.\nModern etiquette discouraged the exposure of skin in public places. Female\nstudents were no exception—they all wore thick, opaque tights or leggings\nunder their skirts. That was the school’s policy. Even leaving aside how mature\nthe girl was, this was a stimulating sight he didn’t see very often at all.\n(Incidentally, even those styles that didn’t show any skin at all could be worn",
  "page_60": "comfortably during the summertime, thanks to advancements in fiber\nmaterials.) “…What’s wrong?” asked Haruka playfully to Tatsuya, who was\nunconsciously staring and unable to peel his eyes away.\nHe quickly averted his stare and would have given a disordered response\n—“Going by the present dress code…”—but Tatsuya’s answer was a tad\ndifferent from the norm. “…I believe your outfit is too stimulating, Ms. Ono.”\n“I-I’m sorry!”\nThere was no arousal in his eyes—in fact, they seemed cold and observing,\nand his tone gave the impression of a light criticism. Haruka, flustered, got her\nlegs into a more modest position and sank back into her seat.\nInducing unrest in someone was the universal technique for taking the\ninitiative. Haruka had chosen this kind of clothing to that end. But this freshman\n(Tatsuya) would only reply with an expressionless gaze.\nShe couldn’t figure him out. She was unable to gain the initiative, and it\nconfused her.\n“In any case, why have you called me here?” Despite trying to clamp down on\nit, his voice betrayed a tiny bit of irritation. And it was doubtful even that wasn’t\npart of his own act.\nHe might have been going on just sixteen years old, but she wasn’t trying to\nmake light of him. She knew normal means wouldn’t work against him, and\nthat’s exactly why she’d attempted to use sex appeal, a method she wasn’t\nused to. Unfortunately for her, it looked like she had to give up on that safe,\nroundabout plan.\nHaving made up her mind, she once again faced Tatsuya. “I came here to\nrequest your assistance, Shiba, with our work.”\n“Our work, ma’am?”\nShe knew of his intelligence, even if only from the entrance exam.\nNevertheless, his reply went straight for the vitals, putting her more and more\non guard. “Yes—the counselors’.” She had the brief sense that he was seeing\nright through her. Right now, though, her only option was to keep pushing with\nher “counselor work” charade. “The tendencies of students tend to change by",
  "page_61": "the year. For example—you use ma’am and sir quite frequently, don’t you? It\nwasn’t too unusual to hear while such a percentage of students in magic high\nschools desired military posts, but common use of those terms first spread\namong the other students after our victory three years ago at the Defense of\nOkinawa. Changes in the social climate bring about changes in student\nmentality as well. Especially after a big incident’s happened—the ways they\nthink and feel about things and themselves change to the point where you\ncouldn’t believe they were all the same age.”\nShe paused for a moment, gauging the boy’s expression. He didn’t seem\ndisturbed in the slightest. In fact, he seemed like he was listening to things he\nwas already aware of. “So every year, we pick around ten percent of the new\nstudents and have them undergo continued counseling. It’s so that we can get a\ngood grasp of the student mentality each year and conduct the best counseling\nwe can.”\n“I would be a guinea pig, in other words, ma’am?” His words easily summed it\nup. She didn’t sense any of the negative emotions that he should have shown,\nlike anger, indignity, or distaste. “If that’s all it’s for, then I’ll assist you, ma’am\n—but what is your real objective?” he replied with a faint smile.\nAt that moment, Haruka needed to use all her might to suppress her\nbewilderment. “…Do you think I’m concealing my real objective? That’s\nupsetting. I’m not a harpy, you know.” Her tone was light and jocular to the last\n—and was more to keep him from realizing she’d lost her calm than to placate\nhim.\n“I believe I’m a bit too unique to use as a sample, ma’am.”\n“I see. I’m of the same impression—that you’re not quite a normal freshman.\nThat’s why I want you to help us, though. You might be the first instance of\nsomeone breaching the walls between Course 1 and Course 2 students, but that\ndoesn’t mean you’ll be the last.”\n“…I’ll accept that, then, ma’am.”\nHaruka was relieved—it seemed like she’d talked him down for the moment.\nHe didn’t seem completely convinced, but unraveling stubborn minds like his\nwas where counselors displayed their skill, she told herself. —Ignoring reality",
  "page_62": "somewhat, that is.\n“I regret making you feel like you can’t trust me because of my inexperience,\nShiba… In any case, may I ask you a few questions?”\n“Yes, go ahead, ma’am.”\nShe knew he was being cautious of her, but they didn’t have all the time in\nthe world here. In order, she presented the questions she’d prepared\nbeforehand to Tatsuya.\nCounseling was a profession to which privacy was crucial. Protecting the\nconfidentiality of clients was the cornerstone of their professional ethical code.\nThat meant when faced with someone confiding in them, they would ask the\nperson questions in order to solve their issue and never leak any of that to a\nthird party—but in this situation, where Haruka was the one to ask him for help,\nshe wouldn’t be able to set foot into his private life. Consequently, the topic of\nher questions was limited to what had happened at school since his first day.\nAnd after Haruka had finished listening to Tatsuya himself briefly talk about\nthe troubles he’d had since starting school, this was her reaction: “…Thanks. I’m\nsurprised you’re still okay. With that kind of stress accumulating, it wouldn’t be\nodd for a person to have a mental breakdown,” she said in some admiration,\nher expression doctorial.\nShe actually had a medical license, and she specialized in mental health—\nthat’s why Tatsuya would call her a “doctor,” but he thought she was listening\nto what he had to say as a counselor.\n“From a medical standpoint, you might be right, ma’am. Exceptions spring up\nin any aggregate data set, though.”\nAt Tatsuya’s remark that clinical data was always a by-product of statistical\nprocessing, Haruka looked away in embarrassment.\nHer eyes wandered for a few moments, but she then noticed Tatsuya glancing\nat the old-fashioned (read: behind-the-times) wall clock—he was doing it so that\nshe would notice, of course—and quickly looked back at him. “Right, that was\nall I wanted to ask for today… By the way, may I ask you one thing that isn’t\ndirectly related to counseling?”",
  "page_63": "“What is it, ma’am?”\n“Is it true that Mibu, the sophomore, asked you out?”\n“…That really doesn’t have anything to do with counseling,” said Tatsuya, not\nbothering to hide his amazement.\nHaruka hurriedly continued. “If it was Mibu, I would have an interest… I can’t\ntalk about the specifics, though.”\n“It would be a problem if I heard about things private to others. Just where on\nearth did you hear such a groundless accusation?”\n“Groundless…?”\n“Yes, ma’am—is there something wrong?”\n“No, it’s nothing… Well, truthfully speaking, if you had been of the mind to\nstart dating her, there was something I wanted to ask of you. But if that isn’t\nhow you feel, then don’t worry about it.”\n“I already said all the nonsense about her asking me out was groundless,\nma’am. Anyway, where did you hear about that?”\nShe purposely averted her eyes from his at his repeated question. “I’m sorry\n—it’s a confidential matter.”\nHe didn’t pursue the point any further. “Then I will get going now, ma’am.”\nInstead, he got up and headed for the exit, not waiting for a reply.\n“If there’s anything bothering you about Mibu, you can talk to me anytime.”\nThere was something like conviction in Haruka’s voice as she spoke to his back\n—a conviction that something that would bother him would happen. Tatsuya\nhad no interest in what that might be, but he also didn’t stop and turn around.\nHe didn’t have the sort of innocent charm to let a pointless curiosity lead him\ninto a trap.\nAfter dinner, as Tatsuya was in his bedroom at his console, a voice came to\nhim from the other side of the door.\n“Tatsuya, it’s Miyuki.”",
  "page_64": "Practically speaking, Tatsuya and Miyuki were the only ones who lived in this\nhouse. It was plain as day who would have been knocking at his door without\nher needing to name herself, and he didn’t need a name if he heard her voice,\neither.\nStill, though, at every turn, Miyuki always announced herself like this. As\nthough trying to imprint her name into Tatsuya’s mind. As though she were\nafraid he might forget it.\n“You can come in,” prompted Tatsuya without looking away from the display.\nFrom the door, the console was embedded in the side wall. As he read through\nlines of text, scrolling at high speed, he glimpsed the figure of his sister in his\nperipheral vision.\n“The cake you bought for us has arrived… Shall we have some tea?” There\nwas hesitation in her invitation—probably out of a sense that she didn’t deserve\nher brother’s needless consideration in this particular case.\nFor Tatsuya, if a cake was all it took, it was a small price to pay—but her\nmodesty was another one of his sister’s charms. —Not that just anyone could\nbring it out of her, though.\nThe cake has arrived was a phrase that would have been quite limited in\nusage a hundred years ago, but the expression was used on a daily basis in\ntoday’s world. Advances in physical distribution systems had turned the term\nbaggage into a dead word. You could get even small things like cakes delivered\nfor free. Of course, for the stores, creating and shipping the product upon\nreceiving the order had two merits: not needing to keep extra goods in storage,\nand the turnover rate of customers. The service was weighed upon a scale of\nminimized shipping costs.\n“I’ll be right there,” he answered, saving the displayed information into their\nhome network’s shared directory.\nTatsuya’s washed down the not-too-sweet cream left in his mouth from the\nchocolate cake—Miyuki’s favorite—with coffee he’d had her make more bitter\nthan usual, then switched the living room’s display to data-viewing mode.\n“…Is it all right if I see this as well?”",
  "page_65": "Tatsuya hadn’t finished eating either or anything, and Miyuki was going at an\neven slower pace. Nevertheless, his calling up a data file clearly meant that he\nwanted to show something to her. “Of course,” he said. Despite that, she had\nstill asked for confirmation first, and upon his affirmative reply, she settled back\ninto her seat. “It may not be a topic suited to family entertainment, but it seems\nlike you’re not going to avoid getting tangled up in this, so I figured we should\nshare information sooner rather than later… No, it’s nothing to sit at attention\nfor.” His sister had put down her fork and sat up straight, and he waved away\nthe action as unnecessary. He gave her a dry grin, which she answered with a\nslightly embarrassed one, and picked up her fork again.\n“Open cabinet name Blanche.”\nHe couldn’t bring a full keyboard out onto the living room table with all the\nfood laid out. Tatsuya didn’t like it very much, but he used voice commands to\nbring up the files containing his findings one by one on the display.\n“That’s the anti-magic activist political society that came up during lunch,\nright?”\n“They call themselves a civic movement, though. Behind the scenes they’re a\nprime example of a terrorist group. And there doesn’t seem to be any doubt\nthese terrorists are moving around in the shadows at school. There is a group\ncalled Égalité—a branch organization of Blanche—and during my activities as\ndisciplinary committee officer, I actually saw a student who I believed to be part\nof it.”\nTatsuya’s words caused Miyuki surprise, and she cocked her head to the side.\n“At Magic High School—a student of Magic High School?”\n“I can understand why you’d find it hard to believe,” nodded Tatsuya deeply,\nindicating that he empathized with her bewilderment. “People who believe that\nmagic high schools, not just First High, will help them with their magic are all\ncoming to study magic. Whether it’s for their own sake or for another’s is a\nseparate issue. A student of a magic high school rejecting magic is no more than\na self-contradiction.”\nIt was a perfect and complete contradiction, and that was all. For Tatsuya,\nmagic in the eyes of society labeled him negatively in some respects, but as",
  "page_66": "someone who studied and researched magic, he didn’t feel like he wanted to\nreject it.\n“It’s obviously strange when you think about it… But the obvious doesn’t\nwork, so the strange people run rampant.”\n“…Why is it like that, I wonder?”\n“If you try to think about it using normal logic, you’ll get trapped in a maze. So\ninstead of thinking about it logically, you have to think about it on a concrete,\nindividual level. The first point that needs to be addressed is that despite them\nwaving their flags of anti-magic beliefs in the air, they don’t outwardly reject\nmagic.”\n“Come to think of it…that’s true.”\n“Their aim is abolition of the societal discrimination due to magic. That in\nitself is undeniably correct.”\n“…Right.”\n“What is discrimination, then?”\n“When society’s opinion of someone doesn’t reflect their actual skills and\nhard work…?”\n“Like I said, Miyuki, you shouldn’t think about it from a general viewpoint.” As\nhe spoke, he smoothly picked up the remote control on the sideboard, then\npointed it at the screen. One of the areas of the sixteen-way split screen came\nto the front and magnified. “Blanche, in terms of its outward political society\nguise, cites the difference in average salary earned by magicians and non-\nmagician company workers as proof that magicians are being given special\ntreatment. The discrimination they’re talking about, in the end, is a difference\nin average pay. But they’re only talking about averages, about results. They\ndon’t think at all about how exhausting and taxing the work done by highly paid\nmagicians is. They also completely ignore the vast number of ‘spare’ magicians\nwho, despite having magical skill, can’t get employed in occupations related to\nmagic, and actually make less money on average.”\nThe emotion in his flat voice was sparse, but there was just a hint of\ndownheartedness in it. “No matter how strong it may be, magic that society",
  "page_67": "doesn’t value won’t bring either money or honor.”\nMiyuki cast her gaze downward, bitterly. He got up, walked around her, and\ngently put a hand on her shoulder. “The reason the average magician’s salary is\nhigh is because there are ones who do possess rare skills that society needs.\nAmong those scant few magicians, there are a relatively high percentage of top\nearners, which means the average salary is calculated as being high, that’s all.\nAnd those magicians working at the forefront contribute to society—actually,\nthat’s too pretty a way of putting it. Magicians receive high rewards for creating\nsome sort of profit, whether it’s financial or not; but they aren’t given special\ntreatment in a financial sense just because they’re magicians. Their world is not\nan easy one—they can’t live in luxury just by having the innate talent for magic.\nWe know that all too well. Don’t we, Miyuki?”\n“Yes… I know it well,” said Miyuki, nodding deeply and placing her own hand\natop her brother’s on her shoulder.\n“What this essentially means is that Blanche’s stance of opposition to magic-\nbased discrimination really means they’re opposed to magicians being paid in a\nfinancial sense. They want magicians to donate their services to society\nunselfishly.”\n“…I believe that a rather selfish, arrogant thing for them to say. Magicians and\nnon-magicians are alike in that they need money to live. And yet they say they\ncan’t allow magicians to make a living with magic, and that those who can use it\nhave to make a living on something else… Doesn’t that just mean they’re saying\nthey don’t want to respect magic as a human skill because they can’t use it\nthemselves? They’re saying magicians don’t need to be repaid for the effort\nthey put into studying magic, and that their hard work shouldn’t logically need\nto be respected… Or are those kinds of people not aware that you can’t use\nmagic with natural, inborn talent alone? Has nobody told them that using magic\nrequires long years of learning and training?”\nTatsuya pulled away from Miyuki’s back, gave a cynical smile, and returned to\nhis seat. “No, they know. They just don’t mention it. It would be too\ninconvenient to say it, to think it. The ideal of equality is easy on the ears, so\nthey trick others with it—and themselves. Remember what you asked at the\nbeginning? About why students in a magic high school would be active in anti-",
  "page_68": "magic groups like Blanche and Égalité?”\n“Yes… You mean they don’t understand what the magic-rejecting faction\nreally wants…?”\n“People who can’t learn to use magic, no matter how hard they try, think it’s\nunfair that those who can use it to gain high positions. Then, even if you can use\nmagic, the students with less talent for it think that it’s strange they can’t catch\nup to those with abundant talent even though they put in a lot of work, and\nthat it’s strange they should be seen as inferior… It wouldn’t be mysterious to\nthink this way, would it? Differences in talent aren’t limited to magic—it\nhappens in every single field in every kind of human work. Even if you don’t\nhave magical talent, you might have other talent. If you can’t stand not having\nmagical talent, then you should find a different way of life.”\nFor those who didn’t know any more about Tatsuya than what he showed, it\nwould have sounded like he was saying that for his own benefit. But Miyuki, the\nonly person here listening to him, wasn’t prone to such a misunderstanding.\n“The only reason for those studying magic to reject magical ‘discrimination,’ I\nthink, is because they can’t get away from magic. They don’t want to leave it,\nbut they can’t stand not being seen as a full-fledged magician. They can’t stand\nthe fact that the same amount of effort on their part won’t make them catch\nup. They can’t stand the possibility that even working many times as hard won’t\nmake them catch up either. So they reject being judged based on magic. Of\ncourse, they’re aware that those with the talent are paying the full price in hard\nwork. They see it personally, every day. But they look away from the truth,\nshove all the responsibility onto ‘inborn magical talent,’ and reject it. Well… It\nisn’t as though I can’t understand such weakness. I have similar feelings as\nwell.”\n“That’s not true!” Miyuki knew as well as he did that he wasn’t seriously\ndeprecating himself. But she still couldn’t help but protest. “You have a kind of\ntalent nobody else can emulate, Tatsuya! Just because you don’t have the same\ntalents as everyone else… You’ve done many-times-harder work to come this\nfar, haven’t you?!”\nTatsuya didn’t have normal talent, that was all—he had a magical talent far",
  "page_69": "exceeding others. Miyuki was proud of being the one who best understood that.\nIf anyone was trying to deny that, even if it was the person himself, her older\nbrother, she couldn’t let that slide.\n“That’s because I had a different talent.”\n“Ah…” Tatsuya, however, had still said he could “understand such weakness”\neven in understanding of what Miyuki was trying to say. She realized her\nrefutation had been shortsighted, and her cheeks flushed crimson with\nembarrassment.\n“I covered for my lack of talent in modern magic with another talent. I can\ncomment from an objective viewpoint like this because I had that option. If I\nhadn’t…I might have been clinging to the beautiful ideal of equality myself. Even\nif I knew it was a lie.”\n“…”\nShe didn’t argue with her brother’s matter-of-fact tone this time. Miyuki\nalready knew what he was trying to say. Tatsuya was neither lamenting himself\nnor pitying others; he was talking about the “human weakness” that existed in\nhim, too.\n“Those with inferior magic talent don’t want to think about the fact that it’s\ninferior, and so they preach the ideal of equality. Those who can’t use it at all\ndon’t want to think about the fact that it’s just another type of talent people\ncan have, and so they veil their jealousy with ideals. So then, what about those\nwho understand all of that, and are still fanning the flames? The equality they\ntalk about is to treat everyone the same whether or not they can use magic.\nThe abolition of societal discrimination based on magic is the same as not\nvaluing magical skills. And when it comes down to it, that’s a denial of the\nsignificance of magic in society. Magic cannot advance in a society that does not\nvalue it. Hidden behind those who shout their opposition to magic\ndiscrimination and those who scream for equality between magicians and non-\nmagicians is a faction that wishes to make this country abandon magic.”\n“What is this faction…?”\n“For better or worse, magic is power. Money is power, too, and technology,\nand the military. Magic has the potential to be the same kind of power as",
  "page_70": "battleships and fighter jets. Military uses for magic are being researched all over\nthe world, in fact, and plenty of military spies are hard at work snooping around\nthrough magic technology.”\n“Then the magic-denying faction’s objective is for this country to abandon\nmagic, and thus cause the nation to lose its power?”\n“Probably. And because of that, they’ll spare no efforts—even inhuman\nterrorism. With that said, who is it that would benefit from this nation losing\npower?”\n“Wait… Then they’d be supported by…”\n“That’s right. And the Ten Master Clans would never leave them unchecked.\nEspecially not the Yotsuba family. So we need to take extra care while we still\nhave the chance.”\nHe didn’t say what they should be cautious of. There was no need to say it\nbetween the two of them.\nMiyuki nodded to her brother, her face slightly pale.",
  "page_71": "With the club recruitment (war?) week ending, enrollment-related events\ncame to a close.\nEven Tatsuya’s class got up to full tilt with its magic studies.\nSerious, focused education in magic began in the high school curriculum, but\ngiven the fact that the entrance exams included a practical portion, the\nstudents had already acquired some fundamental magical skills by the time they\nenrolled.\nClasses were conducted based on this, too—so even though one would\nsystematically relearn everything from the start, there were cases of students\nwho were poor at practical abilities becoming unable to keep up not long after\nschool started.\nFrom a certain point of view, the Course 1/Course 2 divide was logical for\ntaking this gap into consideration so that neither would negatively affect the\nother—even if that was leaving one side behind.\n“Nine hundred and forty milliseconds. Tatsuya, you did it!”\n“Sheesh… Third time’s the charm, I guess.”\nMizuki’s eyes glittered in vicarious pleasure, and Tatsuya responded with a\ntired grin.\nTheir class was in the middle of magical practice.\nIt involved pairing up, then compiling and executing a single type of magic\nprogram under a time limit.\nOne would read in an activation program, then use it as a base and let their\nmagic calculation region, an unconscious region of the magician’s brain,\nconstruct and execute a magic program.",
  "page_72": "That was the modern system of magic.\nUnder this scheme, the process of converting the activation program—data\nthat could be stored on a device—into a magic program that could not, used\nthe word compile, which was taken from information technology parlance.\nIn modern magic, the scheme of digitizing the necessary work to execute\nmagic and converting that data into an activation program, then using that as a\nbase to construct a magic program, meant that it was accurate, safe, and\nversatile.\nIn exchange for that, it sacrificed the speed possessed by supernatural\nabilities, wherein a person could alter events just by willing it. As it placed the\nextra step of constructing a magic program in the middle, there was nothing\nthat could be done about it. However, while the construction time for magic\nprograms couldn’t be reduced to zero, you could come infinitely close to it.\nThe reason modern magic placed an emphasis on the speed at which one\nconstructed magic programs went something like this: CADs were originally only\na storage device meant to record the original activation program data, but\nmagic execution speed quickly became the main point. The CAD they were\nusing in class today didn’t need to be adjusted based on each individual—and\nbecause of that, there were absolutely no functions that supported speeding it\nup. The goal of today’s practice was to practice compilation speed by using this\nCAD, which was, in a certain sense, the way the devices were originally.\nIf one member of the pair couldn’t clear it, the other would automatically be\nkept for overtime. Mizuki had completed it on her first try, so for Tatsuya, this\nwas the time to breathe a sigh of relief.\n“But I was a little surprised. You really are bad at using magic practically,\naren’t you?”\nFor single-type, single-process spells like the one they were using, the aim for\nmagicians was to get the time between starting to read in a completely\nexpanded activation program and executing the magic down to less than five\nhundred milliseconds.\nTatsuya, who needed three attempts to get under just one thousand\nmilliseconds, couldn’t be called positive even in flattery. “Surprising? I feel like I",
  "page_73": "make that assertion a lot.”\n“I do hear you say it quite often…but I assumed you were just being modest. I\nmean, you can do anything, Tatsuya. I didn’t think you’d be bad at actually using\nmagic.”\nMizuki tilted her head to the side, utterly confused, and Tatsuya couldn’t keep\na dry grin from his face—he didn’t have the option to choose any other\nexpression. “…It might sound like I’m bragging, but if my practical skills were\naverage, I wouldn’t have been in this class at all.”\nHe took particular care not to let his tone sound sarcastic at all. Perhaps it\nworked—or maybe she was just being considerate—since she nodded\nstraightforwardly. “I see. If you were good at practical skills, too…you’d be a\nlittle perfect! We might not have wanted to come near you,” said Mizuki, giving\na carefree smile.\nHe was smiling along with her, but it got to him a little.\n“But Tatsuya… Don’t you get frustrated?”\n“…With what?” He couldn’t figure out what her repeated expression of\nconfusion meant, so he started to want to answer her question.\n“You’re actually very skilled, but you’re seen as having no talent. I think\nnormal people would be frustrated. I personally can’t help feeling frustrated. If I\nhad the kind of skill you do, I don’t think I’d be able to endure being looked\ndown on as a Weed…but you don’t seem to care about it much, so…”\nIt was an extremely difficult-to-answer question.\nGiven Mizuki’s personality, he didn’t think she’d go and spread mean rumors\nor tell others, but if he were to try and give a convincing response, he’d need to\nget somewhat into his own personal circumstances. “Processing speed is a form\nof skill—and an important factor, at that. There are plenty of times where a\ntenth of a second can mean the difference between life and death. They’re not\nwrong in thinking I don’t have talent.”\nTatsuya decided to choose the answer he could say in public.\nIf Mizuki had been just any Course 2 student, she probably would have been",
  "page_74": "satisfied with that.\nBut she—“But in the real world, Tatsuya, you can activate magic a lot faster,\ncan’t you?”—was possessed of special “eyes.”\n“…Why do you think that?” He knew giving such a response itself meant that\nhe was admitting to what she’d said, and that he had been defeated, but amid\nhis confusion he could produce no better reply.\n“During that practice, you looked like you were having a really hard time on\nall three attempts. My mom is a translator, so it might sound strange, but it’s\nlike you’re a person who can think about an English question in English and\nanswer in English, but it wants to force you to answer in Japanese first and then\ntranslate it to English. And during the first attempt, you had almost put\ntogether a magic program, but then you got rid of it and redid the compile,\ndidn’t you? From a timing point of view, you were reading in the activation\nprogram and constructing the magic program in parallel. And that’s when it hit\nme—that maybe you didn’t need to use an activation program for this level of\nmagic. Maybe you could just construct a magic program directly.”\nUsing magic with the same speed as this, but without using an activation\nprogram—in other words, not using a CAD. He was under strict command to\nkeep this skill a secret.\nAnd she’d seen through it with just one attempt.\nThe very core of his mind froze over.\nHis caution reached its peak, his confusion went past its limit, and then\nsubsided as he regained his calm.\nTatsuya was not at all used to being shaken like that; it was a very rare\nexperience for him.\n“I didn’t think you had seen that far. You really do have a good pair of eyes.”\nThis time, Mizuki’s face was the one that paled, reaffirming Tatsuya’s belief\nthat she’d been trying to keep her own “eyes” a secret.\nMaybe that was a little mean, he thought, the corners of his mouth turning\nup just slightly. But judging from her reaction, there was now far less risk of her",
  "page_75": "seeing through to the true essence of this secret skill he had.\nHe then decided to give her one more push. She already knew that he was\nable to call forth magic programs without using an activation program. So by\nleading her to think it was purely a skill achieved through personal effort, he\ncould lead her interest away from it. If he satisfied her curiosity just the right\namount, then, considering her personality, she wouldn’t dig any deeper.\n“You’re right—if it’s a single type of spell, I can execute a little faster by creating\na magic program directly. But I can only use it for magic that doesn’t involve a\nwhole lot. Five processes is as high as I can go.”\nThe term process in the context of modern magic referred to two things: One\nwas the actual process of executing magic, and the other was each individual\nstep of activating multiple spells that you would put together to achieve some\ndesired alteration in events. When Tatsuya referred to five processes, he meant\na technique that brought forth a single event alteration by using five different\n“pieces” of magic put together.\nFor example, if you were going to use magic to move an egg from the kitchen\nto the table, you would need four processes: acceleration, movement,\ndeceleration (negative acceleration), and stopping (ceasing movement).\nMovement magic overwrote the speed of an object and its linear coordinates;\nif you didn’t also apply a specific acceleration process, the movement would\nignore the target’s inertia and accelerate it. In the case of an egg, it would crack.\nIf you eliminated the movement process and tried to only use acceleration\nand deceleration, the egg would end up moving along a projectile path, and\nyou’d need extremely precise deceleration control. It was easier, even at the\ncost of additional processing, to apply deceleration at the same rate as\nacceleration, then bring its speed to zero with a movement spell.\nIn contrast, man-to-man combat magic that launched your opponent was\ncompleted with just movement magic—one process. The objective was to\ndamage the opponent in the first place, so there was no need for an extra\nprocess to soften the impact.\n“I’d think five would be more than enough to use in combat…”\nIn general, consumer-use magic required more layers of processing than did",
  "page_76": "combat-use magic. As Mizuki said, one-to five-process magic would probably\ncover the majority of combat spells.\n“It’s not like I’m not studying magic for combat, though. I still need activation\nprograms to get the most out of spells with more than one step, and I’m slower\nthan others at doing that, so I’m naturally seen as inferior—which is fine,” he\nsaid, giving another thin smile. For some reason, though, Mizuki looked up at\nhim with a film over her eyes. For a moment, Tatsuya got a terrible feeling—had\nhe made a fatal mistake somewhere? But that calculation error itself was\nquickly shown to have been a mistaken result.\n“That’s amazing, Tatsuya… I really respect that!” she said, fascinated, folding\nher hands in front of her. For Tatsuya, anyway, she had just said something he\ncouldn’t ignore.\n“Huh?”\n“Normally people want to be magicians because they can use magic…but you\nactually have a real goal in mind for studying it…”\n“Um, well, that’s true, but…”\n“I must mend my ways!”\n“Err…”\n“I was really only studying magic to learn how to control my eyes, and I’ve\nnever really given much thought to what I want to use magic for in the future,\nbut from now on, I’ll be certain to think about it!”",
  "page_78": "What? She…she wasn’t trying to keep the stuff about her eyes a secret?\nthought Tatsuya at last, but he couldn’t get a word in edgewise because her\nenergy was overwhelming him. “Hello? Miss Mizuki?”\n“I see, I get it. If you have a clear objective, then of course you wouldn’t fall\napart just because someone spoke badly about you. If you can achieve goals\nthat are important to your life, then your grades in school are really just\nsecondary! That’s what makes it worth living. Everyone lives their lives\nsearching for meaning—”\n“Hey, Mizuki, what are you all excited for?”\nMizuki’s solo recital—during the middle of class—continued until Erika cut in.\nAt last, Mizuki noticed the strange stares of her classmates—or the blank\nstares, really—and blushed and looked down.\nAs he watched her do so, he kept his expression discreet so as not to let his\ncynicism show on his face.\nMeaning of life? That was far more than what it was. He never had the option\nof living a life without magic. He wasn’t going to become a magician because he\ncould use magic. He had been made into a magician despite being unable to use\nmagic.\nMagic had been a curse for him ever since the moment he was born. All he\nwas doing was struggling to change it into something he could tolerate.\nBut… If it was normal to become a magician if you could use magic, then it\nwouldn’t be odd in the slightest for magicians in the making to reject magic.\nAnd then he thought…that maybe, just maybe, he’d made a slight error in his\nthinking.\nAnd then, at lunch break, Tatsuya ended up staying behind anyway…because\nErika and Leo begged him to.\n“A thousand and sixty milliseconds… Keep it up. Just a little more.”\n“I-it’s so far away… I had no idea point-one seconds could be so far away…”",
  "page_79": "“You don’t say time is far away, stupid. It’s long.”\n“Erika… You got a thousand and fifty-two milliseconds.”\n“Ahhhhh! Stop it! I was making fun of him to take a break!”\n“I-I’m sorry…”\n“No, it’s okay, Mizuki. Gotta face reality, no matter how harsh it is to you…”\n“…I don’t give a damn about this stupid play thing you’re doing! Stop treating\npeople like toys!”\nErika and Leo had been cooperating to fail at the exercise ever since class was\nin session, so they’d asked Tatsuya to coach them.\n“Leo, you’re taking too long to take aim. You’re not trying to be a perfect\nmarksman, here.”\n“Yeah, I know, but…” Leo, who no longer had the energy to hide his\ncomplaints, nodded in agreement.\n“Well, I suppose you do… Well, guess I’ll share a trick with you—what if you\naim it first, then read in the activation program?”\n“Wait, you can do that?”\n“Yeah, but it’s a trick. It’s not practical, and it would only work here, so I don’t\nreally want to teach you how…”\n“What? Please, Tatsuya! I don’t care if it’s a trick or a cheat or whatever, just\ntell me!”\nLeo put his hands together over his head and begged. Tatsuya sighed. “Don’t\nput words in my mouth. It’s not against the rules or anything… Geez, and I’ve\nbeen saying how bad I am at application this whole time, too. If you want to\nlearn, you should ask someone with actual skill.”\n“You say you’re bad at it, but you’re better than me! And you even know how\ncompilation works on the inside. You’re the only one pointing out what I’m\ndoing wrong, too.”\n“I said I’ll teach you—no need to flatter me… And as for Erika…”\n“What could it be? I don’t care if it’s a cheat or against the rules or whatever,",
  "page_80": "please tell me! My stomach is growling!”\n“I said, stop putting words in my mouth! Uhh, right, as for you… I don’t know\nwhat the issue is.”\n“Whaaaat?”\n“Frankly, I don’t understand why you can’t do this. You’re compiling far\nsmoother than I was.”\n“No way! Don’t abandon me, Tatsuya!”\nTeary-eyed—probably as an act—she put her fingers together and looked up\nat him, clinging to him with her gaze. He sighed again.\nThe two of them act the exact same way, he thought. But he said something\nelse. “Well, how about this? Erika, when you’re reading in the activation\nprogram, try putting your hands on top of each other on the panel.”\n“Huh?” At that, Erika—and Mizuki as well—gave him blank stares. “…That’s\nit?”\n“I’m not confident or anything, so if it works out, I’ll explain why.”\n“O-okay… I’ll give it a shot.”\nAfter Tatsuya saw her put her doubts to the side for the moment and face the\nstationary CAD, he started to lecture Leo on the “trick.”\nExcess psionic light glimmered, and numbers other than the time were\ndisplayed on the top part of the small, round target. It was a scale attached to\nthe target, showing the maximum pressure applied by the single weighting-type\nspell. It was set up so that it would record the time it took to actually activate\nwhen the scale detected a certain amount of force.\n“One thousand ten milliseconds. Erika, you went down forty milliseconds all\nat once! Just one more push and you’ll have it!”\n“O-okay, I got this! I feel like I can do this now!”\n“One thousand sixteen. Don’t hesitate, Leo. You know where the target is.\nYou don’t need to bother looking at it.”\n“G-got it. Next time for sure!”",
  "page_81": "As Tatsuya and Mizuki reset the measure, Erika and Leo closed their eyes,\nstretched their arms, and focused their minds, each in their own way, to get\nready to try again.\nThen, from behind Tatsuya came a reserved voice.\n“Tatsuya, may I be so rude as to interrupt…?”\nHe knew the voice belonged to his sister without needing to turn around.\nErika, though, did turn around at the multiple pairs of footsteps.\n“Miyuki… Oh, and Mitsui and Kitayama, right?”\n“Erika, don’t lose focus,” chided Tatsuya. “Sorry, Miyuki. One more and we’ll\nbe good, so just wait a minute.”\n“Eh?”\n“I understand. I truly apologize, Tatsuya.”\nMiyuki smiled and gave a slight bow when Tatsuya turned around and\napologized.\nLeo grimaced at the nonchalant pressure that had been placed on him.\nTatsuya nodded his head to him. “Okay, this is the moment of truth.”\nHe hadn’t raised his voice, but his tone had been peremptory.\n“Right!”\n“Okay! This is it!”\nThe two of them, brimming with spirit, turned toward the CAD panel.\n“We’re finally done!”\nErika’s cheer was the bell announcing the end of the lesson.\n“Hoo… Danke, Tatsuya!”\nTatsuya lifted a hand to Leo’s word of thanks and addressed Miyuki. She was\ncoming this way with a smile. Her two classmates, Honoka Mitsui and Shizuku\nKitayama, followed with their own smiles, though hesitant.\n“Excellent work, both of you,” she congratulated Erika and Leo, then asked,\n“Tatsuya, I’ve brought what you asked for… But is this enough?”",
  "page_82": "Tatsuya shook his head. “Well, there’s not much time left anyway, so it’s\nabout the right amount. Thank you for coming, Miyuki. And Mitsui and\nKitayama, as well. I apologize for making you help me out.”\nHe had already gotten to the point where he’d seen them around and spoken\nto them on occasion, but the two surrounding Miyuki were still only\nacquaintances; they weren’t yet friends to him. That was why he seemed a bit\nreserved when he spoke to them.\n“No, not at all—this was nothing much!”\n“We’re okay. I’m actually pretty strong.”\nHonoka’s answer came with unexpected strength, and Shizuku’s with\nambiguity as to whether she was serious or joking. He thanked both of them\nagain, then took plastic bags from the three of them, including Miyuki.\n“Here.” He held them out to Erika and Leo.\n“What?”\n“Sandwiches…?”\nInside the bags were sandwiches and drinks they sold at the store.\n“If we went to the cafeteria to eat, we wouldn’t make it back in time for our\nafternoon classes,” he said, taking a bento box from Miyuki.\n“Aw, thanks! I was totally starving!”\n“Tatsuya, you’re the best!”\nHe gave a dry grin to his mercurial friends, then sat down in a nearby chair\nwhen Mizuki, too, addressed him in a reserved way. “…Is this all right? Aren’t\nfood and drink not allowed in the training rooms?”\n“That’s just for the area around the information terminals. School rules don’t\nhave much to say about eating and drinking in the classroom.”\n“Wait, is that true?”\n“Yeah. Reading the school rules carefully would tell you that. I completely\nthought it wouldn’t be allowed myself, so I was a little surprised,” answered\nTatsuya calmly, picking up his chopsticks. Mizuki was convinced and held out",
  "page_83": "her hands.\n“Huh… Well, in that case, don’t mind if I do!” Leo unwrapped his sandwich\nand began to devour it.\n“Please, you wouldn’t have minded anyway,” retorted Erika, biting into her\nsandwich in an oddly refined fashion.\nAt the lively table—well, they didn’t have a table, so they brought over some\nchairs—Tatsuya and the rest of the party that had stayed behind began their\nlate lunch.\nMiyuki and the suppliers had brought just drinks for themselves and joined\nthe circle.\n“Did you three already eat?” asked Mizuki, probably in consideration.\n“Yes. I was told by my brother to eat before him,” answered Miyuki.\n“Hmm, that’s a little unexpected. I thought for sure you’d say something like I\ncould not possibly partake of my food before my brother!” Erika’s retort was\nspoken with more of a smirk than a grin.\nThey could tell from her face she wasn’t serious. Those who heard her didn’t\nreply seriously, either.\n—Except for one person.\n“Oh my, you really understand, Erika. Normally, you’d be right, of course, but\nI did so today at my brother’s command. I cannot reject my brother’s words\nwith my own selfish hesitations.”\n“…Normally…”\n“Yes.”\n“…‘Of course,’ huh…?”\n“Yes, that’s right, why?”\nErika’s smirk was starting to cramp, and Miyuki replied to her with\nseriousness, tilting her head to the side.\nAs if to wipe away the suddenly much heavier air, Mizuki began to talk in an\nunnaturally high tone of voice. “Miyuki, your class started practice today, too,",
  "page_84": "right? What were you all doing?”\nHonoka and Shizuku exchanged glances.\nTheir expressions were tinged with awkward reserve.\nMiyuki, though, contrary to her classmates’ attitudes, didn’t make a big deal\nout of it; she lifted her lips from her straw and answered immediately. “I don’t\nthink it was any different from what you all were doing, Mizuki. We were\nprovided a dull-witted device and made to do boring practice that could never\nhave any practical use outside a test environment.”\nEveryone aside from Tatsuya looked taken aback. Those were blistering\nremarks for one who portrayed herself as a proper lady.\n“You seem like you’re in a bad mood.”\n“Yes, and I am displeased. The exercise would have been more useful to\npractice alone,” answered Miyuki, smiling, to her brother’s almost-teasing\nwords, speaking in a pouty—and yet still obvious to onlookers, a fawning—\nvoice.\n“Huh… Maybe all that tutoring wasn’t such a good thing.”\n“I will admit that I am blessed. I apologize if I’ve offended you,” said Miyuki,\nbowing seriously.\n“No, no, you didn’t offend me at all,” replied Erika, waving a hand lightly.\n“It’s only natural they’d separate the students with potential. Even in our\ndojo, people without potential get left alone.”\n“Erika, your family runs a dojo?” asked Mizuki.\n“It’s a side job, but yeah, we do a little of the old style of kenjutsu.”\n“Oh, so that’s why…” Mizuki nodded, convinced. She was probably thinking of\nwhen Erika smacked Morisaki’s CAD out of his hands with her extending baton.\n“Chiba… You think it’s only natural?” That was Honoka, hesitantly getting a\nfew words in.\n“You can call me Erika. Actually—I command you to call me that!”\n“What do you keep acting so high and mighty for?”",
  "page_85": "Leo’s exasperated retort seemed to give Honoka just enough time to\nrecompose herself. “Then you can call me Honoka, too, Erika.”\n“Okay, got it! It’s natural, and maybe that’s why Course 1 kids get instructors\nand Course 2 kids don’t?”\n“…Yes, that’s right,” said Honoka slowly, nodding.\n“Then it’s only natural, right?” said Erika, nodding without any reservation.\n“It’s the obvious thing to do, so I don’t see why you or Miyuki need to feel bad\nabout it,” she declared absently.\n“…You really put things bluntly, eh?” asked Leo.\n“Hmm? Leo, are you just mad about how things are?”\n“No, I don’t think there’s any other option either, but…” His answer was\nstammered, unusually for him.\n“I see! But I think it’s only natural, not that there’s no other option,” she\nanswered, crisply and smoothly.\n“…May I ask why?” said Honoka.\nErika cocked her head to the side. After a short silence to let her get her\nthoughts in order, she scratched at a temple with a finger and said, “Hmm… I’ve\njust thought it was only natural this whole time, so it’s a little hard to explain…\nWell, like, our dojo doesn’t teach skills for at least half a year after students\njoin.”\n“That right?” nodded Tatsuya, very interested.\n“We only teach how to move your feet and practice swings at the beginning.\nAnd we only have to show them one time, and then watch as they do their\npractice swings over and over. Then, if they get to a point where they can really\nwield a katana, we start teaching them skills.”\n“…But then wouldn’t there be students who would never get to that point no\nmatter how long they tried?”\n“Yeah, there are!” nodded Erika to Honoka’s question. “And those kind of\npeople—they want to ignore their own lack of effort. The thing is, if they don’t\nget used to the motion of swinging a katana and moving their bodies, then",
  "page_86": "they’ll never grasp the skills we try to teach them.”\n“Oh…” grunted Mizuki.\nErika glanced at her, then continued. “And to do that, they need to swing a\nkatana on their own. They learn how by watching. There’s plenty of examples\nall around them. It wouldn’t make any sense to wait for something to be taught\nto you. And thinking you’ll be taught from the beginning is a naive way of\nthinking, too. The instructors and the masters are people currently in training\nthemselves, you know? They have their own training to do. Guys who can’t\nabsorb what they’re taught would be talking nonsense if they asked for\nsomeone to teach them.”\nTatsuya watched quite interestedly as Erika, suddenly excited, went on and on\nwith her strong declarations.\n“…Thanks for the explanation, I guess, but both you and me were just getting\nTatsuya to teach us, remember?”\n“Ack! Ouch! It hurts when you say that.” Leo’s indication made her grimace,\nbut her absent attitude didn’t change. “I mean, that was, like, something we\nhad to do to get out of the immediate problem we were having… But I think if\nthe person you’re teaching isn’t at a suitable level for you to teach them, then\nit’ll end up bad for both ends. Well, the worst thing is when the one teaching\ncan’t keep up with the one being taught.”\nShe gave a quick, meaningful wink.\nTatsuya smirked in an ill-natured way. “Unfortunately, it looks like we got the\nworst result today. In the end, my record was over a hundred milliseconds\nslower than yours, Erika.”\nA thin bead of cold sweat ran down Erika’s temple. “Oh, uh, I wasn’t, I didn’t\nmean that… C-come to think of it, you didn’t reveal how the trick worked! Hey,\nwhy did my time go down so much just by putting my other hand on top?”\nShe forced the topic to change.\nIt was clear to everyone she was diverting the conversation, but it seemed like\nif they persisted too much, they’d be feeling the unpleasant effects of it much\nlater, so Tatsuya obediently let the topic be changed.",
  "page_87": "“What? It’s simple. You’re used to a one-handed style for your CAD.”\nTatsuya’s “revelation” had only just begun, but the one who had asked for the\nexplanation, Erika, went “Huh?” and interrupted.\nHer expression was asking him how he knew that, but he thought it was\nsomething one would naturally notice at first glance. Both the action she’d\nshown when they were facing Morisaki and her CAD’s form itself led him to\neasily guess the style she preferred with CADs. He ignored Erika’s slightly\nexaggerated reaction and continued his “revelation.” “So I thought that maybe\nyou couldn’t smoothly access the kind of classroom CAD where you put both\nhands on the panel.”\n“So by putting her hands on top of each other, you made it so she was only\ncontacting it in one place…” Mizuki nodded in admiration. She wasn’t the only\none giving him that look, though.\n“Using only one hand would have worked, too, but I figured you’d get more\npumped up if you put your hands on top of each other. In other words, it was all\nin the attitude.”\n“…I get it. You played me like a fiddle, Tatsuya.”\nErika gave an empty grin.\nHer sudden exhaustion was very comic-like, and it caused everyone else to\nsmile.\n“Yeah, I kind of don’t care anymore… Oh, right. Did you use the same CAD as\nthis in Class A?”\n“Yes,” said Miyuki, nodding, not bothering to hide her aversion to it.\nThat piqued Erika’s curiosity. “Hey, just curious, but could you try it out here\nso I can see what kind of time you get?”\n“What? Me?” responded Miyuki, pointing at herself, her eyes growing wide.\nErika nodded unnaturally deeply.\nMiyuki used her eyes to ask Tatsuya.\n“Why not?” he nodded, giving a dry grin.",
  "page_88": "“If you say so, Tatsuya…” she responded hesitantly, indicating her\nunderstanding.\nMizuki, who was closest to the machine, set up the scale.\nMiyuki placed her fingers on the panels as though she were going to play the\npiano.\nMeasurement began.\nThe excess psions flashed…\n…and Mizuki’s face froze.\nImpatient with her friend not announcing the results, Erika read out the\nresults.\n“…Two hundred thirty-five milliseconds…”\n“What…?”\n“Crazy…”\nThe facial-muscle petrification infected the others as well.\n“That’s amazing, no matter how many times I hear it…”\n“Miyuki’s processing abilities are close to the limit of human reaction speed.”\nThe students from A class sighed to themselves as well.\nHer brother was the only one who wasn’t surprised. The girl in question\nfrowned, unsatisfied. “I suppose that’s as good as it will get with an old\neducational one like this. Give it up, Miyuki,” said Tatsuya.\n“I simply cannot bear it… I cannot stand needing to take in an activation\nprogram like this, with so much surface noise and not a hint of polish or\nsophistication. I truly cannot display the full extent of my abilities without using\na CAD that you have adjusted, Tatsuya.”\n“Don’t say that. I’ll negotiate with the president and the chairwoman on the\nschool side of things to try and get the software switched out with something a\nlittle more usable.”\nTatsuya softly stroked Miyuki’s face, which was twisted in both sullenness and",
  "page_89": "sweetness, like a small child.\nLike always, despite the display, nobody went after them.\nNot for the showing of her real abilities, and not for the words exchanged\nbetween the siblings.\nGiven the profound difference, it was absurd to even think about being\njealous.\nTatsuya lazily watched the students coming and going in the cafeteria after\nschool. There was an air of awkwardness about, perhaps because it was used by\nmany of the new freshmen. From what Mari had told him, the school cafeteria\nsaw its highest utilization rate right after school started. As they got used to it,\nthey would find hangouts in rooms, courtyards, and empty classrooms, and\nstop coming as much. Well, they’re not running the place for profit, so they\nprobably don’t care about having fewer guests.\nThe coffee on his table had already grown cold. He’d been placed into the\nreverse situation as yesterday. The only part that was the same was that he’d\nbeen the one invited this time. Tatsuya was currently waiting for Sayaka to hear\nher answer for her “homework.”\nThere was an annoying gaze watching him, following him around, but he\ndidn’t take any particular action from his end. He was confident that if he cared\nenough, he could find who was spying on him, no matter what tricks they used\nto hide him-or herself. However, the cafeteria was an open space, so even if he\ncaught the culprit, he knew they’d just feign ignorance. Rather than fruitlessly\nreveal his own intentions, it would be wiser to wait quietly and pretend he\ndidn’t notice.\nFifteen minutes from the agreed-upon time, she finally showed up.\n“I’m sorry! Were you waiting?”\n“It’s all right. I got your message.”\nHe wasn’t lying to make her feel better. His terminal had received a message\nto the effect that she’d be around ten minutes late. It had come five minutes\nbefore they were going to meet, though, so it didn’t give him any time to",
  "page_90": "change his plans. Tatsuya was patient, however—ten or twenty minutes barely\neven counted as waiting for him.\n“I see, that’s good… I wouldn’t know what to do if you got mad and left.”\nSayaka heaved an exaggerated sigh of relief.\nIt seemed like she was in her “cute girl” mode again today. She’s been putting\non this performance for a while. What does she think I’m into? wondered\nTatsuya.\n“What’s wrong?” She sounded confused.\nIt looked like his thoughts had shown in his movements. “It’s nothing\nimportant. Sometimes you turn into a cute girl, and I was feeling the gap\nbetween that and when you’re holding a sword.”\n“Oh, come on… Stop teasing me.” With a hint of fluster, she turned her eyes\naway.\nWas that an honest response, or was it an affected act, too? He couldn’t tell.\nUnfortunately, his probing had fallen through.\n“I’m sorry,” he apologized with a smile. This was his own act. He didn’t have\nmuch confidence in it, though.\n“Geez… Shiba, deep down you’re a womanizer, aren’t you?”\n“Well, I’m not a magician. Not yet, anyway.”\nHe put his cooled coffee to his lips and slowly turned around. He wasn’t trying\nto look away from Sayaka as much as he was glancing at the shadow peeking\nout from behind some decorative plants.\n“Watanabe…” Sayaka noticed the shadow a moment later, too. Her voice was\ntoo soft, though, so it didn’t reach the ears of the one she’d spoken the name\nof.\n“’Sup, Tatsuya?”\nMari was the first one to speak. But that was clearly a challenge; if he hadn’t\nclearly looked over there, she probably would have passed by with a look of\nindifference—if that wasn’t the case, then she wouldn’t have tried to keep out\nof sight.",
  "page_91": "“I’m not slacking off.”\nMari gave a pained grin to Tatsuya’s response. He actually meant “I’m not on\nduty today,” but she found it difficult to decide if it was a joke or if he was\nacting rebelliously. “I didn’t come to give you a warning as the chairwoman or\nanything. I just happened to be passing by.”\nBut thanks to what he had said, Mari’s appearance had stopped feeling\nunnatural. And Mari, who could get with things on the spot like that, was pretty\nimpressive.\n“Sorry, it seems like I interrupted something. I apologize, Mibu.”\n“No, you didn’t…” Sayaka’s voice in reply and her expression had stiffened up\na little at Mari, maybe out of nervousness from being addressed by an\nupperclassman. Or maybe it was antipathy toward the disciplinary committee.\nTatsuya, for whatever reason, felt like neither of those was quite accurate.\nHis impression was strengthened by the powerful gaze she fired toward\nMari’s back as she left.\n“About the other day…”\nOnce Mari had left the cafeteria, Sayaka broached the main topic herself.\nTatsuya had been late in doing so, since he was thinking things like I was the\none who asked and I can’t believe she’d come to check up on me… and Was she\nkeeping an eye on something else?\n“At first, I thought just telling the school what we thought would be enough.”\nHer arms twitched—maybe she’d clenched her fists under the table or\nsomething. “But I realized that wouldn’t be enough, after all. I think we should\ndemand reform in how the school treats us.”\nRight to the point was Tatsuya’s impression. Was she serious, or was it a bluff\nto draw him in? If it was a bluff, it had the opposite effect. “When you say\nreform, what exactly would you like to be changed?”\n“Well…everything about how we’re treated.”\n“When you say everything, you mean classes, for example?”\n“…Well, that, too.”",
  "page_92": "“The main difference between Course 1 and Course 2 is the presence of an\ninstructor. Given that, are you asking for more teachers from the school?”\nThat was impossible. The national school policy was a direct result of there\nnot being enough adults who could use magic at an effective level in the first\nplace. The two-course system was, in a way, a plan created in full knowledge of\nthe drawbacks in order to secure a supply of magicians and magic engineers.\n“I don’t plan on going that far, but…” As expected, he received a stammered\ndenial in reply.\n“Then is it club activities? Aren’t the kendo club and the kenjutsu club allotted\nthe same amount of time to use the gymnasium?” As far as he’d looked into it\nyesterday, the days allotted to the kendo and kenjutsu clubs—surprisingly\nenough—were distributed equally.\n“Or is it a budget issue? It’s true that magic competition clubs are given bigger\nbudgets compared to other clubs, but I believe budget distribution based on\nclub achievement isn’t unusual to see even in normal high schools.”\n“Well that’s… That may be true, but… Aren’t you unhappy with it, Shiba?\nYou’re superior to Course 1 students in every way aside from practical\napplication—like magical theory, general subjects, physical fitness, and skill in\nactual combat. And yet just because you’re bad at application, you get looked\ndown on as a Weed. Isn’t that frustrating for you?”\nHer desperate, vehement argument made Tatsuya feel a little irritated. His\ndissatisfaction and resentment had nothing to do with how she felt. If she was\nthe one who wanted to change things, then why wasn’t she talking about\nherself? “Of course I’m not happy with it.”\nBut he—\n“Then…!”\n“But there is nothing I really want to have the school change.”\n—spoke of his own feelings.\n“Huh?”\n“I never expected all that much from a school as an educational institution.” It",
  "page_93": "was no more than a piece of a fragment, but they were his true thoughts. “I\ndon’t need anything more than the ability to view private documents and\nmaterials you can only look at from places affiliated with the National Magic\nUniversity, and to gain the right to graduate from Magic High School.”\nSayaka’s face froze up at his detached—even to himself—statement.\n“And I certainly don’t plan on blaming the school for the childish nature of my\nclassmates for using hurtful slang prohibited by the school.”\nAt first, those words appeared to be criticizing the mistaken elitism of the\nBlooms looking down at the Weeds, but in reality, he was blaming Sayaka’s own\nweakness for trying to make her own dissatisfaction the fault of someone else.\n“Unfortunately, it would seem we do not share a common position on this.”\nWith that, Tatsuya rose from his seat.\n“Wait!”\nHe turned around to see Sayaka looking up at him with a pale, clinging gaze,\nstill seated—maybe she couldn’t get up. She wasn’t glaring—it was a look of\npure sincerity and desperation. “How…can you think so rationally about it?\nWhat on earth do you have to support you?”\n“I would like to make a gravity-controlled thermonuclear fusion reactor a\nreality. Studying magic is no more than a means to that end.”\nSayaka’s face blanked out. She probably hadn’t understood what she’d just\nbeen told.\nThe actualization of a gravity-controlled thermonuclear fusion reactor was\none of the so-called Three Great Practical Problems of Weighting Magic, along\nwith the realization of multipurpose flight magic and the realization of a\npseudo-perpetual motion device by inertial infinitization. It was far too big a\nproject for a Course 2 student to suggest as a future goal.\nAnd Tatsuya hadn’t said what he did because he wanted her to understand.\nWithout bothering any more with Sayaka, he turned back around.\nA week passed without incident.",
  "page_94": "His disciplinary committee patrols saw none of the ambush-like attacks from\nthe recruitment week, and as Mizuki prophesied (?), everything was mostly\npeaceful. Finally, Tatsuya had gotten his hands on his quiet high school life—or\nso it seemed. It was, in hindsight, no more than a momentary tranquillity.\nIt was right after classes ended, just at the start of what could be called “after\nschool.”\nStudents who had club after this were going to their lockers to change or grab\ntheir things, and those who had brought in tablets and paper notebooks were\ngrabbing their bags from the sides of their desks. Those who did neither were\ncasually getting ready for the trek home, each in his or her own way. That was\nwhen it happened.\n“Attention all students!”\nA loud voice just short of howling burst from the speaker.\n“What the hell was that?!”\n“Would you calm down already? You’re basically yelling yourself!”\n“…I think you should calm down, too, Erika.”\nThe many students still in the room were busy being confused.\n“—Please excuse me. Attention all students!”\nOnce more, this time a little awkwardly, they heard the same line from the\nspeaker.\n“They must have messed up the volume control,” muttered Tatsuya lowly.\nErika keenly picked up on his words and immediately went for the jab. “Uh, I\ndon’t think this is the time for witty jokes.”\nMizuki found herself unable to actually say, “That goes for you, too, Erika”\naloud.\n“We are a coalition of the willing who aim to abolish discrimination at school.”\n“The willing…” muttered Tatsuya cynically after hearing the assertive voice of\nthe male student from the speaker. Judging by what he’d heard last week in the\ncafeteria, this broadcast hijacking was for the treatment reform demands that",
  "page_95": "Sayaka had talked about. He couldn’t help but wonder, though, just how many\nexamples in all of history there were of members who were part of political\norganizations voluntarily becoming a “coalition.”\n“We hereby declare our desire for negotiations on equal terms with the\nstudent council and the club committee.”\n“Hey, shouldn’t you, like, go?” Erika expectantly asked Tatsuya, who was\nsitting and looking at the speaker. She probably hadn’t heard his unfriendly\nmurmur, though.\n“I suppose so.” He didn’t say that her attitude was imprudent; what she’d said\nhad been reasonable. “They’ve obviously misappropriated the broadcasting\nroom. The disciplinary committee will—” At the exact moment he spoke, a\nmessage arrived on the portable terminal in his pocket rather than on the\ninformation terminal fixed on the desk. “Oops, speak of the devil. I should get\ngoing.”\n“Oh, okay. Be careful.” Mizuki’s voice trembled with unease as Tatsuya rose\nfrom his seat and turned away from them. Suddenly concerned, he turned\naround and scanned the classroom. Some of his classmates were sitting and\nsome were standing, but not many looked like they were about to leave the\nclassroom. There were few others who were bemused like Erika or curious like\nLeo. Most of his classmates looked anxious, unable to decide whether they\nshould just get home.\n“Oh, Tatsuya!”\n“Miyuki, you got called here, too?”\n“Yes, by the president. She told me to go to the broadcast room.”\nPart of the way there, he met up with Miyuki and they headed toward the\nbroadcast room. They weren’t moving very quickly, however.\n“Could this be Blanche’s doing?”\n“We can’t be sure of what group is behind this, but they would certainly do\nthis kind of thing.”",
  "page_96": "They were still talking about it as they arrived in front of the broadcasting\nroom together. Mari, Katsuto, and Suzune were already there, as well as others\nfrom the disciplinary committee’s and club committee’s active units.\n“You’re late.”\n“Sorry.”\nHe returned the superficial reprimand with a superficial apology and started\ncoming to terms with the situation.\nThe broadcast had stopped, likely because they’d cut the electricity. They\nprobably hadn’t gone inside yet because the door was barricaded. The culprits\nwho trapped themselves inside must have gotten hold of a master key\nsomehow.\n“This is clearly a criminal act, isn’t it?” They let the ends justify the means—\nmodel activists.\nTatsuya had been talking entirely to himself, but Suzune didn’t hear it that\nway. “That’s right. We must respond carefully so that we don’t set them off any\nmore than this.”\n“I don’t have much faith that being careful will cause them to listen to\nreason,” put in Mari immediately. “We should devise a quick solution, even if it\nmeans getting a little rough.”\nTheir difference in opinions appeared to put them at an impasse. It was an\nincredibly clumsy way of dealing with the emergency.\n“What do you have in mind, Chairman Juumonji?”\nLooks filled with surprise turned on Tatsuya at his question. Even Tatsuya had\nwondered if he’d stepped out of line as he’d asked it, but he figured it was\nbetter than staying in this deadlock. It must have meant that he was no adult,\neither. And this wasn’t a situation in which they could ask an adult to intervene.\n“I’m thinking we should respond to their demands for negotiation. We don’t\nhave many clues in the first place. Firmly arguing against them may allow us to\neliminate future worries.”\n“Then you say we should wait here like this?”",
  "page_97": "“I am unsure what decision to make in that regard. We should not let\nunauthorized conduct be, but I don’t believe this crime deserves a hasty\nresolution if it means destroying school property. I inquired as to whether or\nnot the school could open the door using the security surveillance system, but I\nwas denied a response.”\nThat meant they couldn’t force a resolution for the situation. Accordingly,\nKatsuto’s stance was close to that of Suzune’s. Then they couldn’t do anything\nbut wait like this.\nTatsuya gave a polite bow and stepped back, and Mari shot him with an\nunhappy stare. He hadn’t been urged on by her thorny gaze, but he took his\nportable terminal out of his pocket and booted it into call mode.\nThey could only wait, but if they weren’t going to do anything else, he\nwouldn’t have stood up and asked the question.\nThe call tone rang five times, then connected. “Is this Mibu? It’s Shiba.”\nA few more surprised looks were directed at him.\n“…And where are you now?”\nEven more sets of perplexed eyes stared hard at him.\n“I see—the broadcasting room. That is…unfortunate.”\nA moment later he grimaced—possibly because a loud voice had shouted\nback at him before the volume controller could kick in. They couldn’t do any\nmore than speculate, though, given the canal-shaped receiver was almost\ncompletely soundproof.\n“No, I am not making fun of you. Mibu, please, consider the situation a little\nmore calmly… Yes, I’m sorry. Now then, what I called you for…”\nMari’s, Suzune’s, and a few others’ ears perked up. They must have known\nthey still wouldn’t be able to hear the voice on the other end, but they didn’t\nwant to let a single word Tatsuya said slip by them.\n“Chairman Juumonji has stated that he will accept negotiations. We still don’t\nknow the student council president’s opinion—oh, the student council\npresident thinks the same way.” Suzune gestured and Tatsuya immediately",
  "page_98": "corrected himself. “With that said, they’d like to meet with you to determine a\ntime and place for the negotiations… Yes, right now. That way the school won’t\nhave to get involved… No, I can guarantee your freedom, Mibu. We’re not the\npolice, so we can’t throw you behind bars or anything… All right.”\nHe took his ear from his calling unit and stowed the device along with the rest\nof his terminal, then turned back to Mari. “She said they’ll come out right\naway.”\n“Was that Sayaka Mibu?”\n“Yes. She gave me her private number so that we could meet, but it seems to\nhave come in handy for another reason.”\nBehind him, Miyuki cast her eyes down a little. It wasn’t so pronounced that it\nwould seem unnatural, but he immediately knew she was doing it to hide her\nirritation behind her long hair.\n“You’re a quick worker, you are…”\n“You misunderstand.” Tatsuya didn’t notice it, however, since his awareness\nhad been partially on Mari’s false accusation—for better or worse. At the very\nleast, she had the good sense not to recklessly give him a sharp pinch in the\nback or anything. “Anyway, I think we should get ready.”\nWithout looking behind him (in other words, at Miyuki), he suggested their\nnext course of action to Mari, Suzune, and Katsuto.\n“Get ready?” Mari looked at him, wondering what he was saying.\nTatsuya looked back at her, exasperated, wondering what she was saying.\n“We need to get ready to arrest them. They stole a key. They probably brought\ntheir CADs with them, and they might have other weapons, too.”\n“…I thought you just said something along the lines of guaranteeing their\nfreedom.”\n“The only person I guaranteed freedom to was Mibu. Also, I didn’t suggest\nanything that would imply I was negotiating on behalf of the disciplinary\ncommittee.”\nThis time, not only Mari, but Suzune and Katsuto as well, were taken aback.",
  "page_99": "The only exception present chided him lightly. “You’re a bad person, Tatsuya.”\n“It took you long enough to notice, Miyuki.”\n“Hee-hee, I suppose so.” Her tone of voice, though, was tinged with\namusement.\n“However, Tatsuya, regarding how you saved Mibu’s private number to your\nterminal—that is a different matter. You will tell me all about it later, won’t\nyou?” added Miyuki with a broad smile and an even more amused tone of\nvoice.\n“What’s going on here?!”\nPerhaps as they’d expected, and perhaps as was only natural, Sayaka pressed\nTatsuya for an explanation.\nIncluding her, there had been five people taking over the broadcasting room.\nAs Tatsuya had thought, they possessed CADs, but didn’t have any other\nfirearms or bladed weapons with them. Tatsuya personally felt that showed a\ncomplete lack of resolve, but they didn’t think they were doing anything wrong,\nso maybe it was a matter of course that their efforts had been unsatisfactory.\nThe four aside from Sayaka were arrested by members of the disciplinary\ncommittee, but they only confiscated Sayaka’s CAD. Mari had given\nconsideration to Tatsuya’s reputation, and this was the result. Tatsuya himself\nfelt he didn’t necessarily need to keep any oral promises, though.\nSayaka’s hands were reaching for his chest, and Tatsuya held her wrists in his.\nHe had smoothly grabbed the hands trying to grab his collar, and he looked\nback at her indignation without expression.\n“You tricked us!” She struggled to break her hands free, and Tatsuya simply\nlet them go. She tried to complain further, but a voice addressed her from\nbehind.\n“Shiba has not tricked you.”\nThe heavy, strong tones caused Sayaka to tremble briefly. “Chairman\nJuumonji…”",
  "page_100": "“We will hear your excuses. We will also accept your negotiations. But\nacquiescing to your demands and accepting the actions you’ve taken as proper\nare separate issues.”\nSayaka’s aggressiveness faded. She swallowed her anger at the power of\nKatsuto, the overseer of all extracurricular activities.\n“That may be true, but could I get you to release them?”\nBut then, with those words, a petite person stepped between Tatsuya and\nSayaka. She had her back turned to him, as if to shield him.\n“Saegusa?” Katsuto said dubiously.\n“But Mayumi…” Mari began to argue.\nMayumi cut her argument off before it could begin. “I think I know what you\nwant to say, Mari. But Mibu can’t meet with us to plan the negotiations by\nherself. And she’s a student of this school; she can’t run away.”\n“We would never run away!” Sayaka snapped reflexively at her.\nMayumi, however, didn’t directly respond to her words. “I’ve just returned\nfrom consulting with the head life coach. They will apparently leave the matter\nof the stolen key and the use of the broadcasting facility without permission to\nthe student council.”\nHer explanation was nonchalant, describing both her lateness and the\nposition they were currently placed in. Still, Sayaka and the others didn’t show\nfear. Regardless of the right or wrong of the situation, Tatsuya felt that their\nnerves of steel were praiseworthy.\n“Mibu, I would like for you all to meet with the student council regarding the\nnegotiations; could you come along with me?”\n“…Yes, we will.”\n“Juumonji, I will see you later, okay?”\n“Understood.”\n“I’m sorry, Mari. I hesitated to do this because it seemed like I’d be stealing\nyour glory.”",
  "page_101": "“I may feel like that just a little bit, but practically speaking, there’s no\nadvantage to getting any glory. Don’t worry about it.”",
  "page_103": "“You’re right. All right. Tatsuya, Miyuki, you two may feel free to leave for the\nday.”\nThere was a very short period of time where they were surprised, and Miyuki\nwas the first one to recover from the situation. “…Thank you, President. We will\ntake our leave.” She gave a polite bow. Tatsuya silently followed suit, then they\nleft.",
  "page_104": "The next day, Tatsuya and Miyuki left the house earlier than usual.\nNot to get to school early, but to get to the station early.\nFortunately, they didn’t have to wait very long.\n“Good morning, President.”\nMayumi was small in stature even for a girl, but she wasn’t the sort who\nwould get lost in a crowd. Her silhouette gave off a much stronger sense of\npresence than others, allowing Tatsuya to pick her out immediately.\n“Tatsuya? Miyuki, too. What’s the matter?”\nTheir ambush seemed to come as a surprise to Mayumi—well, of course it\ndid. She had no leeway to put together her usual jovial attitude, and instead\ngave an unsophisticated, unexceptional response to them.\nSurprising her wasn’t their goal this morning, though. Tatsuya didn’t bother\nwith any needless fooling around and got to the point right away. “I was\nwondering about yesterday. Would you tell me how your discussion with Mibu\nand the others after that ended up?”\nAt Tatsuya’s demand, Mayumi’s eyes widened a bit. “How surprising.” Not\nonly did it come out in her expression, it also came out in her words. “Tatsuya,\nyou don’t seem like the type of person to pry into the affairs of others.”\n“I wouldn’t if it were unrelated, but that’s not the case.”\n“I see.” Upon hearing his answer, though, she nodded as though convinced.\nTatsuya was already related in no small way to the activities of their “willing\ncoalition.” Even if he’d wanted to treat it as someone else’s problem, they\nweren’t going to let him off the hook. Mayumi agreed, feeling that he was\nentitled to hear what would happen now—and even if she hadn’t, she was\ngoing to announce it to everyone first thing in the morning anyway. “They\ndemand equal treatment of Course 1 and Course 2 students. But they don’t",
  "page_105": "seem to have given much thought to anything concrete they want to do. It\nactually felt more like they wanted the student council to work out the\nspecifics. So it turned into a rather heated dispute. We had originally wanted to\ntalk about negotiations afterward yesterday, so we ended up deciding on a\npublic debate in the lecture hall after school tomorrow.”\n“Things escalated quickly…” The way in which Tatsuya was surprised could\nactually be called reserved. The impression coming from him was more one of\n“finally” than anything else, so he wasn’t very surprised. He considered\ndragging them into a fair fight would lead to the quickest results and fastest\nresolution in the first place, even if it left a bad taste in some people’s mouths.\nBut his reaction was probably pretty in the minority. As a case in point, the\ndevelopment had not been something Miyuki had expected—her eyes were\nwide and she was unable to speak.\n“I can understand the tactic of not giving those engaging in guerrilla warfare\nany time to spare, but that means we don’t have time to think of a plan, either.\nWho from the student council will be participating in this debate?”\nTatsuya’s question was answered with a smile that said well done from\nMayumi. She pointed at her face.\n“…You, by yourself, President?”\nHis tone was half-believing but half-dubious. And Miyuki was completely at a\nloss for words.\n“I’ll have Hanzou come up on stage with me, but I’ll be the only one talking.\nBecause, as you said, there’s not enough time for a briefing. And by myself,\nthere’s no threat of us bumping heads against each other for slight\ndiscrepancies in viewpoints. I’d be afraid of emotions being brought in to\nmanipulate impressions, in that case.”\n“So with a logical argument you cannot lose?” asked Tatsuya. Mayumi gave\nhim a confident nod.\n“And also,” she continued lightly, her voice imbued with a hint of anticipation,\n“if they do happen to possess concrete evidence enough to defeat me, then all\nwe have to do is incorporate that into managing the school.”",
  "page_106": "It almost sounded to him like she was hoping she’d be out-argued.\nJust after the announcement that the unprecedented debate would be held\ntomorrow, the coalition (as the “coalition of the willing who aim to abolish\ndiscrimination at school” came to be called) immediately energized its activities.\nThough in an unrefined way, they tried to increase their supporters as well—\ncoalition members recruiting sympathizers began to be seen in every nook and\ncranny of the school before classes, during breaks, and after school.\nThey all wore white wristbands with blue and red edges. Tatsuya wondered if\nthey decided it wasn’t worth hiding anymore or if they just didn’t know what\nthe symbol meant—he thought it was the former. He still couldn’t agree with\nthe thinking that ignorance was an excuse, though. He believed blame to be\nattached to actions rather than an internal thing.\nHowever, it didn’t necessarily make him want to hamper the coalition’s\nactions. It was only natural they’d want to get their hands on many\nsympathizers and “have a discussion” with them. He had no intention of\ninterfering with people unrelated to him who were deluding emotionally\nimmature high school students with emotional words and dragging them down\ninto a bottomless swamp. (Though that was a terrible thought in a number of\nways.) On the other hand, if it was someone he was related to—though as a\nstudent of First High, nothing that happened in the school was really unrelated\n—he was not about to allow these deceptive temptations.\n“Mizuki.”\nAfter school, on the day before the debate, he spotted a confused freshman\nbeing spoken to by what was likely a senior wearing the wristband in question\non his right hand. Mizuki was clutching some sort of paintings to her chest, so\nshe was probably in the middle of delivering things for her club. The fact they\nwere using non-digital materials in this day and age probably meant there were\nmore than a few people in the school art club who preferred it that way, but\nthat didn’t matter right now.\n“Oh, Tatsuya!”",
  "page_107": "She saw him and gave a relieved expression. Judging by her look, she’d been\nwrapped up with this for a fair amount of time.\nFirst, Tatsuya scanned the upperclassman from his head down. He was tall,\nand though at first glance he would seem scrawny, he actually had a body\ntrained in martial arts.\nHe’d seen that figure before.\nIt was none other than the male student who had attacked him with magic\nand fled during the absolute nonsense that was the club recruitment week.\n“I am Shiba, from the disciplinary committee. If you keep her for too long, you\nmay be seen as a nuisance, so please step back.”\nHe suddenly addressed the upperclassman without stopping to glance at\nMizuki’s expression. Still, though, he didn’t try and interrogate him about the\nincident that happened during the new student recruitment week. He would\nnever have admitted to anything even if Tatsuya did ask, and if he turned\naround and said they were false accusations, it would have the opposite effect.\nTatsuya slid between Mizuki and the upperclassman with an air of nonchalance\nand faced him directly.\nThere was no emblem on his left breast.\nOn his face were small, square glasses. They didn’t look fake.\n“All right. I’ll leave for now. Miss Shibata, I am free at any time, so if you\nchange your mind, give me a call.”\nThe upperclassman was acting supremely gentlemanly (though more the\nItalian kind than the British kind) and pulled back. Once his departing figure\ndisappeared from the hallway into the stairwell, he asked Mizuki about\neverything.\n“He’s the captain of the kendo club. He said his name was Kinoe Tsukasa… He\nhas pushion radiation sensitivity, too. He wanted to know if I would be part of a\ncircle he made with other students with sensitivities.”\nTatsuya didn’t expect Mizuki to come out and reveal the issue with her “eyes”\nherself. However, he was already convinced she had pushion radiation",
  "page_108": "sensitivity, so he wasn’t all that surprised.\n“And what did he say? That you should share your burdens?”\n“No, he said that his symptoms had improved a lot since entering the circle,\nso maybe it would help me, too…”\n“Oh my.” Pretty sketchy, he didn’t say.\nHe didn’t need to say it to understand Mizuki felt the same.\nFor the obstructions caused by magic-related senses being too sharp,\ncontrolling those sensing abilities was the one and only way to combat it. And in\norder to come to be able to control that ability, proper training was the fastest\nroute.\nEven without personal care from an instructor, the school’s program was the\nclosest to “proper training” you could get, so it was rather hard to think that a\nsmall circle of students could provide an even more effective regimen. It would\nbe one thing if the circle had an instructor to guide them, but the whole reason\nbehind the Courses 1 and 2 split in the first place was the hopeless lack of\nteaching faculty.\n“I told him a few times I was too busy with classes…”\n“Right. It’s better to not be greedy and go along one step at a time, right?”\nMizuki nodded in agreement with his commonplace advice and headed for\nher club room.\nTatsuya started walking in the other direction and thought. It was probably\ncoincidence that he’d come across her being accosted. But everything other\nthan that couldn’t have been a coincidence. The whole “circle” business was no\nmore than a front, or perhaps bait; doubtless the kid’s real plan was to lure her\ninto their group. Judging by how the coalition had taken the practical measure\nof attacking him before going active, that senior was the real thing. At the very\nleast, he wasn’t someone who’d been lured in, but someone who did the\nfishing.\nThe captain of the kendo club, Kinoe Tsukasa …\nI need to try looking into this senior in depth, he thought, making up his mind.",
  "page_109": "After dinner, during the time he would have usually been washing off the\nsweat and dirt from the day, Tatsuya was speeding along on an electric bicycle\nhe’d just bought.\nHis destination was the Yakumo temple.\nHe didn’t go there on foot because other than early morning and the middle\nof the night, there would always be the eyes of train passengers and passersby.\nThe use of magic without proper reason was an act that carried a criminal\npunishment. Even a minor wouldn’t escape substantial punishment.\nAs for the criminal act of riding a motorcycle—it was not one at all. Traffic\nlaws as of 2095 AD said that you could get a motorcycle license after graduating\nmiddle school. It wasn’t age-based; instead, you fulfilled the requirement by\ncompleting your compulsory education.\nAround his waist were wrapped arms that were slender, yet not the slightest\nbit bony. Two bulges from his sister pressed up against his back. Certainly in the\nthroes of puberty, no doubt, but definitely something—yet not paltry, either.\nFor a girl who had just turned fifteen (Mizuki was born in March), there was no\ndoubt that they were at least more than average.\nThat didn’t mean Tatsuya’s heart was trying to pound its way out of his chest,\nthough. She was his little sister by blood, so of course (?) not.\nAnd the trip was only about ten minutes long. With nothing immoral\noccurring either mentally or physically, the two of them arrived at the Yakumo\ntemple.\nThe usual rough greeting at the gate didn’t happen. This visit wasn’t for\ntraining—they’d made an appointment by phone beforehand. Of course, there\nwouldn’t be any polite greeting either, so they headed through the intimately\nfamiliar temple grounds for the priests’ living quarters.\nThe Yakumo priest living quarters were based heavily on one-story residential\nbuilding designs from the early twentieth century. They might have actually\nbeen constructed during that era; neither Tatsuya nor Miyuki had ever found\nout.",
  "page_110": "There was no light at all outside. And not because it was just old—it seemed\nintentional.\nNot only were there no outdoor lights, but there was no light coming from the\nbuilding, either. The night sky was cloudy, too, so no moonlight or starlight was\nshining, and the high walls blocked the city lights, making the temple grounds\nessentially pitch black.\nIt still wasn’t so late they’d definitely be asleep, but maybe the priests went to\nbed as early as they awoke. He’d never heard of ninja maintaining an “early to\nbed, early to rise” attitude, and he couldn’t imagine it, either. And besides,\nthey’d promised they’d visit, so it was impossible that nobody was awake.\nMiyuki softly extended a hand to Tatsuya’s arm. The force of her grip on his\nsleeve wasn’t very strong, nor was her hand shaking. Still, Miyuki didn’t have\nthe kind of night eyes Tatsuya did, so it wasn’t hard to imagine she was feeling\nsome instinctive anxiety at the darkness. —Well, even with one arm blocked\noff, he could just use his own inherent magic if it came to that, so he let his\nsister do as she pleased.\nThe temple grounds weren’t cramped, but they weren’t particularly wide,\neither. Before long, they arrived at the entrance to the living quarters. There\nwas no video intercom, of course, but there wasn’t even a doorbell—that was\ndefinitely intentional—so Tatsuya went to open the sliding door and announce\ntheir arrival. But as his hand touched the handle on the door…\n“Over here, Tatsuya.”\n…he heard a voice calling him from the veranda, where he’d not sensed any\npresence before.\nHe felt a twitch on his arm through his grasped sleeve. Tatsuya, mildly\nexasperated, didn’t feel like giving a dry grin. He was thinking to himself how\nchildish it was for someone his age to be having fun scaring people by suddenly\ncalling to them from the dark.\nOf course, if Miyuki hadn’t been the one to get surprised, Tatsuya probably\nwouldn’t have felt anything. In that sense, his little scheme had been partially\nsuccessful—if this was really a scheme, anyway.",
  "page_111": "Personally, he would have liked to do an about-face and leave, but he’d come\nhere tonight for a reason. He swallowed back that bitter feeling and went\naround to the veranda toward where the voice came from.\nThe man would have looked a little like a priest if he’d been sitting cross-\nlegged in meditation there, but he also thought this was more like Yakumo.\nTatsuya had known him for two and a half years, but he was still an elusive one.\n“Good evening, Master. Were you resting?”\n“Hey, good evening, Tatsuya. And you, Miyuki. And no, not at all. Not even I\nwould fall asleep after making a promise.”\nYakumo brushed off Tatsuya’s sarcastic remark so smoothly that it was\nTatsuya who found it surprising, since he’d assumed he would be in and out of\nsight, slippery as an eel.\n“Sensei, please excuse the late-night visit. If I may ask… If you were not\nresting, then why have you put out all the lights?”\n“Hmm? Oh, it’s custom. We don’t turn on the lights when we don’t need\nthem. We’re shinobi, after all.”\nTatsuya had misunderstood that as mischief-making. He reflected a little on\nhis mistake, telling himself that it was bad to let his own biases creep into his\nsituational judgment, even if it normally happened differently.\nOf course, he didn’t breathe a word of that while Yakumo was watching.\nThe man didn’t seem to notice anyway that Tatsuya had called his character\ninto doubt. He looked up at the two of them, narrowed his eyes, then quietly\nspoke almost in a monotone. “Still, that prana you siblings have sure is\nsomething. It’s even more splendid when you look at it without any lights\naround.”\n“Our prana?” asked Miyuki, tilting her head.\n“It may be easier for you if I called it pushion emissions,” answered Yakumo\nwith an unusually serious expression. Narrowing his already narrow eyes wasn’t\na jealous expression at all, either—he was staring hard at “something” that was\ndifficult to see. “Miyuki’s prana glitters and shines, knowing no bounds, and",
  "page_112": "there isn’t a single unnecessary drop of Tatsuya’s outside him. And connecting\nyou—”\n“Master,” said Tatsuya suddenly, interrupting him.\nYakumo’s narrowed eyes returned to their former state, and he gave a\nsomewhat mischievous look. “Whoops, sorry, not allowed to go there, right?”\n“No, I’m the one who should apologize for my rudeness.” Tatsuya gave a\nslight bow, signaling the end of this discussion.\nOf course, Yakumo understood it. “So what have you come for today?”\n“Actually, there was something I wanted you to use your strength to look\ninto,” prefaced Tatsuya in answer to his question. He then explained Kinoe\nTsukasa. “It’s fairly certain this senior is a member of Égalité, but I think he also\nhas a direct and strong link to Blanche. Would you happen to know through\nKinoe Tsukasa what on earth Blanche might be planning?”\n“Égalité and Blanche, eh… That’s well within my means to investigate, of\ncourse.” Yakumo nodded easily to Tatsuya’s request phrased as a question. His\nwords, too, could either be boastful or a rash promise, and it sounded natural\nfor him to speak that way.\nAnd Tatsuya knew that in reality, the man could do something so trivial as\nprobing into terrorist organizations active domestically before breakfast.\n“I am a man of the cloth, however. I don’t get involved with the affairs of the\ncommon people. And if you’ve gotten that far already, wouldn’t it be easier to\nask Kazama? He has that young lady Fujibayashi with him, right?”\nTatsuya hesitated for a moment, then bitterly began, “…I’d rather not rely on\nthe major—”\n“Your aunt wouldn’t sympathize?” interrupted Yakumo, not allowing Tatsuya\nto finish his sentence. “With the circumstances, I suppose you’d need to come\nhere.”\nTatsuya silently bowed his head. Not out of gratitude for his decision to listen\nto his request, but out of apology for his consideration.\nYakumo lightly waved a hand in front of him, suggesting apologies were",
  "page_113": "unneeded, then gestured for Tatsuya and Miyuki to take a seat on the veranda.\nTatsuya sat next to Yakumo, and Miyuki, quite a bit more reserved than her\nbrother, sat next to him; then Yakumo spoke.\n“Kinoe Tsukasa…formerly known as Kinoe Kamono,” he began without any\npreface. “Neither parent had any manifestation of magical factors. In other\nwords, he’s part of a ‘normal’ family, but it’s a branch family of the Kamo.\nAlthough it is a branch, their blood relation is fairly thin, so there really isn’t a\nproblem with calling it a normal family. Kinoe’s ‘eyes,’ though, were probably a\nkind of reversion.”\nTatsuya’s eyes widened—Yakumo was speaking as though he’d predicted his\nexact request—but he wasn’t as surprised as his sister.\nYou couldn’t keep up with Yakumo if you took the time to be surprised at\neverything the man said.\nBut he did still want to say this: “Master, have you ever heard of privacy?”\n“Sure, I looked it up in a dictionary once.”\nTatsuya’s criticism had essentially ignored the fact that he was the one who\nwas requesting an invasion of someone’s privacy in the first place, and Yakumo\nplayed dumb without even a hint of guilt.\nBoth of the men decided not to look at Miyuki, who was holding a hand to her\ntemple.\n“Anyway, how did you know I would be asking you to look into Kinoe\nTsukasa?”\nThe fact that Tatsuya changed the topic so abruptly showed how he wasn’t\nable to completely ignore Miyuki’s attitude.\nWithout objecting to the shift, Yakumo followed suit and put it behind them.\n“It didn’t have anything to do with your request—I just know about him.”\n“…For what reason, may I ask?”\n“Well, I’m a priest. At the same time—or rather, above that—I’m a shinobi.\nFish cannot live without water, and shinobi cannot live without a constant influx\nof information. I make a point of looking over people who have a history that",
  "page_114": "might make them cause a problem in the right place at the right time.”\nTatsuya narrowed his eyes just slightly. “Does that include us?”\nWithout raising his voice too much, Yakumo laughed, amused. “I tried to, but I\ndidn’t know what I was getting into. Information about the two of you has been\nperfectly manipulated. I suppose I should have seen that coming.”\nA somehow dubious air floated between the two of them. Miyuki hastily\nspoke, as though trying to get rid of that dark cloud. “Sensei, how are Tsukasa\nand Blanche related?”\nTatsuya’s and Yakumo’s faces softened at the same time at the atmosphere of\nMiyuki trying her best. They hadn’t wanted to go at it for real anyway—they\nwere glaring at each other jokingly. The feigned tension disappeared\nimmediately.\nHis expression loosened, Yakumo answered Miyuki’s question in a tone that\nsuggested he was making small talk. “When Kinoe’s mother remarried, her new\nhusband brought his son, Kinoe’s older stepbrother. He’s the leader of\nBlanche’s Japan branch. Not only as the outward-facing representative—he\nhandles everything behinds the scenes, too. A real leader.” In contrast to his lax\nexpression, his answer was anything but peaceful. “Kinoe likely enrolled at First\nHigh due to the will of that stepbrother of his. They were probably aiming for\nsomething like what’s going on now, but…I don’t know exactly what it is they’re\nplanning. No doubt it’s something wicked, though.”\n“I see…” Tatsuya slowly nodded to Yakumo’s words, thinking about\nsomething.\n“Sorry for not being able to give you the most important bit.”\n“No, you were a great help.”\nHe wasn’t just being diplomatic. He didn’t think the man would be able to\nanswer right away in the first place, and just the fact that Kinoe had been\nchanged from “someone we might need to watch” to “someone we need to\nwatch” meant a whole lot. He mentally jotted down a timetable—tomorrow, as\nearly as he could before the debate, he’d casually recommend that Mari keep\nan eye on Kinoe Tsukasa.",
  "page_115": "Once that was settled, he realized there was one more thing he needed to\nask. “By the way, Master. How strong are the abilities of Kinoe Tsukasa’s\n‘eyes’?”\nYakumo put a hand to his chin at the question. It didn’t seem like he was\ntrying to put on airs; it looked like he was seriously thinking about it. “Let’s\nsee… Strong enough for me to see the pranic waves they emit, at least. He\nshouldn’t have the power to read the prana hidden within you. At the very\nleast, he doesn’t have the kind of power to see prana that your classmate does,\nTatsuya.”\nThe last phrase Yakumo said caused Tatsuya to frown. “You’ve already\ninvestigated Mizuki, even?”\nAt that, Yakumo gave the most teasing, malicious smile he’d given all night.\n“You’re interested, too, aren’t you?”\nTatsuya barely fought back the urge to swear under his breath. It was obvious\nthe man had seen right through him anyway, but letting it show in his attitude\nwould be altogether galling.\n“Interest” wasn’t referring to the kind a boy would have in a girl of the same\nage. It was nothing so sexual as that. If he were to put it simply, Tatsuya was on\nguard against Mizuki. At her strange ability that could reveal the prana hidden\ninside him, just as Yakumo had suggested.\n“I’ll skip right to my conclusion and say that I don’t think you need to be\ncautious around her.” Tatsuya gritted his teeth, and that seemed to satisfy\nYakumo. The man wasn’t smiling anymore. His easygoing tone of voice and\ncareless attitude were the same, but it wasn’t the face of someone who would\namuse himself with jokes or wordplay. “Even if she could see your prana, she\nwouldn’t be able to understand it. If she were as well-versed in magic as you,\nshe would know not to brandish her eyes recklessly.”\nThe words had been intended to set his mind at ease, but Tatsuya found\nhimself feeling doubtful. It was clear Yakumo hadn’t meant to do that, but he\nfelt like he’d been once again presented with the fact that he was a\nnonstandard article, something separate from the stereotypical magician.",
  "page_116": "And so the day of the public debate came. Half of all the students in the\nschool gathered in the lecture hall.\n“There’s more here than I thought.”\n“More than anyone predicted, I think.”\n“To think our school has so many students with free time… Perhaps we need\nto propose a strengthening of the school’s curriculum.”\n“That joke wasn’t funny, Ichihara…”\nIn order, those were Miyuki’s, Tatsuya’s, Suzune’s, and Mari’s words. They\nwere watching the scene from the stage wing. Mayumi stood a little bit away,\nwaiting with Hattori. In the other wing were four seniors from the coalition, also\nwaiting, under the watchful eyes of a disciplinary committee member. Sayaka\nwas not among them.\n“I wonder if they have others waiting somewhere else to use actual force…”\nmuttered Mari, as if to herself. Only “as if”—it was clear she wasn’t talking to\nherself.\n“Agreed,” muttered Tatsuya, understanding this fact. He was thinking the\nsame thing.\nHe gave a quick look over the venue. The Course 1 students and Course 2\nstudents were split about fifty-fifty. Leaving Suzune’s joke aside, they hadn’t\nthought so many students—not only Course 2, but Course 1 as well—were\ninterested in this problem. Among them they identified about ten students as\ncoalition members. And even among them, the members who had occupied the\nbroadcasting room were nowhere to be seen.\n“I don’t know what they plan on doing…but we can’t make the first move\nanyway.”\nThat, too, was better left unsaid. The other side always had the initiative—all",
  "page_117": "this side could do was wait for them to act.\n“Nonaggressive security sounds good in theory, but…”\n“Chairwoman Watanabe, please don’t assume they will use force… It’s\nbeginning.”\nMari had been about to argue against something—or rather, gripe about it—\nbut she directed her gaze to the stage at Suzune’s statement.\nThe debate, in the form of a panel discussion, naturally began like this:\n“Student Council President, we have a question regarding budget distribution\namong clubs this autumn. According to the data we’ve gathered, competitive\nmagic clubs with high ratios of Course 1 students are clearly given more of the\nbudget than non-competitive magic clubs with high ratios of Course 2 students.\nThis is evidence that preferential treatment of Course 1 students is not only\nprevalent in classes, but even in extracurricular activities, is it not?! President, if\nyou really have equal treatment between Course 1 and Course 2 students in\nmind, then this unfair budget needs to be corrected immediately.”\n“Per-club budget distribution is decided upon by a council made up of every\nclub president and based on budget ideas that take membership numbers and\nactual achievements into account. The reason it looks like competitive magic\nclubs are receiving more handsome budgets is largely a reflection of their\nintramural competition achievements. In addition, even nonmagic competitive\nclubs that have reached national levels of excellence like the legball team are\ngiven a budget just as high as competitive magic clubs. I believe this graph\nspeaks for itself. The conclusion that Course 1 students are given preferential\ntreatment when it comes to budget distribution is a mistaken one.”\nIn this way, the flow reached a point where Mayumi, as representative of the\nstudent council, argued against the coalition’s questions and demands.\nStill, it wasn’t as though the coalition had any concrete demands anyway.\nThey only brought up budget distribution and said it should be done equally—\nthey didn’t have any demands as to which clubs, how much, or what portion of\nthe budget should be added to theirs.\nIn the first place, it looked to Tatsuya like they’d been lured into this and\ndragged out here.",
  "page_118": "“Course 2 students are discriminated against in every way possible by Course\n1 students. Aren’t you just trying to deflect everyone from that fact?!”\n“You stated in every way possible, but what, in particular, might you be\nreferring to? As I’ve already explained, usage of our facilities and distribution of\nsupplies is conducted on an equal basis from Class A all the way to Class H.”\nAnd their slogan, which would have been effective in the context of an\nagitated audience, was no more than empty idealism on stage. With Mayumi\nmaking her arguments using concrete examples and numbers that left no room\nfor interpretation, their unsubstantial slogan stood no chance.\nBefore long, the debate had begun to turn into a speech for Mayumi instead.\n“…I will not deny that there are those among the students who have the\nprejudice that the coalition has pointed out. However, this is a result of fixated\nsenses of superiority and inferiority. It’s created from the defensive instinct the\nprivileged have—that their privilege will be encroached upon. It is wholly\ndifferent from institutional discrimination.\n“The terms Bloom and Weed are forbidden from use by the school, the\nstudent council, and the disciplinary officers, but unfortunately, many students\nuse them anyway.\n“However, the problem is not only that Course 1 students call themselves\nBlooms and decide to condescendingly call Course 2 students Weeds. Even\nCourse 2 students scorn themselves as Weeds and accept it in resignation. It is a\nvery sad tendency, and it exists.”\nA few people hooted, but nobody made an open argument.\nThe coalition had run out of arguments against Mayumi, who was concealing\na coquettish, devilish smile, delivering an impassioned speech with a dignified\nexpression and an imposing attitude.\n“This wall in our minds is the real problem. Course 1 and Course 2 exist, clear\nas day, as part of the school system. However, this is due to there being a\nnational shortage of teachers, which is not something that will be solved very\nsoon. Either they give insufficient education to all, or give sufficient education\nto some. There is certainly a discrimination inherent in that.",
  "page_119": "“And there is nothing we can do about it. It’s a regulation we need to accept\nas students of this school if we are to study here. But other than that point,\nthere is no systematic discrimination. This may come as a surprise to some of\nyou, but the curriculum for Course 1 and Course 2 students is exactly the same.\nThere may be differences in how fast they progress, but it uses the same\nlectures and practices.”\nThat was a surprise to both Tatsuya and Mayumi. He couldn’t help but mutter\n“Huh…” under his breath, and she silently agreed with that sentiment. Suzune’s\nmouth broke into a smile at seeing them.\n“Even for extracurricular activities, the club committee and the student\ncouncil assign facility usage as equally as we can. I won’t deny that we do give\npreferential treatment to clubs with more members over those with less.\nHowever, that is a decision made because we can’t ignore either individual\nopportunity or club-based opportunity. We do not and will not systematically\nprioritize magic-based extracurricular activities.\n“Earlier, a member of the coalition mentioned that magic-based clubs were\nbeing given a heftier portion of the budget. He was correct in his conclusion,\nbut I have already showed with a graph that the distribution is a result of their\nactual achievements being considered.\n“Every issue aside from the teaching one can be explained through something\nother than the division between Course 1 and Course 2. I believe you now\nunderstand that there are rational, logical grounds for them. It is the wall in our\nminds that is the problem—our willingness to blame it on the Course 1/Course\n2 division despite understanding there is another cause, which then distances\nCourse 1 and Course 2 students from each other.”\nA few people hooted again. This time, though, some of the hoots were in\nagreement. The coalition supporters were jeering, but the voices coming from\nthe cluster of Course 2 students present telling the coalition to shut up clearly\ndisplayed a shift in the way things were going.\n“As the student council president, I am not satisfied with the current state of\naffairs. This mental wall can even incite hostility in school sometimes, so I’ve\nbegun to want to solve this problem somehow. However, the solution must not",
  "page_120": "be something that creates a new kind of prejudice. Even if Course 2 students\nwere being discriminated against, reverse discrimination against Course 1\nstudents is no solution. That cannot be permitted even as a temporary solution.\n“Both Course 1 and Course 2 students belong to this school, and these are the\nonly three years any of us will have as students here.”\nApplause broke out. There weren’t enough people clapping to describe it as\nthe entire audience applauding, but it was certainly not sparse. Among those\nclapping their hands, there was no division between Blooms and Weeds.\nThe wave of applause receded and silence came over the room. Both Course\n1 and Course 2 students, both those who had clapped and those who had not,\nwere staring fixedly at Mayumi up at the podium, eagerly awaiting her next\nwords with bated breath.\nThe coalition panelists, on the same stage as her, glared at her, frustrated.\n“I believe the only two things permitted to us are to remove the systematic\ndiscrimination and to not engage in reverse discrimination. This is an excellent\nopportunity, so I’d like it if you could all listen to my hopes.\n“In all honesty, there is one last piece of the system that discriminates\nbetween Course 1 and Course 2 students in the student council—and that is the\nrestriction on naming officers to non–student council groups. In the current\nsystem, all officer positions besides those in the student council must be\nnominated from Course 1 students. This rule is only part of the general\nassembly of the student council when a new student council president is\nelected, and we can change it. I plan to abolish this regulation during the\nassembly when I leave office. It will be my final job as student council\npresident.”\nThere was a stir. The students forgot to even hoot and jeer, and began\nwhispering amongst themselves—to their fronts and backs, to their lefts and\nrights. Mayumi waited silently until the commotion died down naturally. “I’ve\nonly been in this position for about half a year, so this commitment may sound\npremature. But we can’t force people to change their minds, and we must not\ntry. That’s why I plan on tackling these reforms as much as I can using other\nmeans.”",
  "page_121": "The entire lecture hall exploded into applause.\nThere was no shortage of cheers resembling those a fan club might give an\nidol, but it was clear that both Course 1 and Course 2 students supported not\nwhat the coalition had expressed, but what Mayumi had stated.\nMayumi was preaching about the upheaval of mental discrimination.\nThe actions of the coalition had certainly been the opportunity that allowed\nthem to start on a path toward getting rid of discrimination. However, it was\nexactly the opposite of the kind of change they wanted. Reformist groups, even\nafter accomplishing their goal, would gradually become unsatisfied with just\nthat.\nThey were too caught up in achieving their goals using the methods they had\nimagined. The result was that this was unsatisfactory not so much to the\ncoalition members but to those backing them.\n—And besides, the masterminds who had incited Sayaka behind the scenes\nweren’t planning to end things here, anyway.\nSuddenly, an explosion rattled the windows of the lecture hall, and the\nstudents, letting themselves be engrossed in one action—their applause—\nawoke from their collective reverie.\nThe deployed disciplinary officers acted immediately.\nWith the kind of unified movements that seemed unbelievable since they\nhadn’t gone through any kind of training, they restrained each marked coalition\nmember.\nA window shattered and a spindle-shaped object came flying in.\nAs the grenade hit the floor, it began spewing white smoke, but the smoke\ndidn’t scatter—instead, the grenade and the smoke all vanished back out the\nwindow, as if it were a videodisc being played backward.\nTatsuya looked over, praise in his eyes, and Hattori looked away from him,\nirritated. Mayumi couldn’t help but giggle when she saw them.\nMari was facing the exit, her arm extended. Several intruders wearing gas",
  "page_122": "masks all fell over as though they’d tripped on a stair and stopped moving.\nThe predicted assault had come with unexpected, extreme methods like\nexplosives and chemical weapons, but as planned, it was quickly being put\ndown. The panic in the room seemed like it would settle before being triggered.\n“I’m going to check on the practicum building.”\n“I’ll go with you, Tatsuya!”\n“Be careful!” shouted Mari after the siblings as they headed for the area\nthey’d heard the first explosion coming from.\nBecause magic high schools taught practical applications of magic, magicians\nwere permanently stationed there as teachers. And with First High, seen as the\nhighest magic high school, the teachers were all first-rate magicians as well. The\nschool had the power to independently force out a small military group from a\nlesser nation. Of course, they might have accounted for the possibility of\noutside attackers, but they hadn’t predicted that it would happen. In a place\nwhere nobody felt there would be an impending crisis, there was no real sense\nof caution.\nThe practicum building had easily surrendered control to the invading\nattackers belonging to the external faction. Its walls were scorched and its\nwindows were in shards. The explosion Tatsuya had heard must have been a\nminiaturized explosive incendiary. The flames from it were still burning along\none wall, and there were two teachers working on putting it out.\n“The hell’s going on here?” demanded Leo, who was engaged in a fierce,\nprolonged battle to guard those teachers when he got a glimpse of Tatsuya.\nMiyuki’s hands gracefully danced. With one hand she manipulated her\nportable terminal CAD. The psionic information bodies expanded, constructed,\nand were executed in the blink of an eye. The sparkling of magic, which only\nmagic users—magicians and magic engineers—could see with the naked eye.\nThree men surrounding Leo flew away all at once. They were dressed like\nelectricians, and were clearly neither students nor faculty. They flew back with\nsuch force it looked like they’d stepped on a land mine, but Leo, in the middle",
  "page_123": "of it all, wasn’t affected at all. That pinpoint targeting was the biggest strong\npoint of magic.\n“Terrorists have infiltrated the school!” explained Tatsuya, very simply and\ncutting out the details, as Miyuki was talking to the teachers about something.\n“Sounds pretty dangerous!” That was all it took to convince Leo—Tatsuya\nknew he was the understanding sort from that overtime practice.\nWhat was important right now was that there were enemies who needed to\nbe eliminated.\n“Leo, your broom! …Oh, reinforcements are here?”\nThen, from the other direction where the office was, came Erika. She slowed\nher pace upon seeing Tatsuya and Miyuki there.\n“Don’t worry! You made it in time.”\n“Why would I worry? You wouldn’t die even if they killed you!”\n“What was that?! …Actually, there’s no time to fool around. Just give me my\nCAD already—hey, don’t throw it!”\nCADs were delicate instruments, but they were also built with the premise of\nusage in tough environments in mind. They wouldn’t break just from falling on a\nsoft-coat path. Erika knew that, which is why she threw it to him, so she\nnaturally ignored Leo’s protest…though she probably would have ignored it\neven if it could have broken.\n“Is this yours, Tatsuya? Or Miyuki’s?” asked Erika simply, gazing at the\nmoaning invaders crawling along the ground without even a hint of sympathy.\n“Miyuki’s. I’m not efficient enough for one of these.”\n“It’s mine. I cannot bother my brother with dealing with these lowlifes.”\nTatsuya’s answer and Miyuki’s, having come up beside him, were spoken at\nthe same time.\n“Right, right, what beautiful sibling love… So these guys, I can wipe ’em out,\nno questions asked, right?”\n“No need for mercy as long as they’re not students,” Tatsuya answered,",
  "page_124": "completely and thoroughly ignoring her wisecrack, glancing subtly away from\nher.\nErika grinned happily. “Hee-hee—and here I thought high school would be\nway more boring!”\n“Whoa, scary. You sure are warlike, you know.”\n“You be quiet.”\nErika had brought her right hand halfway up, but even she seemed to be\ncautious of hitting him with her specially-made baton.\n“By the way, what were you two doing in the practicum building at a time like\nthis?”\nIf they didn’t have detention or make-up classes, the practicum building\nwasn’t somewhere students had anything to do after school. He hadn’t meant\nto ask it in a teasing, vengeful way—it was a casual question.\n“Huh? Um, well, I mean—huh.”\n“Um, yes, well, that is—hmm?”\nTheir being so unsettled was something he didn’t expect.\n“…What were you doing alone together?” he asked in a suspiciously serious\ntone of voice.\n“Alone together?!” Erika’s tone was so disturbed it was funny.\n“That isn’t it!” Leo’s tone could have been called a scream. “I was just in there\npracticing! She came later!”\n“I came here to practice, but this annoying guy was hogging the damn thing!”\n“Did you just call me annoying?!”\n“Uhh, okay, I understand. I didn’t mean anything by it.”\nThe reality wasn’t actually that interesting, but their reaction had been well\nworth it.\nHis mind switched gears. “Did you see any other invaders?” he asked\nseriously, though not suspiciously this time.",
  "page_125": "“I was protecting the teachers on the other side, but they’re really good—\nthey’re mostly all taken care of,” responded Erika, as though her previous\nfluster had never happened, in neither a serious nor light tone, but a calm one.\nLeo was quick to change gears, too. “This may sound weird coming from me,\nbut they’re really third-rate magicians. Even three-on-one they couldn’t put up\nany magic.” He spoke as if it didn’t matter, but taking on three people at once\nwas no easy task in the first place.\nThis classmate of his seemed to be capable of more than he gave him credit\nfor.\n“Erika, is the office safe?” asked Miyuki.\nErika nodded. “They were quick to respond over there. By the time I arrived,\nthe teachers had already tied up the invaders. There are a lot of valuables in\nthere, after all.”\nTatsuya found himself stuck on something she’d just said. He understood the\noffice being a target of attack because of how many valuables were kept inside.\nBut all that was in the practicum building were old CADs from previous\ngenerations. If there was any value to be found, it was the heat-resistant,\nvibration-resistant, shock-resistant building itself, which got away with just a\nfew burns to its exterior after being hit with a grenade. If it had been destroyed,\nclasses would have been obstructed for at least a month, but in the end, this\nwas all that happened. If there were any other places where the school’s\nadministration would be hampered due to destructive activities, it would be\nwhere important equipment, materials, and documents were stored, since they\ncouldn’t resupply them immediately…\n“…The lab building and the library!”\n“Then was this a diversion? I did not expect such a broad scope. Could the\nresistance holding down the debate have been a diversion in itself?”\nTatsuya shook his head at the question Miyuki offered. “No, I think they were\nserious about it. I wonder if the coalition was just being used.” He didn’t use a\nword like unfortunately that would have shown pity toward them. That would\nbe rude to those who were seriously clamoring for the elimination of\ndiscrimination.",
  "page_126": "“Anyway, the question is what we do now.”\nThey had three choices: split up into two groups, go to the lab building, or go\nto the library.\n“They’re after the library.”\nTheir decision was brought to them in the form of information.\n“Ms. Ono?”\nLow-heeled shoes, a slim-fitting pantsuit, and a lustrous sweater under a\njacket. Her outfit today was completely different from the other day—it was\nmeant for moving around in. The shine on her sweater probably came from\nmetallic fibers with anti-bullet and anti-blade effects. Even her expression was\ndrawn in severity. The air she gave off was like another person’s.\n“Their main force has already gotten into the library. Mibu is there, as well.”\nThe three others looked at Tatsuya, confused. He stared right back at Haruka,\nthough. Less than a second passed. “May I ask you for an explanation once this\nis over, ma’am?”\n“I’d like to decline, but that won’t be enough. May I ask you one thing in\nexchange?”\n“What is it, ma’am?”\nHaruka displayed vacillation, but she didn’t get caught up on her words and\nwaste time. “I’m asking you this as Haruka Ono, a counselor. I want you to give\nMibu a chance. She’s been worried since last year about the gap between her\nworth as a kendo athlete and as a Course 2 student. I talked to her several\ntimes…but I don’t think I was enough. She ended up going along with them, so\n—”\n“That’s naive, ma’am.” Her request was likely founded in an earnest\nawareness of her duties, but Tatsuya discarded it without mercy. “Let’s go,\nMiyuki.”\n“Yes.”\n“Hey, Tatsuya!” Leo called after him.",
  "page_127": "And then, to a friend he couldn’t discard, he gave one piece of advice. “If you\nhave pity when you can’t afford it, you’re not the only one who gets hurt.”\nHe didn’t have time to say any more—and that was clear as he ran off.\nClose skirmishes had unfolded in front of the library.\nAside from CADs, the attackers were also carrying knives and throwing\nweapons. There seemed to be a few students among them, but most were\noutsiders—invaders. The receiving end of the attack, composed mostly of\nseniors, had no CADs but had overwhelmingly superior magic power. The skill it\ntook to go toe-to-toe with magic and without a CAD against weapon-wielding\nenemies marked them as fledgling magicians with hopeful futures. (And not so\nmuch fledglings as star rookies, they were.) No sooner had Leo seen it than he\ndove in. Loosing a scream of “Panzeeeer!” he charged into the fray. There was\nmeaning in his roar.\n“Voice recognition? He gets more unique every day…”\n“Tatsuya, was he just expanding and constructing a program at the same\ntime?”\n“Yeah, sequential expansion. It was all the rage a decade ago.”\n“Boy, even his magic is outdated…”\nFortunately, Erika’s talking behind his back (?)—after having ignored the fact\nthat the sealing magic she used was a technique of the past now—didn’t make\nit to the fighting Leo. With his bulky, wide CAD that covered his forearm like a\ngauntlet, he stopped a cudgel being brought down at him and delivered a\nreturn punch.\nI see. The CAD doubles as body armor, so I understand why it uses voice\nrecognition—it doesn’t need any moving parts or exposed sensors. Still,\nthough…\n“I’m surprised it hasn’t broken on him yet,” Erika remarked.\n“He’s using hardening magic on the CAD itself, too. Hardening magic works by\nconfining the relative coordinates of particles to a tight area. However strong",
  "page_128": "the impact is, as long as the relative coordinates between pieces don’t go out of\nalignment, it can’t be broken as long as its exterior remains intact.”\n“So he can use it as violently as he wants, huh? Fitting magic for a guy like\nthat.”\nErika and the others, trading comments for sneering, went around the melee\ntoward the entrance. Leo, despite it, began a rampage, like he was trying to\nblow off steam. With his hands both covered by black gloves, he shattered the\npellets and icicles flying toward him and went on smashing the shafts of metal\nand carbon resin. Sometimes sparks would fly. There were probably stun batons\nmixed in. There were thrusting knives he couldn’t quite avoid, and some spring-\nloaded darts hidden in the enemies’ sleeves firing at him to try and surprise\nhim. None of them penetrated his white-and-green blazer.\n“Is he hardening everything he’s wearing? It’s like he’s covered in a full suit of\nplate armor.”\nThe man himself had been unhesitating in declaring this his specialty. He’d\nclearly meant it.\nBy using a method of sequential expansion so he could both expand an\nactivation program and construct and execute a magic program at the same\ntime, Leo’s hardening magic was being continuously updated.\nThe terrorists might have been armed, but they were still fresh, hairless\namateurs in terms of how well trained they were. They wouldn’t be able to\npierce his armor. And his fists—they should have been punching with nothing\nbut physical power, but the movement and acceleration spells he was using\ngranted them exceptional destructive force. That kind of combat potential\ncould be used right this instant in the military, as long as it was a close-combat\nskirmish where usage of firearms was restricted.\n“Leo, we’re going on ahead!”\n“Got it! I’ll hold ’em!”\nTatsuya left the area to Leo.\nIt was deathly silent inside the library. If Haruka was to be believed, then the",
  "page_129": "attackers hadn’t been repelled—the ones who went to intercept them had\nbeen blocked off. Nonfaculty police officers were normally stationed in the\nlibrary, but it seemed like they’d been pacified already. Their competence was\non another level, as might be expected from their “main force.”\nTatsuya temporarily hid in a large closet beside the entrance, then expanded\nhis awareness and searched for life signs. Not for indications of presence, but\nlife signs.\nModern magic was a method of interfering with eidos, the information that\naccompanied events and the bodies that were one and the same with life.\nEveryone who used modern magic was conscious of individual eidos within the\nIdea—the information body belonging to the world itself, and the “information”\nplatform containing all eidos had come to be called by a term from ancient\nGreek. But they were only conscious of eidos. There were few who could tell\nthem apart. In exchange for normal magic talent, Tatsuya possessed a special,\nefficient perceptual ability that allowed him to distinguish individual eidos\nwithin the Idea.\n“Four in the special viewing room on the second floor, two at the bottom of\nthe staircase, and two more at the top…”\n“Wow. With you around, there’d be no point in an ambush. I definitely\nwouldn’t want to get on your bad side in a real battle.”\n“What could they be doing in the special viewing room?” asked Miyuki.\n“For a hacking attempt, this is too docile. They’re probably trying to steal\nclassified information owned by the Magic University,” speculated Tatsuya.\n“You can access private documents barred from the general public from the\nspecial viewing room.”\nErika looked disappointed.\n“Erika, you look like you’ve been let down,” prodded Miyuki.\nThe girl took the opportunity to give her signature exaggerated shrug. “I’m\nnot! It’s just…a rebellion at school, youthful energies running rampant… I was\nkind of excited for it. But now that we know it’s just some normal spy\noperation… I guess I just want my hopes and dreams back, you know what I",
  "page_130": "mean?”\n“Don’t ask me. And you’d have been better off not having those dreams to\nbegin with.”\n“But you just answered me!”\nTatsuya grunted, unable to argue with her. Miyuki hastily backed him up. “We\nmust hurry to the special viewing room. Shall I perform an ambush?”\n“No way, I’m gonna steal your thunder this time!” sang Erika before leaping\nout without waiting for a response like a burglar who’d just stolen a role in a\nplay.\nWithout a sound or a hint, she urgently slid toward the stairs. Her baton, CAD\nembedded in its hilt, was already expanded.\nThe enemies had been waiting for an ambush opportunity, but instead they\nwere assaulted. She brought down her baton, and as soon as they were struck,\nthey toppled over backward.\nErika had taken down two enemies in an instant. It was a fully refined hand-\nto-hand combat technique, in stark contrast to Leo’s wild fighting style.\nAt the sounds of their allies falling, the personnel lying in wait at the top of\nthe stairs finally noticed she was there. One began to dash down the stairs, and\nbehind him, the other began expanding an activation program. But in a flash of\npsions, the program shattered. The magician stood there, dazed, his magic\nhaving been negated. Tatsuya noticed the man stiffen up unnaturally, and a\nmoment later he lost his balance and tumbled down the stairs.\n“Oops…” grunted his little sister cutely.\n“No problem,” he responded curtly, returning his handgun-shaped CAD to his\nshoulder holster.\nPeople who stand on two feet do so by unconsciously making minor\nadjustments to their center of gravity. If your body’s movements were suddenly\ndecelerated and forced to stop, you wouldn’t be able to stay standing. They’d\nknown that much, but Miyuki hadn’t predicted the man would fall down the\nstairs.",
  "page_131": "Well, it doesn’t look like he’s broken his neck. He was part of all this violence,\nso he would have gone into this knowing he could get two or three ribs broken\nand maybe a concussion. That’s what he meant by “no problem.”\nOn the other hand, the second ambushing trooper came at Erika with not so\nmuch a knife as a real blade you wouldn’t go wrong in calling a short sword.\nHe knew his face. He was the male student who had gone up against Sayaka\nas part of the kendo club’s exhibition. Tatsuya could see a white wristband lined\nwith blue and red on the right wrist he was using to try and break Erika’s\nposture. It seemed as though the kendo club had been the first ones corrupted.\n“Crap. Tatsuya…I need to…go easy…on students…right?”\nHer question, spoken through a clash of locked swords, trembled slightly. The\ndifference in physical strength born from their height disparity was affecting\nboth of them, placing them in a stalemate.\n“You don’t need to force yourself to go easy on them,” said Tatsuya, stepping\ntoward them.\n“No help needed here! No sir!” she said, stopping him. “I think this one’s good\nenough for me to get serious.”\nShe instantly upped the pressure she was applying, then let it go a moment\nlater. Parrying her opponent had reversed their positions. She waved for them\nto keep on going. “Leave this to me!”\n“All right.”\nThe male student placed himself into a half-stance, on guard against a pincer\nattack. But the student didn’t exist for Tatsuya or Miyuki anymore. Tatsuya\nlaunched himself off the floor with force. Miyuki launched herself off the floor\nwith grace. Tatsuya’s body bounced off the wall…and Miyuki’s danced through\nthe air. They landed on the upper floor at the same time.\nErika whistled in admiration as they left her and the dazed coalition student\nthere and headed for the end of the hallway, where the special viewing room\nwas.",
  "page_132": "Sayaka watched the work being done before her eyes with a complicated\nmind-set. Her allies, members of Blanche, were hacking into the only terminal in\nschool that could access the secret documents—books and materials containing\nthe very latest in magic research.\nIt was over half a year ago now that the boys’ captain, Tsukasa, had mediated\nfor her to be placed here. For some reason, Tsukasa didn’t take her to Égalité,\nof which he was a member, but to Blanche instead. Sayaka hadn’t intended to\nspread her own activities outside of school in the first place. She wasn’t willing\nto even come close to getting involved with the law. Meeting them was part of\nher obligation toward Tsukasa, to whom she was indebted.\nTsukasa’s older brother, who they said was the representative of Blanche’s\nbranch in Japan, had taught her a few things. Even now that she had started to\nthink magic-based discrimination wasn’t a problem that could be solved just by\nstaying within school, her own focus of concern was the discrimination against\nCourse 2 students.\nShe had actually wanted to participate in the debate. It wasn’t enough for her\nto feel strongly about it; she wished to make her voice heard. Tsukasa had\nconvinced her that this would be a more suitable position for her, though, so\nshe couldn’t decline.\nWhat am I doing? she thought. They’d taken a key without permission, and\ntaken part in hacking… Was this what she wanted? As she felt her thoughts\nbeginning to move in a forbidden direction, she quickly returned her attention\nto the mission in front of her.\nBut they were supposed to be trying to abolish magic-based discrimination.\nWhy did they need cutting-edge magic research materials for that? Tsukasa’s\nolder brother had told her that publicizing the research results of magic schools\nwould be the first step toward abolishing discrimination.\nBut I don’t really think letting people who can’t use magic see magical theory\nwould mean anything…\nThe question that had been pestering her came to mind again. Magic studies\nhad no use for those who couldn’t use magic. Magical theory was practical in a\ncertain sense, too, so it didn’t have any of the spiritual nature of religion. If",
  "page_133": "there was anybody who wanted to reap the fruits of cutting-edge magic\nresearch, then wouldn’t it be those who wanted to use magic…?\nNo, I’m sure there is research hidden in there that will benefit those who can’t\nuse magic, too…\nIt was a hypothesis created to satisfy herself. An answer she had been led to\nbelieve. But no matter how many times she repeated it to herself, she was\nnever fully convinced.\n“…Great, it’s open.”\nThere was a slight stir. Someone hastily produced a solid cube for recording\ndata. Sayaka thought she saw a clear sign of greed cross her allies’—cross the\nmen’s faces, and turned her eyes away. Toward the door.\nSo she was the first one who noticed it. “The door!” she shrieked, causing the\nremaining members to whip around to look. They watched as the door was cut\ninto a square, then fell into the room.\n“Absurd!”\nThe surprised shout could have been called restrained, given the reality.\nStable, solid objects were not easily affected by eidos. The door was\nconstructed from composite armor that could withstand a hit from an antitank\nrocket. Magic could destroy it—but to do that, whether by weighting, vibration,\nor dissolution, the magic program would need to be gigantic. It would require\none of those processes to be layered upon itself many times. This\ninstantaneous, quiet destruction should have been impossible.\nAs the men stood there frozen in both thought and action at the outrageous\ndisplay, the memory cube at the one’s fingertips shattered. Then, the portable\nterminal they were using to hack in with fell apart like its manufacturing process\nhad just been swiftly reversed. The signal from the connected device suddenly\nbroke off, and the viewing terminal locked itself.\n“Corporate spies, I presume? Consider your schemes officially ruined,” said a\nfamiliar voice, declaring the end in an indifferent tone. Tatsuya held a shining,\nsilvery, handgun-shaped specialized CAD. Gracefully sticking behind him was a\nslender person with her portable terminal at the ready.",
  "page_134": "Neither of the siblings’ expressions bore any excitement whatsoever, and it\nalmost made her forget they were in the middle of committing a crime.\n“Shiba…” whispered Sayaka. She saw a right arm come up beside her.\nNot in surrender—her ally was pointing a live gun at his underclassmen. The\nman was not a student of First High. He wasn’t even a student at all. Their\nleader, Tsukasa’s older brother, had directed them to bring this man with them.\nThe carefully selected team member now looked hostile and ready to kill.\nSayaka screamed silently. She controlled it so her voice didn’t come out. Her\nhands didn’t move. The realization that her ally was a killer scared her out of\nher wits.\nBut he didn’t shoot. No bullet, capable of such easy death, came out. Instead,\nhe crumpled to the floor, then writhed in such intense pain he couldn’t even\nshout. His right hand still held the handgun. No, the handgun was glued to his\nhand; it was swelling up and turning purple.\n“Please stop this foolish behavior. Do not think for a moment that I will\noverlook any malice directed toward my brother.” The girl’s tone was quiet,\npolite…and dignified.\nShe was so utterly different. Sayaka knew she couldn’t stand up to her no\nmatter what she did. Hers was a voice that froze any rebellious thoughts in their\ntracks just by speaking.\nNext, Sayaka’s paralyzed ears heard Tatsuya’s cruel words. “Mibu, this is\nreality.”\n“Huh…?”\n“An equal world, one where everyone is treated as good as everyone else.\nSuch a thing is impossible. If there were a fair world where ability and aptitude\nwere ignored, it would be a world in which everyone was treated equally coldly.\nYou understand, though, don’t you, Mibu? Nobody can grant that kind of\nequality. It only exists as a sweet, convenient lie used for deceit.”\nSayaka’s unfocused eyes became focused then. Her underclassmen watched\nher directly, their eyes expressionless, but that slight hint of emotion deep\ninside them…",
  "page_135": "“Mibu, you’ve been used to steal the Magic University’s private technology.\nThis is the reality—the one you’ve been given by someone else, and the ideal\nthat sounded so good.”\nWas it pity?\n“Why?! Why did it turn out like this?” As soon as she felt that, some emotion\nshe didn’t really understand exploded out of her. “Was it wrong to try and get\nrid of discrimination? Was it wrong to want equality?! There’s obviously\ndiscrimination out there, isn’t there?! I’m not just imagining it. I didn’t just\nimagine all the ridicule. The insulting stares. I heard the voices making fun of\nme! Was it wrong for me to try and get rid of that? Aren’t you the same? You’ve\nalways been compared to your perfect little sister next to you, haven’t you?\nAnd you’re being insulted unfairly! Everyone looks down on you, don’t they?”\nHer shouting was her heart’s lamentation. It was a scream from deep in her\nheart. But it didn’t make it to Tatsuya’s heart. It didn’t evoke sympathy.\nEverything she’d just said was the simple truth, and he accepted all of it without\na second thought. The only things that registered in his mind were the\ndefinitions of her shouted words and the fact that she was shouting. He only\nsaw that there was a girl here, wailing.\nThe light of pity Sayaka had seen was no more than something created by her\nown pity toward herself. She had hurled her words at the young man, but they\nhadn’t reached his heart—instead, they came back to her own.\n“I do not look down on my brother.” It was a quiet voice. But in Miyuki’s voice\nwas an emotion to silence Sayaka’s grief: anger. “Even if everyone else in the\nworld slanders my brother, abuses him, and despises him, I will never change in\nmy respect and affection for him.”\n“…You…” Sayaka was speechless. Miyuki’s oath was so striking that it didn’t\nonly cut off her words, either, but her thoughts and feelings as well.\n“My respect and affection have nothing to do with magic power. At the very\nleast, the magic power the world seems to find so important is much stronger in\nme than it is in my brother. However, that fact holds no sway over my feelings\nfor him. None of my feelings for him will be changed in the slightest because of\nsomething like that. Because I know that it’s only one part of who he is.”",
  "page_136": "“……”\n“Everyone looks down on my brother? That is the unforgivable insult. There\nare certainly ignorant people who scorn my brother. But just as much as they\nscorn him—or maybe even more—there are people who understand how\nwonderful he is. Mibu, you are a pitiful person.”\n“What was that?” Her voice was loud—but without strength. It was devoid of\nfeeling and emotion.\n“Wasn’t there anyone who acknowledged you? Has magic always been the\nonly thing you’ve been measured by? No, I don’t think that’s true. I know at\nleast one person who doesn’t think that way. Do you know who I’m talking\nabout?”\n“……”\n“My brother has acknowledged you. Both your skills with the sword and your\nappearance.”\n“…But those are just superficial things!”\n“They are indeed just superficial things. But they are still a part of you.\nThey’re your charm. They’re who you are, are they not?”\n“……”\n“Of course they’re superficial. This is only the fourth time you’ve directly\ntalked to my brother, after the two times in the cafeteria and the one time at\nthe broadcast room. Only four times. What are you expecting from someone\nyou just met?”\n“Well, I…”",
  "page_138": "“In the end, the one most prejudiced against you is you. You are the one who\nlooks down on yourself more than anybody as a failure and a Weed.”\nShe couldn’t argue. She couldn’t even think about arguing. Miyuki’s indication\nwas such a shock that her mind went white.\nAnd when people stop thinking…\n…they abandon their own will.\nAfter discarding the shed skin of one’s own will, the whispers of the devil\nsneak in. No, in this case, the whispers of the puppeteer.\n“Mibu, use your ring!” A man had been hiding, cowardly, behind a sixteen-\nyear-old girl. That man gave a shout—almost a scream, in fact—and he swung\nhis arm down toward the floor.\nThere was a soft crack and white smoke. At the same time, an inaudible yet\nstinging noise spread through the room. It was psionic noise. It was waves of\nCast Jamming interfering with magic execution.\nShe heard three footsteps inside the smoke. Tatsuya stuck out his hand twice.\nPalm strikes, inside the smoke. His eyes were closed. There were two dull splats\nand two thuds on the floor.\n“Miyuki, stop,” came an instruction during the spare moment that came after.\nThe magic program Miyuki had been constructing immediately changed into\nsomething else. The wind whipped around, sucking in the white smoke. It was\nall compressed down to the size of a ping-pong ball, then imprisoned by dry ice\nthat had appeared in midair, and fell to the floor.\nNow that the room was visible again, she saw the three men lying prone. One\nman rolled around in intense pain from frostbite, and the other two had\nfainted, bruises on their faces.\n“Tatsuya, was it all right not to arrest Mibu?” asked Miyuki, confused—but in\nno way guessing that he had an ulterior motive. Her suspicions of his\nrelationships with women was no more than a silly, childish form of\ncommunication between siblings. She was well aware that Tatsuya wouldn’t\nentertain that sort of personal feeling.",
  "page_139": "“I don’t doubt your skills, but with as little visibility as we had, things could\nhave turned out with an unexpected surprise. You don’t need to take any risks\n—Erika will take care of Mibu for us.”\nIf she chose the shortest route to the exit, she would have to bump into Erika,\nwho was waiting back on the first floor. And from how the girl looked, she\ndidn’t seem to have enough mental capacity to take the long way around.\n“I don’t think there is any reason for Erika to get so zealous about it…”\n“Not unless her opponent is Mibu.”\nMiyuki didn’t really know why people got so hung up on specific enemies. To\nher, battle was something to be avoided first—and if that didn’t work, won at\nall costs. It was the same no matter who she was fighting. Whoever they were,\nit didn’t change the fact that they were an enemy. She only knew that there\nwere people who were specific about who they fought, and that was all.\n“I see. Erika will be fine, I expect.”\nSo she left the girl to Erika, then decided to help her brother arrest the\nterrorist thieves.\nSayaka’s actions were essentially reflexive. She’d been given the ring of\nantinite as a last resort in case she needed to escape. She was being educated\nin the usage of magic, so she knew the properties and limitations of Cast\nJamming. In fact, she was more knowledgeable than most magicians at its\napplication.\nThis ring didn’t have the strength to defeat a magician. Cast Jamming could\nonly disrupt magic—its only use was to avoid magic-based attacks. She couldn’t\nbeat that freshman with it.\nShe’d never seen such adept technique before. The freshman’s martial\nprowess was now burned into her mind.\nWhen she’d been given the ring, her leader had emphasized many times that\nshe should use the ring to escape. That vision was burned into her eyes, and the\nwords carved into her ears, and they were controlling her limbs.",
  "page_140": "There were sounds of things hitting the floor behind her. There was nobody\nfollowing her. She knew they meant her allies had been defeated. But with her\nthoughts paralyzed, she never realized she had the choice to go back and help\nthem. She just followed what the manual said to do in case of failure—to return\nto the relay base belonging to a certain organization outside school. Dominated\nby that unreasonable but compulsive idea, she ran through the hallway and\ndashed down the stairs.\nAnd there she stopped.\n“Hello, there! Nice to meet you!”\nA single female student—by the way she introduced herself, she was probably\na freshman—was standing in her way, her hands joined behind her back,\nsmiling in a friendly way.\n“…Who are you?” she asked with clear caution in her voice.\nBut the freshman didn’t change her cheerful expression. “I’m Erika Chiba from\nClass 1-E. I would just like to make sure that you are the runner-up in the\nnational middle school girls’ kendo tournament the year before last—Sayaka\nMibu, correct?”\nShe found herself hit with a shock that she didn’t understand. Somewhere in\nthe shadows of her mind, somewhere in her heart where she couldn’t see, she\nfelt a pain, like she’d been struck with a shinai. “…Is there something wrong\nwith that?” she asked in return, hiding the shock and her pain.\n“No, not at all. Nothing wrong with it. I just wanted to make sure.”\nErika was still standing with her hands folded behind her.\nBut there were no openings. Her body was slender, so it was far from blocking\noff the hallway, but Sayaka couldn’t see an opening for her to slip by. And…\nthose hands she hid behind her back—were they empty?\nWas she holding anything?\n“…I’m in a hurry. Could you let me through, please?” She couldn’t feel anyone\npursuing her from behind. But he probably snuck up on people perfectly silently\nevery day before breakfast. Sayaka clamped down on her impatience and spoke",
  "page_141": "to Erika as calmly as she could.\n—Of course, she also knew there was zero probability she’d be able to just\nwalk on by.\n“Where could you be going?”\n“It’s got nothing to do with you.”\n“So…you don’t intend to answer?”\n“That’s right.”\n“I suppose negotiations have failed,” declared Erika, seeming to enjoy this. It\nwas a silly way of making her point, but Sayaka was fully aware the girl was\nnever going to let her through anyway.\nSayaka quickly looked to her left and right. Unfortunately, she didn’t have a\nweapon. She had her CAD, but if she used magic, she would give up the only\nadvantage she had—the Cast Jamming.\nIn her peripheral vision she saw a silver rod roll her way. It was one of the\nstun batons her allies had brought with them. Its reach was a little short, but it\nwas a worthy substitute for what she was familiar with.\nSlowly, imperceptibly, she dropped her weight.\nShe gathered her body’s strength in her feet…and instantly leaped forward,\nrolling to pick up the baton. Then, without a moment’s delay, she came up and\npointed at the female student blocking her way.\nErika watched her, wondering what she was doing. “You don’t need to hurry. I\nwould have given you time to pick up a weapon…”\nSayaka’s face flushed red. She cast a sharp glare at Erika to try and cover up\nher awkwardness and embarrassment at what was essentially a one-woman\ncomedy act. “Move out of the way, or you’re going to get hurt!”\n“And now I have a proper reason to defend myself,” she muttered, seeming\nto be no longer interested. “Not that I was going to use that as an excuse\nanyway.”\nShe brought her hands out in front of her. In her right hand was an extending",
  "page_142": "police baton, and in the other was a wakizashi with an actual blade. She tossed\nthe weapon in her left hand aside.\n“All right, then shall we begin?” she asked, bringing her right hand in front of\nher.\nSayaka assumed a stance again, with her weapon in front and her left hand\nsupporting her right. She had a two-handed middle stance, while Erika stood in\na one-handed half-stance.\nIt began suddenly, without any pre-match crossing of swords or shouts.\nAs soon as Erika saw her move, her baton flew toward Sayaka’s neck. She\nimmediately raised her own hands. With the defensive reflexes built into her\nbody, she barely managed to stop the attack—and a moment later, her\nopponent had spun around behind her.\n“A self-acceleration spell…?” she muttered. Erika didn’t answer. “…The same\nas Watanabe?” Those words, however, caused Erika to stop. It was only\nmomentary, but it was enough to turn things around.\nWhen she went to take another step, an irritating noise on the floor stopped\nher foot. It was psionic noise, and she wasn’t hearing it with her ears. Erika\nscowled, and Sayaka became the attacker.\nShe delivered a flurry of blows without leaving any time to breathe. Face,\nface, hands, torso, diagonal, upward, face, reverse diagonal… Her sword skills\nbore witness to the fact that she was not only well-versed in kendo as a sport,\nbut in the old-fashioned ways, too.\nShe attacked like a flame. As fast as the wind, as quiet as the forest, as daring\nas fire, and immovable as the mountain, as the saying went. Her attacks were\nlike a conflagration.\nAt some point, the psionic noise disappeared. She’d known that would\nhappen. Cast Jamming worked by injecting psions into antinite. If you stopped\nthe psion injection, it would stop emitting noise. The noise inside the room, too,\neventually decayed and terminated. There was no way for Sayaka to maintain\nthe Cast Jamming, since she was currently pouring everything into her sword\nattacks. It wasn’t good enough to let her remain in a state to use magic, and it",
  "page_143": "couldn’t keep up with the speed of her sharp and fierce magic-weaved attacks.\nAnd yet Erika still didn’t try to use magic. Was she being pressured too much\nto build a magic program? Erika was a Course 2 student who struggled with\ncompilation. Her CAD, however, was a specialized one with an emphasis on\nspeed, and she was an expert at using this specific shape of CAD. And even\nunder the effects of Cast Jamming, the supply of psions to her sealing spells was\nstable.\nIf she pushed herself off and got away, she should be able to activate the\nmagic she specialized in. It didn’t look like Sayaka was pressuring her enough\nthat she couldn’t get away. Her attacks were like a conflagration—but on the\nother hand, they were just as reckless and frantic.\nErika was handling them, blocking them, never moving more than she needed\nto. There was no impatience in her eyes. There was no disturbance in her\nbreathing.\nThe first one to be disrupted was Sayaka, tiring from her attacks. The tables\nturned in the blink of an eye as the attacker and defender swapped places. One\nscraped past the other’s finishing strike. As Sayaka stood there stiff as a pole,\nErika flashed her own weapon across and knocked hers to the side. Her attack\nhad been aimed at its base, and the stun baton, more fragile in construction\nthan a wooden sword or a truncheon, bent.\n“……” Sayaka stared down without fear at the police baton that was now in\nher face. A strong fighting spirit was in her eyes.\n“Pick it up,” demanded Erika without moving her weapon.\n“……” Sayaka didn’t understand what she was talking about, and couldn’t\nanswer.\n“Pick up that wakizashi and show me everything you have. I’ll crush the\nillusion of that woman chaining you down.”\nDespite the police baton in her face, Sayaka bent down. She picked up the\nwakizashi Erika had tossed aside before, then took up a stance again. But then,\nfor some reason, she broke her stance and added her left hand to her right.\nThe brass ring on her right middle finger shone. She removed it and threw it",
  "page_144": "to the floor. “I won’t rely on that dumb thing. I’ll defeat your technique with my\nown power.”\nSayaka took off her blazer. Beneath the blazer of the First High girl’s uniform\nwas a sleeveless one-piece. Her arms were now exposed from the shoulder\ndown—everything below her shoulders had gained freedom.\nThen she turned the blade over. Striking someone with the dull edge ignored\nthe construction of a katana, and she ran the risk of breaking it in vain. She took\nthis stance despite the risk, showing her hesitation to kill and her discontent at\nhaving to dull her blade.\n“I can tell,” she said, taking such a stance and facing Erika. “Your skills—you’re\nfrom the same school as Watanabe.”\n“My skills are a little bit different from that woman’s.”\nThey each exchanged short sentences, but from then on, silence ruled.\nThe silence gave way to tension, and tension to strain.\nThe very moment that strain crested, Erika vanished.\nThere was an instant crossing of blades. A high-pitched metallic sound rang\nout.\nErika’s strike had been difficult even to observe, accelerated by magic as it\nwas—but Sayaka stopped the blow. Stopped a single stroke.\nAnd then the wakizashi fell from her hands. A moment later, she dropped to a\nknee, holding her right arm.\n“I do apologize. I might have broken the bone.”\n“…It does feel cracked. It’s fine. That means you couldn’t hold back.”\n“Yeah. And you can be proud of that. You forced a daughter of the Chiba to\nfight seriously.”\n“Oh… So you’re from the Chiba family?”\n“Actually, yeah. And Mari Watanabe is one of our pupils. She’s in the register\n—but I’m a master, and I know the secrets. So in pure sword skills, I’m better\nthan her.”",
  "page_146": "Sayaka smiled a little at that. A fleeting, carefree smile. “I see… Hey, this is a\nlittle selfish of me, but would you mind calling a stretcher? I kind of feel…a…\nlittle dizzy…”\nAfter those words came out, she collapsed to the floor. Erika carefully sat her\nbody up and held her. As she lay there unconscious, she whispered, “It’s all\nright. Your kind underclassman will accept the honor of carrying you.”\n“You want me to carry Mibu?”\nTatsuya asked the obvious question, but Erika nodded, not timid at all. “It’s\nokay! She’s not that heavy.”\n“That’s not the problem…”\n“You have a perfect reason for carrying a cute girl around. You should be\nhappy!”\n“That’s not something I would get happy about… Wait, no, that’s not the\nproblem, either…”\n“…You know, it’s occurred to me before. Tatsuya, are you not interested in\ngirls? You have those interests?”\n“Those as in what?”\n“Like, you’re gay?”\n“Of course not! Anyway, that’s not the problem.” Fighting a building sense of\nfutility, he attempted a logical explanation that Erika would have to understand\n—though at this point, he could feel himself growing resigned. “We could just\ncall for a stretcher. Why do I need to carry her?”\nMiyuki just giggled.\n“Because it would make Mibu happy, obviously.”\nTatsuya found himself suddenly unsure of how to respond. With her being so\nunreasonable with him, persuading her with logic would be difficult, to say the\nleast. In fact, he was at a loss for words.\n“Why not, Tatsuya?” prodded Miyuki. “It may not be a race against time, but",
  "page_147": "it cannot hurt to get her healed as soon as possible. I believe you carrying her\nthere would be the fastest solution. Besides, you’re making no progress here,\nare you? This is Erika we’re talking about.”\n“Hey, Mizuki, what was that supposed to mean?”\n“Sheesh, you’re right. Guess I have no choice.”\n“Hey, Tatsuya, what’s with the follow-up attack? Two-against-one is how\ncowards do things!”\n“Oh, my, and here I was trying to take your side, Erika.”\n“No way! Lies, all of it!”\nAs though the pleasant (?) conversation between the noisy, loud Erika and the\ncoolly reflecting Miyuki were his BGM, Tatsuya gently picked Sayaka up. He\nmade sure not to jolt her around and disturb her.\n“Huh. Yeah. You’re really something, Tatsuya.”\nHe didn’t know what Erika was so impressed with, but she nodded to herself a\nfew times. Getting involved with that would probably take a long time, so he\njust started walking.\nSayaka’s face, in its unconsciousness, resembled a state of sound sleep.\nAfter discovering via the monitoring function in his portable information\nterminal that the squad that had infiltrated the library had been captured, the\ncaptain of the boys’ kendo team, Tsukasa, knew that the next step would be to\ncontact the leader of Blanche in Japan, his older brother, and ask for further\ninstructions. And as quickly as possible.\nHe was his older brother from another marriage, so they were stepbrothers,\nbut right now he trusted him more than his actual parents.\nHe felt like he hadn’t been happy at all with the second marriage, but at some\npoint he’d come to and realized he was fine with it.\nDirectly after trying to consciously think about when that happened, his\nthoughts vanished into white noise. He realized he was spacing out for a",
  "page_148": "moment (in internal time, at least), then shook his head, telling himself this\nwasn’t the time or the place. It was too dangerous to use wireless\ncommunications on school grounds. They wouldn’t be monitoring it or\nanything, so there shouldn’t be anything about sending a normal message that\nneeded to bother him, but this was an emergency situation. He’d be safer\nassuming all transmissions outside the school, whether through landlines or\nnot, would be under observation.\nTsukasa hadn’t thought leaving school would present an issue. Despite it\nbeing an emergency, it wasn’t as though the country were at war, with itself or\notherwise. There would be no gun fighting when he stepped out of school.\nThey’d be strictly checking any outsiders before they entered, but they wouldn’t\nobstruct a student from returning home.\nOr so he’d determined—but unfortunately, he found his expectations\nbetrayed.\n“Is that Tsukasa from the kendo club? Goin’ home already?”\nAs he was going to the main school gate openly, so as to not draw suspicion, a\nvoice stopped him from behind. It wasn’t a friend of his, but he did know the\nperson. He turned around to see another senior standing there—one for whom\nthe expression “scraggy” fit like a glove. The person wasn’t tall, but he had a\nsolid physique, all muscle and no fat.\nOn his arm was a disciplinary officer arm band. “Tatsumi… Well, with\neverything that’s happening, clubs are canceled for today, right? I thought I’d\nget myself on home.” Appearing agitated would be careless and foolish,\nTsukasa told himself, managing to respond in a calm voice.\n“Right. Well, that’s true. It really isn’t a good time for club activities, is it?”\n“Yeah, you’re right. I’ll see you…” later. Tsukasa didn’t get a chance to say the\nrest of it.\n“Oh, one second. There’s something I want to ask.”\nHis heart leaped into his throat. “Me?” he replied, somehow hiding his\nsurprise and making the best confused look that he could.\n“Yeah, you, Tsukasa.” Tatsumi’s voice made Tsukasa more anxious. He felt like",
  "page_149": "his tone implied that he knew everything. “Our chairwoman has this really\nunenviable skill, you see,” he began, seemingly without any context—though it\ndid nothing to lessen Tsukasa’s caution. “She can use air currents to combine all\nsorts of fragrances. One of the things she can make is a truth serum, without\neven using anything illegal.”\nTsukasa desperately bit back a shriek that was dangerously close to coming\nout. It was futile, though.\n“You don’t need to pretend everything’s fine, Tsukasa. You know it as well as I\ndo. Word’s out—word that you’re the one who guided them here.”\nWithout another word, Tsukasa spun on his heel.\nHe might have been a Course 2 student lacking in magical ability, but perhaps\nas a result of his kendo training, he was confident with high-speed-movement\nmagic. Though Tatsumi looked slow-witted, he was the best speed fighter\namong the seniors—but in a long-distance race, Tsukasa should have had an\nadvantage.\nSo he thought, but his plan was ruined before he even took a second step.\n“Tsukasa! I’m going to have to ask you to come with me, sir!”\nAn annoyingly assertive voice—or, more accurately, the voice’s owner—\nstepped in front of him to block his way.\n“Sawaki… Why are you two all the way out here?” His voice rose in a groan.\nAll the commotion was happening in front of the library. Why would the\ndisciplinary committee’s big guns be here, of all places? It wasn’t strange for\nTsukasa to wonder about that.\n“You didn’t notice? We’ve been watching you all day. We got some help from\na certain person who has remote viewing abilities. You didn’t give yourself away\nat all, so we thought maybe we were wrong, but in the end, we saw you trying\nto run away.”\nAs Tsukasa listened to Tatsumi talk happily behind him, he decided to force\nhis way through. He’d have to go through Sawaki. With the situation he was in,\ngoing back on campus would be suicidal. But though Sawaki was only a\nsophomore, he was the school ace of magic martial arts, the term for magic-",
  "page_150": "based close combat. Without a weapon, Tsukasa didn’t stand a chance—at\nleast, not in a fair fight.\nTsukasa pulled out the wristband around his right hand. Under it was a thin,\nnarrow bracelet of brass—an antinite bracelet. He triggered its Cast Jamming.\nHe knew that scattering jamming waves with the two of them there was the\nsame as declaring he was their ally. But he couldn’t afford to think past this\nsituation right now. He needed to cut his way through this disaster and contact\nhis brother. This was the somewhat obsessive, unreasonable thought that\ncontrolled his actions.\nSawaki grimaced as Tsukasa turned to him and charged. Magic martial arts\nwere purely magical techniques to supplement one’s physical body and grant\npowerful combat abilities. In a situation where he couldn’t use magic, then even\nwithout a weapon, Tsukasa’s skills as a kendo practitioner, which weren’t based\nin magic at all, should have prevailed. That’s what he believed as he attacked\nSawaki with a bare-handed chop.\nIt was easily parried. There was a hard impact to his side—Sawaki’s elbow was\nburied in his abdomen. He crumpled to the ground.\n“You misunderstand, Tsukasa,” said Tatsumi lowly and sympathetically as he\nlooked down at him. “Sawaki’s way above average even without magic. A lot of\npeople make that mistake. But when you think about it, unless you can perform\nwithout magic, you won’t be able to do much just by layering magic on top.”\nTsukasa moaned in pain, unable to reply. Sawaki silently tied him up.\nIn the nurse’s office, Sayaka’s questioning began.\nHer right arm was still healing, and at first the school doctor tried to stop\nthem from exciting her too much, but Sayaka had wanted to talk about\neverything now.\nThe student leaders of the school were all present at the questioning—\nMayumi, Mari, and Katsuto. Kinoe Tsukasa, believed to be the mastermind, had\nbeen arrested, and the mayhem outside had, for the most part, calmed down,\nbut they still didn’t know any of the specifics. The outside invaders had been",
  "page_151": "arrested and were being watched over by the faculty, who were going to give\nthem over to the police. The student council president, club committee\nchairman, and disciplinary committee chairwoman, in their positions as\nstudents, couldn’t get involved. On the other hand, Tsukasa wasn’t yet in a\nstate where he could be interrogated. Given the fact that their only source of\ninformation at the moment was being able to ask for details about the incident\nfrom Sayaka, it wasn’t strange that the three of them had all gathered here.\nSayaka’s story began from when she was drawn into her allies’ circle.\nAbout how last year, she had been spoken to by Tsukasa almost immediately\nafter enrolling. About how the kendo club already had more than a few\nmembers who sympathized with Tsukasa at the time. About how it wasn’t just\nthe kendo club—they were holding thought education posing as an\nautonomous student magic practice circle. They had built up a foothold from\ninside First High over a longer span of time than the administration had\nimagined, and that fact surprised Mayumi and the others.\nThe one most shocked by Sayaka’s story must have been Mari. She was\nshocked by something different from Mayumi and Katsuto, though.\n“Sorry, I don’t really have a clue…” Erika shot a thorny stare at the bewildered\nMari, but she didn’t have the mental leeway at the moment to notice it. “Is that\ntrue, Mibu?” she asked, confusion pouring from her voice.\nSayaka looked down, but not for more than a second. When she brought her\nface back up, she nodded, looking deflated. Then she replied in an equally\ndeflated tone, “Now that I think about it, I was probably letting my title of\nkendo belle from middle school go to my head. So when I saw Watanabe’s\nbrilliant magic sword skills during an exhibition they put on to draw in new\nkenjutsu club members and asked you for instruction, it was a big shock how\ncoldly you treated me… I figured you hadn’t listened to me because I was a\nCourse 2 student, and I got really down.”\n“Wait… Wait a second. The recruitment week last year, right? When I was\nroasting those rash people in the kenjutsu club? I remember that. I didn’t forget\nabout how you asked me to be your practice partner. I didn’t treat you coldly or\nanything, though,” she said, cocking her head in real confusion.",
  "page_152": "“People who say hurtful things don’t usually know they’re doing it, you\nknow,” objected Erika, her voice cynical.\nTatsuya stopped her, though. “Erika, be quiet for a moment.”\n“What? You’re gonna take her side, is that it?”\n“I said just be quiet for a moment. We can listen to comments and criticisms\nafter her story is over.”\nErika made a glum face at having had the door slammed in her face, but\nquieted down nonetheless.\nAfter a brief silence, Sayaka, who seemed like she was struggling, argued,\n“You said I wouldn’t even be a match for you, and that I should find someone\nwho would be better for me… And to be told that by an upperclassman I looked\nup to right after entering high school, it was just…”\n“Wait… No, wait. You misunderstood, Mibu.”\n“Huh?”\n“If I recall correctly, this is what I said: ‘I’m sorry, but with my skills, I can’t\npossibly be a match for you. I would just be wasting your time. You should\npractice with someone who can match your skills.’ …Am I wrong?”\n“Uh, well… Now…now that I think of it…”\n“Besides, I would never tell you that you were no match for me. Your sword\nskills have always been better, ever since then.”\nSayaka just stared at her with a vacant expression. Meanwhile, Mayumi asked\nMari a question. “Wait a second, Mari. Then you declined to be Mibu’s partner\nbecause she was stronger?”\n“That’s right. I might be better if we let magic into the argument, but…my\nsword skills are built around the principle of using them together with magic.\nThey deal with how to move your body and use your weapon in a way that\nmaximizes how effective your magic is. There’s no reason I could match Mibu,\ntrained purely in the way of the sword.”\n“Then…that was all…a misunderstanding on my part…?”",
  "page_153": "An uncomfortable silence crept into the nurse’s office and slowly expanded.\n“I must…I must seem like an idiot… I misunderstood you…and looked down on\nmyself…and hated you for it… I let a whole year go to waste…”\nOnly Sayaka’s sobbing could be heard.\nTatsuya was the one to break the silence. “I don’t believe that it was a waste.”\n“…Shiba?”\nHe peered straight into her eyes as she brought her face up, then continued,\nhis voice polite and understanding. “When Erika saw your skills, she said this:\nthat the kendo belle she knew, who won second place in the middle school\nnationals, was so much stronger she was like a different person. Strength\ngained from hatred and bitterness may be a sad form of power, but they’re\nyour own skills that you acquired yourself, and no one else. You weren’t\nobsessed with your bitterness, and you didn’t lose yourself to lamentation. This\nyear, you’ve greatly polished your skills of your own accord, so I believe it this\nyear wasn’t a waste at all.”\n“……”\n“There are many different opportunities for people to become strong. You\ncan’t count the reasons for hard work in the hundreds or thousands. I think you\nonly let the days of effort go to waste when you reject the effort, the time, and\nthe results.”\n“Shiba…” Sayaka’s eyes, looking up at Tatsuya, were flooded with tears. But\nbehind them, she smiled. “Shiba, I have a request.”\n“What is it?”\n“Could you come a little closer?”\n“…Like this?”\n“One more step.”\n“All right…”\nThe mood changed to one of relief.\nBut that…",
  "page_154": "“Okay, now please…”\n…soon changed…\n“…don’t move from there.”\n…to one of surprise when Sayaka grasped Tatsuya’s clothes tightly and buried\nher face in his chest and began to sob. Her sobbing quickly transformed as,\nclinging to his chest, she began to cry loudly.\nAs everyone present exchanged shaken glances, Tatsuya silently put her\nhands on her slender shoulders. Miyuki saw this and lowered her eyes.\nAfter finally regaining her calm, Sayaka was able to speak regarding Blanche,\nthe organization backing the coalition.\n“It’s just as you thought, Tatsuya,” noted Miyuki.\n“It was such a likely option that it’s not interesting at all…”\n“That’s how reality is, Chairwoman. The problem now is…” The conversation\nwas about to be derailed, but Tatsuya got it back on track with an especially\nuninteresting precept. “Where are they right now?” he said, as though their\nfuture course of action had already been decided.\n“…Tatsuya, do you actually plan on having a battle with them?” asked\nMayumi hesitantly.\n“I don’t believe that would be the right way to put it. I’m not going to have a\nbattle with them—I’m going to crush them,” said Tatsuya simply, nodding and\nadding to how extreme he was being.\nMari was the one to immediately protest. “It’s too dangerous! This is way out\nof the league of a student!” She was always on the front lines when it came to\ndealing with problems, albeit school-related ones, but it was essentially a\nmatter of course that she’d be sensitive to the danger.\n“I’m against it as well. We should leave incidents not related to school to the\npolice,” said Mayumi, shaking her head, also with a strict expression. However…\n“Then do you plan on sending Mibu to family court for attempted robbery?”\nTheir faces stiffened up at his words—they were at a loss.",
  "page_155": "“I see. Police intervention wouldn’t be the best thing,” said Katsuto. But we\ncan’t just leave them be. They might cause a similar incident in the future. But\nknow this, Shiba.” His glaring eyes pierced Tatsuya’s own. “These are terrorists.\nYour life could be at risk should you be careless. Neither Saegusa, nor\nWatanabe, nor I can order a student of this school to put their life on the line.”\n“No, of course you can’t,” answered Tatsuya fluidly in the face of his stare. “I\nnever planned on asking the disciplinary or club committees to help me in the\nfirst place.”\n“…You want to go alone?”\n“I would, if at all possible.”\n“I will come,” came the voice of his little sister without a moment’s delay,\ncausing a dry grin to come over his face.\n“I’m coming, too!”\n“And me.”\nErika and Leo both expressed their own wishes to participate.\n“Shiba, if you’re doing this for me, then please, can’t you stop this?” said\nSayaka hastily, trying to stop them. “Why don’t we leave it to the police like the\npresident said? I’ll be fine. I did something wrong, and I should be punished. If\nanything were to happen to any of you, I wouldn’t be able to live with myself.”\nTatsuya turned back with an expression unsuitable for answering the girl’s\nsincerity. “I’m not doing this for you, Mibu,” he said coldly and pointedly.\nSayaka quieted, her face betraying her shock. “My living space has become a\ntarget for terrorism. I’m already a related party. I will eliminate everything that\ntries to harm Miyuki’s and my daily lives. This is, for me, of the utmost\nimportance.”\nHe wasn’t pretending to be the evil one so that Sayaka wouldn’t have to feel\nany burden, either. Even those who didn’t know him as well as Miyuki—Leo,\nErika, Mayumi, and Mari—all grasped what he was really saying.\nHis gaze, like a glistening sword, made them understand.\nIt wasn’t anger or a desire for battle—it was Tatsuya’s confidence, or perhaps",
  "page_156": "his determination, to speak of a future in which the terrorist threat had already\nbeen eliminated. Even Katsuto found himself unable to speak.\n“But Tatsuya, how will we pinpoint Blanche’s location?” asked Miyuki amid\nthe silence. “I am sure they have vacated the temporary position Mibu knows\nof, and it doesn’t seem that they have left any substantial clues.” Only she\nspoke to her brother like she normally would.\n“You’re right. That goes for Tsukasa, too. Though it’s not necessarily that they\ndidn’t leave clues—more like they never placed any to begin with.”\n“Then…?” prompted Miyuki, interested in why her brother didn’t seem\nperplexed at all, despite saying they had nothing to go on.\n“If we don’t know something, we just need to ask someone who does.”\n“…Someone knows?”\n“Anyone in mind, Tatsuya?”\nTatsuya shrugged off Erika’s and Leo’s questions and remained silent as the\ndoor to the room opened.\n“Miss Ono?” said Mayumi.\nIn through the door came Haruka, giving a vaguely worried smile and wearing\na pantsuit. “…I suppose I was naive to think I could completely conceal myself\nfrom Yakumo’s treasured student…” she remarked openly, referring to Tatsuya,\ngrinning drily.\nHe kept his face expressionless, but his voice in reply was subtly amazed. “You\nweren’t trying to hide yourself at all. If you keep lying like that, ma’am, soon we\nwon’t even know how you really feel.”\n“I’ll be more careful.” Tatsuya invited her over and Haruka approached the\nbedside. She crouched down and locked eyes with Sayaka, who was sitting in\nbed. “It looks like you’ll be all right.”\n“Miss Ono…”\n“I’m sorry I couldn’t help you.” Sayaka shook her head at that. Haruka placed\na hand on her shoulder, then stared intently into her eyes for a few moments\nbefore retreating from the bed.",
  "page_157": "“Wait. You know where these Blanche guys are, Haru?”\nOne might have expected the person who spoke to have said, “Who are you?”\nThat didn’t happen. Instead there came an unusual nickname Tatsuya had never\nheard that didn’t fit the speaker at all.\n“‘Haru’?”\n“Huh? Tatsuya, you didn’t know?”\nHe probably thought it was a natural question, but upon being asked about it,\nTatsuya faltered for a moment, unsure of how to reply.\n“Everyone in class calls her that, ya know. Haru says she doesn’t mind,\neither!”\n“Not everyone! Only some of the boys in class call her that. Don’t let him fool\nyou, Tatsuya!”\n“R-right…” The tension in the air lessened completely at this unexpected skit.\nBut then he thought this might be better than people getting too tense for no\ngood reason—of course, that was probably just so he could convince himself.\n“—Anyway, Miss Ono—”\n“You can call me Haru, too.”\n“—Miss Ono, ma’am. Now that we’re out of options, you can’t feign\nignorance anymore, can you?”\n“You’re no fun.”\n“……”\n“…Ahem.” Perhaps thinking her blank stare at Tatsuya unskillful now matter\nhow one looked at it, she cleared her throat—this, too, was acted more than\ndone seriously—and she adjusted her position. “Could you take out a map?\nThat would be faster.”\nTatsuya silently brought out his information terminal. He unfolded the screen\nand called up his map application. Haruka took her terminal out as well, one\nquite a bit more dainty and stylish than his own, and turned on its light\ncommunication function.",
  "page_158": "His map booted up and displayed a marker at the position it had been sent\nfrom hers.\n“…That’s basically right across town!”\n“…Are they making fun of us?”\nAs implied from Leo’s and Erika’s indignant responses, it wouldn’t even take\nan hour to walk there.\nTatsuya magnified the map and changed the information display. The marker\nindicated an abandoned bio-fuel factory built in a hilly area on the outskirts of\ntown.\n“…The factory was abandoned after it was discovered to be a front for\nenvironmental terrorists and they ran away overnight,” he read aloud from the\nattached data.\n“So they came crawling back while the authorities wouldn’t realize it?”\n“Meaning the groups are related?” Mari had phrased it as a question, but he\ncould tell from her expression that she felt the same as Mayumi.\n“If they left it as it was, then I suppose they didn’t bring any deadly poisons\nwith them,” noted Katsuto.\n“Yes. Our own investigations have not turned up any biochemical weapons,”\nnodded Haruka.\n“A car would be faster.”\n“Will we be detected with magic?”\n“We’d be detected anyway. They’re waiting for us to come to them, after all.”\nTatsuya hadn’t said he was a related party just because he was enrolled at the\nattacked First High. The terrorists had attempted to steal private magic\ntechnology. That meant they must have been after his own techniques, too.\nKinoe Tsukasa attacking him was probably a test to gauge how effective they\nwere. That was Tatsuya’s reasoning.\n“Straight in through the front door?”\n“That would be the best way to catch them off-guard.”",
  "page_159": "Tatsuya was one thing, but even Miyuki spoke belligerently, as though it came\nnaturally to her, as they decided on their plan of attack.\nKatsuto indicated his agreement with them. “Yes, that’s an appropriate plan.\nI’ll provide the car.”\n“Huh? Juumonji, are you going, too?” asked Mayumi—Tatsuya had been\nthinking the same thing.\nKatsuto didn’t look like the sort to stand on the front lines alone and not let\nsubordinates participate. “As a member of the Juumonji, one of the Ten Master\nClans, it is my natural duty. But above that, I cannot close my eyes to this\nsituation as a student of First High. I can’t leave everything to the\nunderclassmen.”\n“…Then—”\n“Saegusa, you’re not going.”\n“Mayumi, the student council president needs to be here right now.”\n“…All right, fine,” she said, nodding grudgingly to the two-pronged\npersuasion. “But you can’t leave either, Mari. There might still be remnants in\nthe school. What will we do if the disciplinary chairwoman isn’t here?”\nThis time it was Mari’s turn to nod grudgingly.\nAfter watching the two female students’ staring contest (?) Katsuto looked at\nTatsuya. “Shiba, are you going now? It may turn into a night battle at this rate.”\n“It won’t take that much time. I’ll wrap things up before the sun sets.”\n“I see.” Perhaps he felt something from Tatsuya’s attitude then, because\nKatsuto didn’t ask any more than that. He simply said, “I’ll get the car,” and left\nthe nurse’s office.\n“I know the chairman and president are from the Ten Master Clans…but who\nis Haru, anyway?” asked Leo, though everyone else had intentionally avoided\nasking it.\nTatsuya shelved the question. “We’ll talk about that later. Let’s go!” Then he\nleft the nurse’s office behind, with Miyuki, then Leo and Erika in his wake.",
  "page_160": "The car was a large off-roader, and in its passenger seat was an additional\nmember of their team.\n“Yo, my man, Shiba!”\n“Kirihara…”\n“Man, you never get surprised.”\n“…No, I’m actually quite surprised.” At how you referred to me, he thought,\nthinking better than saying it.\n“Anyway, my man, I’m gettin’ in on this, too.”\n“Go right ahead.”\nTatsuya had no idea what was going through Kirihara’s mind to make him\nsuggest any of this, but there was no time to press him with questions. He just\ngot into the off-roader, followed by his little sister and friends.",
  "page_161": "The world was painted in a madder red.\nThe big off-roader sprinted down the road, reflecting the evening sun from its\nbody.\nAnd then it smashed through the closed gates to the factory.\n“Thanks a bunch, Leo!”\n“…That… That was nothing.”\n“Ha-ha, you’re wiped out!”\nThey had demanded high-level magic from Leo, such as suddenly hardening\nthe entire big vehicle plowing down the bad road at over a hundred kilometers\nper hour at the exact moment of impact. He was considerably exhausted from\nthe immense drain on his concentration.\n“Shiba, this is your plan. You give the orders,” said Katsuto, handing the reins\nand the responsibility to Tatsuya.\nHe nodded without a second’s pause. “Leo, you stay here and secure our exit.\nErika, you help Leo and take care of anyone trying to escape.”\n“Shouldn’t we, like, capture them?”\n“No need for more risks than necessary. Keep yourself safe and deal with\nthem. Chairman, please take Kirihara and go around the left side of the building\nto the back entrance. Miyuki and I will walk in this way.”\n“All right.”\n“Sure, whatever. I’ll slice up any rats who think they can get away.”\n“Tatsuya, be careful,” said Leo.\n“Don’t do anything crazy, Miyuki!” urged Erika.\nBoth of them, ordered to stay behind, didn’t complain about any unfairness.",
  "page_162": "Kirihara, brandishing his naked katana—though it had no edge—ran off, and\nKatsuto calmly went after him.\nTatsuya and Miyuki proceeded into the dimly lit factory casually, as though\nwalking into a hypermarket.\nTheir encounter happened surprisingly early.\nThat was because Tatsuya had been advancing without a mind to securing\ncover, and the enemy had lined up on the floor of the hall-like room without\nconcealing themselves.\n“Welcome, and so nice to meet you,” said one man, spreading his arms\ntheatrically and bowing in welcome. “Tatsuya Shiba! And the lovely lady must\nbe Miyuki Shiba, no?”\n“Are you Blanche’s leader?” asked Tatsuya indifferently. The man’s age must\nhave been around thirty—younger than he’d expected. With his gangly build\nand rimless decorative glasses, he gave the appearance of a scholar or lawyer.\n“Oh, yes, how rude of me. As you say, I am the leader of Blanche’s Japanese\ndivision, Hajime Tsukasa.”\nTatsuya didn’t feel any intimidation from him. The impression he entertained\nof the man, prejudiced though it may have been, was that of the common\nintellectual and fashionable revolutionary—big-headed and a failure.\nBut behind his exaggerated, narcissistic tone and gestures, there was a dark\nabyss peeking out. The thick madness Tatsuya glimpsed in it was something\nhe’d expect the leader of a terrorist organization who fooled around with\npeople’s minds and lives to have.\n“I see.” Despite being aware of the man’s insanity, though, Tatsuya’s face\nremained stone cold. Hell and purgatory were no more than close friends of his.\nHe didn’t bother asking after his relationship with the kendo club captain, Kinoe\nTsukasa. He just said two words and nodded.\nHe displayed his intent with his actions, not his words. He pulled the silver\nCAD from his shoulder holster.",
  "page_163": "“Hmm, a CAD. I figured you would at least bring a handgun with you. Very\nbold, very bold for you to come in here so openly. You may be a magician, but\nyou will die if shot with a gun, you know.”\n“I am not a magician.”\nBlanche’s leader opened his eyes wide with affectation at the unexpected\nresponse from the one he’d threatened to shoot. “Oh, I see. You are still a\nstudent! You seemed so very brazen I had nearly forgotten.”\n“You like to talk, do you? I suppose that’s the selling point for an agitator.”\n“You’re so young, and yet so strict. Is it not stiff, not uncomfortable to have\nsuch keen viewpoints from such a young age? At this rate, you’ll suffocate on\nthem before long.” His tone and gestures were theatrical. His statement was\nself-absorbed.\nBut Tatsuya didn’t feel like going along with Hajime Tsukasa’s clown\nperformance. “I will give you the option to surrender. Lay down your weapons\nand place your hands behind your head.”\n“Ha-ha-ha-ha-ha! Weren’t you a Weed? Bad at magic? Oh, I do apologize—\nthat is a discriminatory term. But what do you still draw confidence from? If you\nthink magic is some sort of absolute power, you’re making a big mistake.” With\na bout of loud laughter to make his lunacy even more pronounced, Hajime\nTsukasa raised his right hand.\nThe members of Blanche lined up on either side of him, numbering over\ntwenty, and all raised their firearms. Handguns weren’t their only weapons—\nsome even held submachine guns and assault rifles.\n“Negotiations must be fair, so I will grant you the opportunity as well. Become\nour comrade, Tatsuya Shiba. My little brother told me about your Cast Jamming\nthat doesn’t require antinite, and I am extremely interested in it. This operation\nhas us all working overtime. Just training ignorant students so we can use them\ntakes quite a bit of time and money. It is truly and annoyingly difficult to forgive\nyou for letting it all go to naught, but if you become our comrade, everything\nwill be water under the bridge.”\nThe thin smile on his face, the insanity disguised as sanity in his eyes—they",
  "page_164": "would have struck fear into their target’s heart were it not Tatsuya. If he hadn’t\nbeen with Miyuki, she, too, would definitely have at least gotten goose bumps.\n“So that’s what you’re after. You used Mibu to contact me and your brother\nto attack me, all to investigate that Cast Jamming imitation?”\n“My, my, you are a smart child. How insightful. But you are still only a child—\nyou understood all that and still came wandering in here. Having said that,\nchildren are stubborn creatures. They don’t listen to what you tell them, even if\nthey have zero chance of winning.”\n“What would you do in that case?”\n“Let’s see… How about this?”\nHe made a gesture that looked more like that of a street magician than a\nscholar.\nTatsuya’s already-mostly-empty expression disappeared from his face as,\nseeming exhausted, he dropped the hand holding his CAD.\n“Ha-ha-ha-ha-ha! You are already our comrade!”\nHajime Tsukasa stopped hiding his inner insanity, and he no longer evoked\nawe and respect—but he was equipped with a sort of charisma.\n“Then for starters, why don’t you put an end to your sister, with whom you\nwalked here? She would want her beloved brother to be the one to do it!”\nHis commanding tone was not hastily prepared—he was quite familiar with\nusing it.\nIn the past, he’d probably gotten many to obey him.\nThat twisted smile, that expression certain of his own authority.\n“…Quit it with this monkey show. I’m too embarrassed to even watch.”\nBut that expression froze the instant Tatsuya delivered his cold insult.\n“Evil Eye, a type of outer magic that interferes with awareness. Or so it’s\nnicknamed. It actually flashes patterns of light signals with hypnotic properties\nmore quickly than humans can perceive them, giving them a direction and\nprojecting them onto the person’s retina—light-wave vibration magic. A simple",
  "page_165": "hypnotic trick derived from brainwashing concepts, possible to create even with\na video player. Because it can be performed without any grandiose machines,\nyou can catch an opponent off-guard with it—but that’s all it really is. If I recall\ncorrectly, it’s a trick zealously researched in Belarus before the formation of the\nFederal Soviet Republics.”\nTatsuya froze his enemy—not with magic, but with words.\n“Was this what you used to substitute Mibu’s memories, too?”\n“Tatsuya, you mean…?” Miyuki’s eyes were already wide, but she opened\nthem wider in surprise.\nHe nodded, still expressionless. “Mibu’s mistaken memory was so extreme it\nverged on unnatural. You do get shaken up after mishearing something like\nthat, and sometimes people do fall into such an extreme misunderstanding. But\nnormally, that cools down as time passes.”\n“…This… This trash.” Wrath surged from Miyuki’s noble lips.\nPerhaps its heat thawed the man. “…You, how…” he groaned, appearing to\nstruggle. He wasn’t smiling madly. Now that the madness had withdrawn, all\nthat was left was a slender, intellectual leader accustomed only to giving orders,\nnever to getting his own hands dirty.\n“You’re a boring one.” Tatsuya wasn’t bothering to hide his contempt any\nlonger. “Drawing my attention to your right hand as you took your glasses off,\naverting it from the CAD you used in your left hand… You think a parlor trick will\nwork on me? I can tell what sort of magic you’re casting by looking at the\nactivation program, and I can deal with it. That shoddy magic you used? I only\nneeded to delete part of the activation program. Without the parts describing\nthe all-important hypnosis pattern, Evil Eye just becomes a series of lights.”\nHe had no interest in exposed street magicians.\n“Impossible… How…how can you… You bastard…”\n“And you were speaking so politely before. It looks like your regal skin has\npeeled away.”\nIt was then that Hajime Tsukasa finally figured it out.",
  "page_166": "This boy, when his expression went away—when he looked exhausted—it\nwas because he had observed and nullified his spell and calculated he could\nconsign Hajime to oblivion with certainty. The boy in front of him had never\nseen Hajime as another human, right from the beginning. He hadn’t viewed him\nas human. His face, his name, his traits, his intentions—Hajime instinctively\nunderstood none of those had any meaning for the boy. They were nothing\nmore than simple enemies to him. Obstacles. And now, by establishing his\nmeans of elimination, they weren’t even obstacles anymore.\n“F-fire, open fire!” He no longer had the leeway to keep up his appearance of\ndignity. His comrades—no, his subordinates—looked at him with misgivings,\nbut he didn’t have the leeway to notice them, either. He had been taken by a\nprimordial, animallike fear as he ordered them to shoot the boy.\nHowever…\n“Wh-wha…”\n“What is this? What happened?”\n…not a single bullet fired.\nPanic spread throughout the room. On the floor were the scattered,\ndismantled remains of handguns, submachine guns, and assault rifles. When\nthe men had tried to pull the trigger, their weapons had reverted to their\ncomponent parts.\nAnd amid the panic, without attempting to quell it, Hajime Tsukasa ran away.\nHe completely ignored those at his back—his allies.\n“Tatsuya, please chase him. I will handle this.”\n“All right.” Tatsuya started walking toward the hallway farther in. The men\nnaturally made way for him. Without doing anything, he arrived at the passage\nHajime Tsukasa had run down. If they let him through like this, all that would\nneed to happen was for the remaining Blanche members to be arrested.\nBut one of the members leaped for Tatsuya’s back, a knife in his hand.\nOr at least, he tried to. “Fool.” Miyuki’s sweet tones would normally prompt\nno end of fascination in others, but now they carried with them judgment",
  "page_167": "without hope.\n“Don’t go too far. No need to dirty your hands with the likes of them.”\n“Yes, Tatsuya.”\nBetween the siblings as they exchanged words, there was a carved statue\ncovered head to toe in frost, which had tipped over and was falling to the floor.\nOnly one attempted to bring harm to her brother. The fool was already frozen\nsolid.\nFor her, that alone was sufficient, and yet that alone was also insufficient.\nThe reason had been enough. The result had not.\nThe men before the single slender girl, numbering in the double digits, could\nno longer take a step. Their frozen legs could not move forward or retreat\nbackward. Both mentally and physically.\nThe entire floor was shrouded with frost. Only within a small circle\nsurrounding the girl was it the same season as it was outside.\nThe white rime swirled. The frost was creating cold. She brought up her right\nhand. Her form—the realization of an ice queen delivering judgment upon the\ndeceased.\n“You are unfortunate.”\nHer tone was different from normal. But her wording—her commanding,\njudging, authoritative expression—was not strange in the slightest.\n“Had you not attempted to interfere with my brother, you would only have\nneeded to suffer minor pain.”\nThe cold slowly, steadily, crawled upward. Cold to dig into the cores of their\nbodies. Their faces blanched in dread and despair.\n“I am not as benevolent as my brother.”\nThe white frost had climbed to their necks.\n“Now, pray—that you will at least keep your lives.”",
  "page_168": "When the cold reached the crowns of their heads, it immediately increased in\nseverity.\nThe vibration-deceleration wide-area magic, Niflheim.\nVoiceless death agonies writhed within the frost.\nNobody was there to ambush him.\nAt least he was smart enough not to split his forces, thought Tatsuya. There\nwas no point in sneak attacks against him—he could sense living presences.\nHiding would have been meaningless, too.\nThere would be eleven terrorists still waiting for him in the next room. Eleven\nsubmachine guns. From the other side of the wall, he pulled the trigger on his\nCAD. Physical barriers were no obstruction to magic. With one of the only two\nspells he could use freely, Dismantle, he overwrote the eidos in the submachine\nguns. Once again his ears were greeted by voices rising in dismay.\nHe was able to sense living presences. He was able to analyze not only magic\nprograms, but activation programs. But these were side effects of this spell and\none other.\nTo perceive an object’s construction, and to dismantle it.\nFor physical objects, he overwrote the construction’s information into a state\nin which it was dismantled into its component parts. For a body of information,\nhe just dismantled the information itself. It directly interfered with construction\ndata; it was a spell counted among the most difficult magic in existence.\nHe had possessed these abilities since birth, though not of his own volition, so\nhe couldn’t use other magic properties. He could only create mock-ups. Virtual\nfakes. His magic calculation region was entirely occupied by these two spells of\nthe highest level.\nBut right now, he didn’t need a myriad of magic, just one absolute power that\nwould bring him certain victory.\nThere were no weapons in his enemies’ hands anymore. When he set foot\ninto the deepest room in the building, he was not welcomed with bullets, but",
  "page_169": "rather vacant laughter and unintelligible noise.\n“How was that, Magician? This is real Cast Jamming!”\nThe lunatic darkness in his insane laughter that swallowed the minds of men\nwas no longer present. Hajime Tsukasa’s mad mirth was no more than the\nproduct of a bluff. Supporting his last-ditch effort was a bracelet of antinite,\nshining in brass on his right wrist. Rings of the same color adorned the fingers of\nthe other eleven men as well.\nAntinite was a military product whose production areas were extremely\nlimited. Some examples included part of the ancient Aztec Empire, part of the\nMayan nations, central Tibet, a portion of the Scottish highlands, and a part of\nthe Iranian Plateau. Only locations that once held ancient mountain civilizations\nyielded it. It was as though it was a man-made object only refined at high\nelevations.\nTatsuya muttered to himself, looking at the massive quantities of it they had\nprepared. “Your patron is the re-secession faction in Ukraine-Belarus, and their\nsponsor is the G.A.A.…” A shock passed through the room. How utterly boring,\nhe thought. Third-rate was too good a term to use for them. He honestly\ncouldn’t stand being near them any longer.\n“Do it! Magicians who can’t use magic are just brats!”\nEven fighting them would be a pain, so Tatsuya raised his right hand and\npulled the trigger on his CAD.\nIt wasn’t a gun. It didn’t fire anything like it, such as lasers or charged\nparticles, for which physical technology had yet to create miniaturized firing\nmethods.\nDespite that, the man in his line of fire collapsed, blood spurting from his\nthighs. From two spots—one in front, and one behind. The holes were small,\nlike they’d been stabbed with thin needles. They struck their nerve ganglia\ndirectly, piercing their femurs.\nTatsuya pulled the trigger again and again. The men fell one after another,\nblood bursting from their shoulders, from their legs. He was drilling holes with a\nmagic program that used his line of fire as a setting, dismantling every cellular",
  "page_170": "substance making up their flesh—their skin, muscles, nerves, fluids, and bones\n—at the molecular level.\nChanging just one part of an object or information… This, too, was a skill\nclassified as being of high difficulty by modern magic, but for Tatsuya’s magic\ncalculation, which compensated for his extremely limited abilities, it was no\ntrouble.\n“Why?!” How many times had this man said that already? He would get an\nanswer if he thought about it, but even counting would be ludicrous. “Why can\nyou use magic with Cast Jamming?!”\nCast Jamming was a kind of typeless magic that created psionic noise to\ninterfere with others executing magic. The composition of the noise created by\nthe antinite hindered the usage of magic programs. Tatsuya had dismantled\nthat composition and turned the noise into psionic ripples. Cast Jamming was\nan obstacle in the road to others’ magic programs, and Tatsuya could dismantle\nthe obstacle itself. That was really all it was.\nHajime Tsukasa was evidently a magician, given how he’d used Evil Eye, but\nhe didn’t even know this simple fact. At the moment, it was annoying to deal\nwith this man, even to put an end to him.\nThen, suddenly, the wall at Tatsuya’s back split open. There was a subtle,\nglittering, silver light—the diffuse reflection of steel being vibrated at a high\nspeed.\nVibration magic—it was the High-Frequency Blade.\n“Eeeee!” Hajime Tsukasa jumped away from the wall, flailing like he’d thrown\nout his back.\nSomeone marched into where he’d just been standing, and it was Takeaki\nKirihara. He must have come in through the back and literally carved out a path\nto get here.\n“Yo. You the one who got these guys?” There was no other possible\nexplanation. Before he could respond in the affirmative, Kirihara nodded a few\ntimes. “You really are somethin’, my man. What about this guy?” he asked,\npointing scornfully to the frightened man clinging to the wall.",
  "page_171": "“That’s Blanche’s leader, Hajime Tsukasa.”\n“So it’s him…?”\nThe change was instant. Even Tatsuya winced at the wrath Kirihara unleashed\nfrom his body.\n“So it’s you! You’re the one who cheated Mibu!”\n“Eeeeeeee!”\n“Mibu… It’s all your fault!”\n“Gyaaaaaaaaaaaaaah!”\nKirihara’s unsheathed katana sliced through Hajime Tsukasa’s right arm,\nwearing the brass bracelet, at the elbow.\nKatsuto showed up from the hole Kirihara had opened. He scowled. Then, in\nthe span of an instant, he used the CAD in his left hand. It was the same kind of\nmultipurpose CAD in the shape of a portable terminal that Miyuki used. There\nwas no time lag that could be detected with the five senses.",
  "page_173": "With the smell of burning flesh, the blood stopped, and so did the screams.\nHajime Tsukasa foamed at the mouth, had a bout of incontinence, and fainted.",
  "page_174": "Katsuto took over cleaning up afterward.\nWhat Tatsuya and the others had done had been excessive self-defense in a\ngood light…and assault or attempted homicide in a bad one—not to mention\ntheir unlicensed use of magic. The hands of the law never reached them,\nthough. The influence of the Ten Master Clans surpassed justice authorities.\nWhen countries learned talent in modern magic was controlled by inborn\nqualities, they schemed to strengthen the bloodlines themselves. It was a\nlogical consequence. For nations that only had enough power to research magic\nas a system, no matter where in the world they were, those schemes had been\ncarried out since before the time modern magic and supernatural abilities were\nconsidered separate things.\nJapan practiced it as well, of course. As a result, a new group was formed that\nwould reign over the world of magic in this country.\nThat group was the Ten Master Clans.\nThey were not yet a century old, so their hierarchy was still fluid and\nunsettled. But that was a problem for the Ten Master Clans to deal with among\nthemselves. A very tall fence had already been erected between the clans and\neveryone else.\nThere were the Hundred Families as well, who were seen as next on the\nladder below the Ten Master Clans and strengthened their bloodlines in the\nsame way. They, too, were across a gap so large they even admitted it\nthemselves.\nThe Ten Master Clans would never stand on the political stage. They would\nnot become outward-facing influences. In fact, they supported Japan on the\nfront lines using their magic powers as soldiers, police officers, and\nadministrative officials. In exchange for the abandonment of public influence,\nthey had gained an essentially inviolable power behind the scenes of politics.",
  "page_175": "That was the path this nation’s modern magic users had chosen.\nThe most influential families among the Ten Master Clans were currently the\nYotsuba and the Saegusa. Third in line were the Juumonji. If the heir to the\nJuumonji family was involved in an incident, normal police officers wouldn’t be\nable to participate.\nAfter the incident, Haruka was treated as though she were on a long-term\nbusiness trip. As though—for it was a pretense diverging from the truth.\nShe had yet to answer the question Leo had asked her. Though considering\nthe fact that First High didn’t bring in a replacement counselor, she might have\nhad plans on coming back at some point.\nAs part of the cleanup process, the door to the library’s special viewing room\n—the one Tatsuya had severed using Dismantle—was being reported as having\nbeen destroyed by the Blanche operatives. That way, the school wouldn’t have\nto follow up on a failure by key management. —Of course, the students hadn’t\nreported to the school that Tatsuya had cut down a composite-armored door by\nhimself, so they seemed to believe it at least half-seriously. The work being\ndone by the school was to conceal the fact that keys had been stolen from the\nstudents. Even the fact that First High students had been part of it had been\nswept under the rug.\nSayaka’s attempted spying, too, was treated as though it never happened due\nto adult circumstances.\nSayaka ended up in the hospital for a while. The fracture in the bone in her\nright arm wasn’t enough of an injury to be hospitalized for. But when they\nfound out Blanche’s leader had been using Evil Eye, a light-wave vibration spell,\nthe doctors wanted to keep her there for a while to make sure no effects from\nthe mind control were still present.\nTatsuya only went to visit her once while she was hospitalized, but Erika\nvisited frequently, and they became fast friends.\nKinoe Tsukasa, the captain of the boy’s kendo team, wasn’t charged with any\ncrimes, either. He had been under the effects of some very severe mind control.\nIt was reported he was taking a temporary absence rather than withdrawing",
  "page_176": "from school and was undergoing long-term treatment. He would probably end\nup leaving First High of his own volition, though. He had never really wanted to\nbe a magician, and his pushion radiation sensitivity wasn’t bad enough to hinder\neveryday life.\nThey’d discovered that Hajime Tsukasa had an eye on his ability to detect\nmagic and made him enroll at a magic high school so that he could find magic\nthat would prove useful to the organization. After his mind control wore off, he\nwould likely strive toward what he really wanted to do—probably kendo.\nTatsuya’s unique magic talents hadn’t been divulged to anyone beyond the\ncomrades who had gone with him to the abandoned factory. Mayumi and Mari\nhadn’t been told, either. The same went for his friends Mizuki, Honoka, and\nShizuku.\nMore accurately, Leo and Erika didn’t know about the most crucial part of it.\nTatsuya didn’t know what Katsuto had been thinking when he forbade\nKirihara to speak of it, but he was grateful for the act all the same.\nThe magic he had—right now, it couldn’t be public.\nOf course, Mayumi and Mari appeared to vaguely suspect something was up.\nMiyuki was depressed for a week afterward.\nOn the surface she was still the perfectly beautiful girl, but he’d seen her\nburying her face in her hands on sudden impulses.\n—Only at home, though.\nShe must have been under the impression that using Niflheim had been going\ntoo far.\nFortunately, since the members of Blanche had coincidentally gone into a\nform of cold sleep—because of the properties of magic, even the freezing of\ninternal parts of a body would happen in an instant, so no cell damage had been\ncaused—it seemed none of them had been physically injured beyond the point\nof recovery.\nWhen she was down, Tatsuya pampered her as much as she wanted, creating\na situation that wasn’t really funny but still had to be laughed at, where she",
  "page_177": "seemed to take longer to come out of her depression instead.\nAt school, Tatsuya went about his business as usual. The disciplinary\ncommittee and student council had been making him do random errands, but\nhe was finally well on the way to acquiring the quiet learning environment he’d\nenvisioned upon enrolling.\nAnd then May arrived.\nOn the day Sayaka was scheduled to be discharged, Tatsuya and Miyuki went\ntogether to celebrate at the hospital. (He decided to cancel his classes this\nmorning. The freedom they had in attending lectures was a big merit of learning\nfrom a terminal without a teacher to supervise.) When they got there…\n“Isn’t that Takeaki Kirihara?”\nTatsuya didn’t need to be told—he noticed him, too.\nSayaka had already changed out of her hospital robes and into normal\nclothing. She was surrounded by family and nurses in the entrance hall.\nKirihara was next to her, taking part in the friendly conversation inside the\nring of people. His face looked somehow abashed and just a little bit delighted.\n“They are quite close, aren’t they?” Miyuki noted.\nShe, of course, knew of the event that could have been called the beginning\nof everything—the incident in which the kenjutsu club had intervened in the\nkendo club’s demonstration.\nSeeing the main two concerned parties, Sayaka and Kirihara, acting so closely\nfelt a little strange.\n“I hear Kirihara’s been coming every day.”\n“You don’t say.”\nHe turned around to the voice coming at him without any previous notice.\nErika stood there, looking disappointed. “Gah. I guess you really can’t be\nsurprised.”\n“No, I certainly am. I had no idea Kirihara was such a sincere person.”",
  "page_178": "“Not that!”\nTatsuya knew. He was obviously redirecting the conversation. So when Erika\ngave him that sullen look, he just smiled it away.\n“Hmph! If you keep doing things in bad character like that, Saya’s gonna\ndump you, y’know.”\nTatsuya didn’t pay much attention to the dumping bit.\nHe wasn’t proud of it, but he had zero experience in being popular with girls.\nMore important—\n“Erika… When you say Saya, do you mean Mibu?”\nMiyuki was a step ahead of him in asking the question.\n“Hmm? Yeah, that’s right.”\n“…You seem pretty friendly with her already.”\n“Just leave it to me!”\nTatsuya almost blurted out Leave what to you? He decided that would just\nmake this chaotic conversation even worse, so he stopped himself and\nswallowed his words. He’d come here for a hospital visit first and foremost.\nLeading Miyuki and Erika behind him—though he wasn’t quite sure whether\nErika was following like she should have been, but that was a needless anxiety\non his part no matter how he looked at it—he spoke into the ring of people.\n“Mibu?”\n“Shiba! You came to see me?”\nShe made a slightly surprised face. As her expression bespoke of her not\nexpecting this, the emotion melted into happiness and Sayaka welcomed him\nwith a broad smile.\n—Next to her, Kirihara looked sullen for a moment. It was an amusing\ngesture, one of the spices of life.\n“Congratulations on being discharged.” Miyuki handed the bouquet she held\nin both hands to her. At first Tatsuya had wanted to follow modern custom and\nhave it delivered. Miyuki had been unusually firm in opposing the idea, though,",
  "page_179": "insisting that there was meaning in bringing these kinds of things personally. He\nhad backed down at her angry look and decided to yield.\nHer holding a bouquet made her look so good that she stood out in the usual\ncity streets because of it. But now that he’d seen Sayaka smile so happily upon\nreceiving the flowers, Tatsuya knew it had been worth it to do as his sister had\nsaid.\n“So you’re the Shiba I’ve heard so much about, then?”\nWhen Tatsuya had pulled away from the conversation between the girls—at\nthis point he was just nodding along with them—a man of the age where he’d\nbe in the prime of his life addressed him. He might have only been called by his\nlast name, but there was no mistaking the look he was giving. His body was lean\nand toned, and his posture without deviation. Were they the results of martial\narts training? His features, too, made him look like he was related to Sayaka.\n“My name is Yuuzou Mibu—I’m Sayaka’s father.”\n“Pleased to meet you. I’m Tatsuya Shiba.”\n“I’m his younger sister, Miyuki Shiba. Pleased to make your acquaintance.”\nMiyuki had been keen enough to notice Tatsuya exchanging introductions\nwith someone, and bowed politely from behind him. Her elegant mannerisms\nseemed to make him falter a bit, but he stiffened his expression almost\nimmediately, speaking to his training in martial arts.\nSayaka’s sword skills were probably handed down from her father.\n“Miyuki, could you look after Erika for me?” asked Tatsuya.\nMiyuki turned around just as Kirihara was finding himself cornered by Erika\ntalking to him. “Yes, Tatsuya. Please excuse me, monsieur.”\nHer usage of monsieur gave Sayaka’s father a start that he couldn’t conceal,\nbut he managed an acceptable response. Of course, both siblings pretended not\nto notice it.\nTatsuya turned back to face Sayaka’s father. The man understood that his\ngetting Miyuki out of the conversation was Tatsuya being considerate, so he\ndidn’t waste time with unnecessary prefaces.",
  "page_180": "“Shiba, I am grateful to you. My daughter is back on her feet because of you.”\n“I didn’t do anything, sir. My sister and Chiba are the ones who got through to\nher. And Chiba and Kirihara are the ones who stayed with her while she was\nhospitalized. I did nothing but coldly refuse her. You may resent me for it, but I\ndid nothing worthy of thanks.”\n“Refuse her? I couldn’t even do that. I knew my daughter was anxious over\nher magic not improving as quickly as she liked, and yet I still didn’t think it was\nan important problem. I was so caught up in my own measurement—that\nothers’ evaluation of one’s magical abilities are completely different from\nstrength in actual combat—that I didn’t really understand just how much my\ndaughter was worrying. In fact, I used how busy I was as an excuse. When she\nstarted associating with strange people, I didn’t stand up and face it. I’m a\nfailure of a father.\n“I heard from her a general idea of what happened. She told me she began to\ndoubt what she was doing after what you said to her, and it had been a long\ntime since that happened. She said it was like awakening from a nightmare. And\nshe was grateful to you. She said you saved her by telling her it wasn’t for\nnothing. I don’t know what she was referring to, but I do know that her\ngratitude was real.\n“So just let me say this—thank you.”\n“…I really didn’t do anything someone should thank me for, sir…”\nTatsuya shook his head slightly, a little uncomfortable. Sayaka’s father shook\nhis head. “…You’re just like Kazama said, aren’t you?”\nThat simple line was more than enough to take Tatsuya’s calm away. “…\nYou’re familiar with Major Kazama?”\n“I’m already retired from the service, but he’s a friend of mine from life in the\nbarracks. We’re the same age, too. I’m still in touch with him.”\nTatsuya understood from the man’s previous words that he was pretty closely\n“in touch” with the major. He had to have been. Kazama would never speak of\nTatsuya to a simple friend—even a close one.\n“I consider it divine providence that Sayaka became friends with you. I",
  "page_181": "honestly can’t thank you enough for that. I would have liked a man like you to\ncontinue supporting Sayaka in the future…”\n“…I’m not someone capable of supporting anyone like that.”\n“…We’ll leave it at that, then. Forget it—that was just an absurd request from\na foolish father. Of course, I haven’t told anyone, not even my daughter, what\nI’ve heard from Kazama, so you needn’t worry. I just wanted to tell you that\nyou’re someone capable of saving my daughter, and that you really did save her\nin the end. Really, thank you.”\nAfter he finished, he returned to where his wife was standing, without waiting\nfor a reply—without letting Tatsuya abase himself any further.\nHe gave a slight shake of his head to drive away the not-so-slight sense of\nagitation he felt, then went back to his sister and the others.\n“Oh, Shiba. What were you talking about with my dad?”\nSayaka addressed him immediately, as though he were a godsend, or like she\nwas trying to find any possible way out of her current situation. It looked like\nMiyuki couldn’t contain Erika by herself.\n“Someone who took care of me long ago was a friend of your father’s, and we\nwere talking about him.”\n“Huh, really?”\n“Yes, the world is a small place.”\n“I knew you and Saya were connected by fate!” Erika immediately involved\nherself in the conversation. She was on top of her game today, it seemed. “Hey,\nSaya, how come you switched from Tatsuya to Kirihara? Weren’t you in love\nwith Tatsuya?”\n“W-wait, Eri?” Sayaka got flustered, but Tatsuya was thinking of something a\nlittle different.\nJust “Eri,” huh… He speculated that they had quite an affinity for each other—\nas though it had nothing to do with him.\n“Erika, you’re getting a little carried away today.” Miyuki’s rebuke went in one\near and out the other. This was beyond the point of being “on top of her game.”",
  "page_182": "“If we’re just talking about looks, then I think Tatsuya’s got him beat.”\n“…You’re a really rude woman, you know that?”\n“Don’t worry about it, Kirihara! It’s not all about the face.”\n“…Seriously, you’re gonna make me cry!”\n“Whatever. So Saya, what was it? The sincerity? The kindness of awkward\nguys is pretty nice, huh?”\nSayaka’s face went red all the way up to her ears. She tried to look away, but\nErika would quickly move around her every time—probably using magic.\nEventually she looked down, seeming like she was about to cry.\n“Erika, maybe it’s time—” to give it a rest. Tatsuya was interrupted in the\nmiddle of the act, though.\n“Yeah…I think you’re right,” confessed Sayaka, beginning in a weak voice. Her\ninner turmoil must have reached its peak, her mental barriers crumbling. “I\nthink I was in love with Shiba…”\n“Whoa!” For some reason, the one most visibly surprised by this was Erika.\n“He had this unwavering strength that I admired. But at the same time, I think\nI was afraid of it.”\nMiyuki glanced at him in concern. Tatsuya responded with a subtle, dry grin.\nApparently his sister had taken to thinking his feelings could be easily hurt.\n“It wouldn’t matter how hard I ran, because I wouldn’t be able to catch up to\nhim. To become like him, I would have to keep on running forever. No matter\nhow long I did, I would never get that strong… It may be a rude way to put it\nsince Shiba helped me so much, but that’s what I felt like.”\n“…I think I get it. Tatsuya definitely does make people feel like that\nsometimes.”\n“As for Kirihara, well… The first time I really talked to him was when he came\nto visit me here. But I thought I could walk along at the same pace as him, even\nif we fought sometimes. I guess that’s why…”\n“…Yeah, yeah. You make a lovely couple.”",
  "page_183": "Tatsuya didn’t know if he agreed with Erika’s way of putting it, but on an\nemotional level they were of one mind. Back then, Sayaka hadn’t just been\npretending to be a cute girl—she really was one.\n“What about you, Kirihara? When did you start to like Saya?”\n“…Annoying brat. What does it matter, anyway? It’s none of your business.”\n“That’s right, Erika. It doesn’t matter when it started.” Tatsuya had been\nkeeping quiet until that. But now, having said something a little mean-spirited,\nErika turned around, a question mark popping into metaphorical existence over\nher head. “What’s important is that Kirihara is seriously in love with Mibu.”\n“Wha—you—?!”\n“Wow…”\n“I can’t say any more because it’s a privacy thing, but when I saw Kirihara\nfacing down Blanche’s leader, I knew he was more manly than I am.”\n“I see…” muttered Erika. “Hey, Tatsuya?”\n“What?”\n“Tell me in secret later!”\n“Chiba, you little…! Shiba, I swear, if you say anything, I’ll deny it!”\n“I won’t tell.”\n“Oh, come on, what’s it matter?”\n“You stupid cow!”\nSayaka’s parents, the nurses, and even Sayaka herself watched with loving\nsmiles as the rampaging Kirihara chased the giggling Erika around the room.\nAs Tatsuya himself watched them actually start an all-out game of tag with\nslightly less-than-loving eyes, Miyuki quietly came up next to him. “Tatsuya?”\n“Yeah?” he replied briefly, eyes still fixed on Erika and the others.\n“Miyuki will stay with you forever—even if you run away at the speed of\nsound, and even if you pierce through the sky and soar up to the stars.”\n“…I’d think I’d be the one left behind, not you,” he said, smiling a little",
  "page_184": "pathetically. “But for now, we need to get our feet firmly on the ground before\nlooking upward.”\nMiyuki gave him a mischievous smile back. “Are we going back to school?”\n“Yeah. We’ll have to stay late this weekend if we don’t attend afternoon\nclasses.”\nShe knew he’d been speaking in jest. That’s why she could smile, too.\nBut still, she couldn’t help but ask something. She wanted to make sure.\n“Tatsuya… Isn’t school difficult for you? With your real power, there is no need\nfor you to attend high school in the first place… And you do it even though\nyou’re looked down on. If you’re forcing yourself for my sake, I—”\n“Miyuki,” said Tatsuya, interrupting her question. “I’m not going to high\nschool against my will. I know that I can only experience this kind of life now. I\nenjoy being a normal student with you.”\n“Tatsuya…”\n“So let’s get back to our normal life for today, shall we?”\nTatsuya, a little awkwardly, reached his hand out for Miyuki.\nShe happily took it.\n—But in the end, Erika came crying to them when she didn’t make it back in\ntime for afternoon classes, and Tatsuya had to stay late that weekend anyway.\nChapter 1 Fin"

}